Repository: KDE/kdiff3
Catalog: po/sa/kdiff3.po
Languages: sa

source: All input files contain the same text, but are not binary equal.
sa: सर्वेषु निवेशसञ्चिकासु समानः पाठः भवति, परन्तु द्विचक्रिका समानाः न सन्ति ।

source: Files %1 and %2 have equal text, but are not binary equal.
sa: %1 तथा %2 सञ्चिकासु समानपाठः अस्ति, परन्तु द्विचक्रीयसमः नास्ति ।

source: Some input files do not seem to be pure text files. Note that the KDiff3 merge was not meant for binary data. Continue at your own risk.
sa: केचन निवेशसञ्चिकाः शुद्धपाठसञ्चिकाः न दृश्यन्ते । ध्यानं कुर्वन्तु यत् KDiff3 विलयः द्विचक्रीयदत्तांशस्य कृते न अभिप्रेतः आसीत् । स्वस्य जोखिमेन निरन्तरं कुर्वन्तु।

source: , B
sa: , ख

source: , C
sa: , सी

source: Some input characters could not be converted to valid unicode. You might be using the wrong codec. (e.g. UTF-8 for non UTF-8 files). Do not save the result if unsure. Continue at your own risk. Affected input files are in %1.
sa: केचन निवेशवर्णाः वैध-यूनिकोड-रूपेण परिवर्तयितुं न शक्तवन्तः । भवान् गलत् कोडेकस्य उपयोगं करोति स्यात् । (उदा. अ UTF-8 सञ्चिकानां कृते UTF-8)। अनिश्चितः चेत् परिणामं न रक्षन्तु। स्वस्य जोखिमेन निरन्तरं कुर्वन्तु। प्रभाविताः निवेशसञ्चिकाः %1 मध्ये सन्ति ।

source: Abort
sa: गर्भपातं कुरुत

source: Continue Merging
sa: विलीनीकरणं निरन्तरं कुर्वन्तु

source: Opening files...
sa: सञ्चिकाः उद्घाटयन्...

source: Cutting selection...
sa: चयनं कटयन्...

source: Copying selection to clipboard...
sa: चयनस्य प्रतिलिपिः क्लिपबोर्ड् मध्ये भवति...

source: Inserting clipboard contents...
sa: क्लिपबोर्ड सामग्रीं सम्मिलितं कुर्वन्...

source: Ok
sa: अस्तु

source: Go to Line
sa: Line इति गच्छन्तु

source: Word wrap (Cancel disables word wrap)
sa: Word wrap (Cancel इत्यनेन शब्दवेष्टनं निष्क्रियं भवति)

source: Calculating max width for horizontal scrollbar
sa: क्षैतिजस्क्रॉलबारस्य अधिकतमविस्तारस्य गणना

source: Save && Continue
sa: रक्षन्तु && निरन्तरं कुर्वन्तु

source: Continue Without Saving
sa: रक्षणं विना निरन्तरं कुर्वन्तु

source: Search complete.
sa: अन्वेषणं सम्पन्नम्।

source: Search Complete
sa: अन्वेषण सम्पूर्ण

source: Nothing is selected in either diff input window.
sa: द्वयोः अपि diff input विण्डो मध्ये किमपि न चयनितम् ।

source: Error while adding manual diff range
sa: मैनुअल् diff range योजयन् त्रुटिः

source: &Cancel
sa: &निरसयतु

source: Swap %1<->%2
sa: %1<->%2 स्वैप कुर्वन्तु

source: Copy %1->Output
sa: %1->निष्पन्नं प्रतिलिख्यताम्

source: Swap %1<->Output
sa: %1<->निर्गमः स्वैप कुर्वन्तु

source: Configure...
sa: विन्यस्तं कुर्वन्तु...

source: Open Folder
sa: Folder उद्घाटयन्तु

source: Select Output File
sa: Output File इति चिनोतु

source: Search text:
sa: पाठः अन्वेष्टुम् :

source: Case sensitive
sa: प्रकरणसंवेदनशीलः

source: Search A
sa: अन्वेषणम् A

source: Search B
sa: अन्वेषणं ख

source: Search C
sa: अन्वेषणं C

source: Search output
sa: निर्गमं अन्वेष्टुम्

source: &Search
sa: &अन्वेषण

source: Regular Expression Tester
sa: नियमित अभिव्यक्ति परीक्षक

source: Example auto merge line:
sa: उदाहरणम् स्वतः विलयपङ्क्तिः :

# Tool Tip
source: To test auto merge, copy a line as used in your files.
sa: auto merge इत्यस्य परीक्षणार्थं भवतः सञ्चिकासु यथा प्रयुक्ता तथा रेखां प्रतिलिख्यताम् ।

source: Match result:
sa: मैचस्य परिणामः :

source: Example history start line (with leading comment):
sa: उदाहरणम् इतिहासस्य आरम्भपङ्क्तिः (अग्रणीटिप्पण्या सह):

# Tool Tip
source: Copy a history start line as used in your files, including the leading comment.
sa: भवतः सञ्चिकासु यथा उपयुज्यते तथा इतिहासस्य आरम्भपङ्क्तिं प्रतिलिख्यताम्, प्रमुखटिप्पणी सहित।

source: History sort key order:
sa: इतिहास क्रमबद्धकुंजी क्रमः :

source: Example history entry start line (without leading comment):
sa: उदाहरणम् इतिहासप्रविष्टिः आरम्भपङ्क्तिः (अग्रणीटिप्पणीं विना):

# Tool Tip
source: Copy a history entry start line as used in your files, but omit the leading comment.
sa: यथा स्वसञ्चिकासु उपयुज्यते तथा इतिहासप्रविष्टिप्रारम्भपङ्क्तिं प्रतिलिख्यताम्, परन्तु प्रमुखटिप्पणीं परित्यजन्तु।

source: Sort key result:
sa: क्रमबद्धकुंजी परिणामः :

source: Match success.
sa: सफलतां मेलनं कुर्वन्तु।

source: Match failed.
sa: मेलनं असफलम् अभवत्।

source: Opening and closing parentheses do not match in regular expression.
sa: नियमितव्यञ्जने उद्घाटनसमापनकोष्ठकयोः मेलनं न भवति ।

source: Writing clipboard data to temp file failed.
sa: temp सञ्चिकायां क्लिप्बोर्डदत्तांशं लिखितुं विफलम् ।

source: From Clipboard
sa: क्लिप्बोर्डात्

source: %1 is not a normal file.
sa: %1 सामान्यसञ्चिका नास्ति ।

# Error message. %1 = filepath
source: File %1 too large to process. Skipping.
sa: सञ्चिका %1 अतीव विशाला प्रक्रिया कर्तुं । लङ्घनम्।

source: Temp file is: %1
sa: Temp सञ्चिका अस्ति: %1

source: Preprocessing possibly failed. Check this command: %1 The preprocessing command will be disabled now.
sa: पूर्वसंसाधनं सम्भवतः विफलम् अभवत् । एतत् आदेशं पश्यन्तु: %1 पूर्वसंसाधन आदेशः इदानीं निष्क्रियः भविष्यति ।

source: The line-matching-preprocessing possibly failed. Check this command: %1 The line-matching-preprocessing command will be disabled now.
sa: रेखा-मेलन-पूर्वसंसाधनं सम्भवतः विफलम् अभवत् । एतत् आदेशं पश्यन्तु: %1 line-matching-preprocessing आदेशः इदानीं निष्क्रियः भविष्यति ।

# Read error message. %1 = filepath
source: Failed to read file: %1
sa: सञ्चिकां पठितुं असफलम्: %1

source: Opens documents for comparison...
sa: तुलनायै दस्तावेजान् उद्घाटयति...

source: Reload
sa: पुनः लोड करें

source: Saves the merge result. All conflicts must be solved!
sa: विलयफलं रक्षति । सर्वेषां विग्रहाणां समाधानं करणीयम्!

source: Saves the current document as...
sa: वर्तमानदस्तावेजं रूपेण रक्षति...

source: Print the differences
sa: भेदाः मुद्रयन्तु

source: Quits the application
sa: अनुप्रयोगं त्यजति

source: Undo last action.
sa: अन्तिमक्रिया पूर्ववर्ती।

source: Cuts the selected section and puts it to the clipboard
sa: चयनितं विभागं छित्त्वा क्लिप्बोर्ड् मध्ये स्थापयति

source: Copies the selected section to the clipboard
sa: चयनितं विभागं क्लिप्बोर्ड् प्रति प्रतिलिखति

source: Pastes the clipboard contents to current position
sa: क्लिप्बोर्ड् सामग्रीं वर्तमानस्थाने चिनोति

source: Select everything in current window
sa: वर्तमानविण्डो मध्ये सर्वं चिनोतु

source: Expecting space after closing quote.
sa: उद्धरणं समापनानन्तरं स्थानस्य अपेक्षा।

source: Unmatched quote.
sa: अतुलनीय उद्धरण।

source: Unexpected quote character within argument.
sa: तर्कस्य अन्तः अप्रत्याशित उद्धरणवर्णः।

source: No program specified.
sa: कोऽपि कार्यक्रमः निर्दिष्टः नास्ति।
