Repository: KDE/kdiff3
Catalog: po/sa/kdiff3.po
Languages: sa

# NAME OF TRANSLATORS
source: Your names
sa: श्रीकान्त् कलवार्

# EMAIL OF TRANSLATORS
source: Your emails
sa: skkalwar999@gmail.com

source: Getting file status: %1
sa: सञ्चिकास्थितिं प्राप्तुं: %1

# Message for progress dialog %1 = path to file
source: Reading file: %1
sa: सञ्चिकां पठति: %1

# Message for progress dialog %1 = path to file
source: Writing file: %1
sa: सञ्चिकां लिखति: %1

source: Out of memory
sa: स्मृतेः बहिः

# Message for progress dialog %1 = path to file
source: Making folder: %1
sa: पुटं करणम्: %1

# Message for progress dialog %1 = path to file
source: Removing folder: %1
sa: पुटं निष्कासयति: %1

# Message for progress dialog %1 = path to file
source: Removing file: %1
sa: सञ्चिकां निष्कासयति: %1

source: Creating symbolic link: %1 -> %2
sa: प्रतीकात्मकलिङ्कस्य निर्माणम्: %1 -> %2

source: Renaming file: %1 -> %2
sa: सञ्चिकायाः पुनर्नामकरणम् : %1 -> %2

source: Copying file: %1 -> %2
sa: सञ्चिकायाः प्रतिलिपिः भवति: %1 -> %2

# Status message
source: Reading folder: %1
sa: पठनपुटम्: %1

source: Listing directory: %1
sa: सूचीनिर्देशिका: %1

source: Data loss error: If it is reproducible please contact the author.
sa: दत्तांशहानिदोषः : १. यदि पुनरुत्पादनीयं भवति तर्हि लेखकेन सह सम्पर्कं कुर्वन्तु।

source: Severe Internal Error
sa: गम्भीर आन्तरिक त्रुटि

source: File %1: Line %2
sa: सञ्चिका %1: रेखा %2

source: File %1: Line not available
sa: सञ्चिका %1: रेखा उपलब्धा नास्ति

source: Encoding:
sa: एन्कोडिंग् :

source: Line end style:
sa: रेखासमाप्तशैली :

source: A (Base)
sa: क (आधारः)

source: Encoding: %1
sa: एन्कोडिंग्: %1

source: DOS
sa: OF THE

source: Unix
sa: यूनिक्स

source: Line end style: %1
sa: रेखासमाप्तशैली: %1

source: Unknown
sa: अज्ञात

source: Top line
sa: शीर्ष रेखा

source: End
sa: अंत

source: Open File
sa: सञ्चिकां उद्घाटयन्तु

source: Unicode, 8 bit
sa: यूनिकोड, ८ बिट्

source: Unicode, 8 bit (BOM)
sa: यूनिकोड, ८ बिट् (BOM)

source: System
sa: व्यवस्था

source: Other
sa: इतर

# Operation column message
source: Copy A to B
sa: कतः खं प्रति प्रतिलिख्यताम्

# Operation column message
source: Copy B to A
sa: ख तः क प्रति प्रतिलिपि कुर्वन्तु

# Operation column message
source: Delete A
sa: विलोपनं त्रि०

# Operation column message
source: Delete B
sa: विलोपनं ख

# Operation column message
source: Delete A & B
sa: A & B विलोपयतु

# Operation column message
source: Merge to A
sa: विलयः अ०

# Operation column message
source: Merge to B
sa: B. इति विलीनीकरणं कुर्वन्तु

# Operation column message
source: Merge to A & B
sa: A & B इत्यत्र विलयः

# Operation column message
source: Delete (if exists)
sa: विलोपयतु (यदि अस्ति)

# Operation column message (Directory merge)
source: Merge
sa: विलयः

# Operation column message (File merge)
source: Merge (manual)
sa: विलयन (पुस्तिका)

# Operation column message
source: Error: Conflicting File Types
sa: त्रुटिः : परस्परविरोधिनः सञ्चिकाप्रकाराः

# Operation column message
source: Error: Changed and Deleted
sa: त्रुटिः : परिवर्तितः विलोपितः च

# Operation column message
source: Error: Dates are equal but files are not.
sa: त्रुटिः - तिथयः समानाः सन्ति किन्तु सञ्चिकाः समानाः न सन्ति ।

# Status column message
source: Done
sa: कृतम्‌

# Status column message
source: Error
sa: त्रुटि

# Status column message
source: Skipped.
sa: लङ्घितम्।

# Status column message
source: Not saved.
sa: न रक्षितम्।

# Status column message
source: In progress...
sa: प्रगतिशीलः अस्ति...

# Status column message
source: To do.
sa: कर्तुं ।

# Column title
source: Name
sa: नामः

# Column title
source: Operation
sa: संचालन

# Column title
source: Status
sa: स्थितिः

# Column title
source: Unsolved
sa: अनवधानम्

# Column title
source: Solved
sa: समाधानं कृतम्

# Column title
source: Nonwhite
sa: अश्वेत

# Column title
source: White
sa: श्वेतः

source: You are currently doing a folder merge. Are you sure, you want to abort the merge and rescan the folder?
sa: भवान् सम्प्रति पुटविलयनं करोति । किं भवान् निश्चिन्तः अस्ति, भवान् विलयं निरस्तं कर्तुम् इच्छति तथा च पुटं पुनः स्कैन् कर्तुम् इच्छति?

# Error dialog title
source: Warning
sa: चेतवानी

# Title for rescan button
source: Rescan
sa: पुनः स्कैन करें

# Title for continue button
source: Continue Merging
sa: विलीनीकरणं निरन्तरं कुर्वन्तु

source: Opening of folders failed:
sa: पुटस्य उद्घाटनं विफलम् अभवत् :

source: Folder A "%1" does not exist or is not a folder.
sa: पुटं "%1" नास्ति अथवा पुटे नास्ति ।

source: Folder B "%1" does not exist or is not a folder.
sa: पुटं B "%1" नास्ति अथवा पुटे नास्ति ।

source: Folder C "%1" does not exist or is not a folder.
sa: पुटं C "%1" नास्ति अथवा पुटे नास्ति ।

# Error dialog title
source: Folder Opening Error
sa: समुच्चय उद्घाटने त्रुटिः

source: The destination folder must not be the same as A or B when three folders are merged. Check again before continuing.
sa: गन्तव्यपुटं A अथवा B इत्यस्य समानं न भवितुमर्हति यदा त्रयः पुटाः विलीनाः भवन्ति । निरन्तरं कर्तुं पूर्वं पुनः पश्यन्तु।

# Error dialog title
source: Parameter Warning
sa: पैरामीटर चेतावनी

source: Scanning folders...
sa: फ़ोल्डर् स्कैनिङ्ग...

# Status message
source: Reading Folder A
sa: पठनपुटम् A

# Status message
source: Reading Folder B
sa: पठनपुटं B

# Status message
source: Reading Folder C
sa: पठनपुटम् C

# Warning text
source: Some subfolders were not readable in
sa: केचन उपपुटाः पठनीयाः न आसन्

# Warning text
source: Check the permissions of the subfolders.
sa: उपपुटस्य अनुमतिः परीक्ष्यताम् ।

# Status bar idle message.
source: Ready.
sa: आत्त।

source: Folder Comparison Status Number of subfolders: %1 Number of equal files: %2 Number of different files: %3
sa: फोल्डर तुलना स्थितिः उपपुटस्य संख्या: %1 समानसञ्चिकानां संख्या: %2 भिन्नसञ्चिकानां संख्या: %3

source: Number of manual merges: %1
sa: मैनुअल् विलयस्य संख्या: %1

source: This affects all merge operations.
sa: एतेन सर्वाणि विलयक्रियाणि प्रभावितानि भवन्ति ।

source: Changing All Merge Operations
sa: सर्वाणि विलयन-सञ्चालनानि परिवर्तयन्

source: Processing %1 / %2 %3
sa: %1 / %2 प्रसंस्करणम् %3

source: Some files could not be processed.
sa: केचन सञ्चिकाः संसाधितुं न शक्यन्ते स्म ।

source: Aborting due to too many errors.
sa: अत्यधिकदोषाणां कारणेन गर्भपातः।

source: This operation is currently not possible.
sa: एतत् शल्यक्रिया सम्प्रति सम्भवं नास्ति ।

source: Operation Not Possible
sa: संचालनं न सम्भवम्

source: An error occurred while copying.
sa: प्रतिलिपिं कुर्वन् त्रुटिः अभवत् ।

source: Merge Error
sa: विलयदोषः

source: Unknown merge operation. (This must never happen!)
sa: अज्ञात विलयक्रिया। (एतत् कदापि न भवितुमर्हति!)

source: Unknown merge operation.
sa: अज्ञात विलयनक्रिया।

source: The merge is about to begin. Choose "Do it" if you have read the instructions and know what you are doing. Choosing "Simulate it" will tell you what would happen. Be aware that this program still has beta status and there is NO WARRANTY whatsoever! Make backups of your vital data!
sa: विलयः आरभ्यतुं प्रवृत्तः अस्ति। यदि भवान् निर्देशान् पठितवान् अस्ति तथा च जानाति यत् भवान् किं करोति तर्हि "कुरु" इति चिनोतु। "Simulate it" इति चित्वा किं भविष्यति इति ज्ञास्यति । अवगच्छन्तु यत् अस्य कार्यक्रमस्य अद्यापि बीटा-स्थितिः अस्ति तथा च तत्र किमपि वारण्टी नास्ति! स्वस्य महत्त्वपूर्णदत्तांशस्य बैकअपं कुर्वन्तु!

# Caption
source: Starting Merge
sa: विलयम् आरभ्यते

# Button title to confirm merge
source: Do It
sa: करोतु

# Button title to simulate merge
source: Simulate It
sa: अनुकरणं कुरुत

source: The highlighted item has a different type in the different folders. Select what to do.
sa: हाइलाइट् कृतस्य द्रव्यस्य भिन्न-भिन्न-पुटयोः भिन्नः प्रकारः भवति । किं कर्तव्यमिति चिनोतु।

source: The modification dates of the file are equal but the files are not. Select what to do.
sa: सञ्चिकायाः परिवर्तनतिथयः समानाः सन्ति किन्तु सञ्चिकाः न सन्ति । किं कर्तव्यमिति चिनोतु।

source: The highlighted item was changed in one folder and deleted in the other. Select what to do.
sa: प्रकाशितं द्रव्यं एकस्मिन् पुटे परिवर्त्य अन्यस्मिन् पुटे अपाकृतम् । किं कर्तव्यमिति चिनोतु।

source: This operation is currently not possible because folder merge is currently running.
sa: सम्प्रति एतत् कार्यं सम्भवं नास्ति यतोहि पुटविलयनं सम्प्रति प्रचलति ।

source: There was an error in the last step. Do you want to continue with the item that caused the error or do you want to skip this item?
sa: अन्तिमे पदे दोषः आसीत् । किं भवन्तः यत् द्रव्यं दोषं जनयति तत् द्रव्यं निरन्तरं कर्तुम् इच्छन्ति वा एतत् द्रव्यं त्यक्तुम् इच्छन्ति वा?

# Caption for message dialog
source: Continue merge after an error
sa: दोषस्य अनन्तरं विलयं निरन्तरं कुर्वन्तु

# Continue button title
source: Continue With Last Item
sa: अन्तिमवस्तु सह निरन्तरं कुर्वन्तु

source: Merge operation complete.
sa: विलय संचालन सम्पन्न।

source: Merge Complete
sa: विलय सम्पूर्ण

source: Simulated merge complete: Check if you agree with the proposed operations.
sa: अनुकरणीयविलयनं सम्पन्नम्: प्रस्तावितैः कार्यैः सह सहमतः अस्ति वा इति पश्यन्तु।

source: An error occurred. Press OK to see detailed information.
sa: एकः दोषः अभवत् । विस्तृतसूचनाः द्रष्टुं OK नुदन्तु ।

source: Error: While deleting %1: Creating backup failed.
sa: त्रुटिः: %1 विलोपयन्ते सति: बैकअपस्य निर्माणं विफलम्।

source: delete folder recursively( %1 )
sa: पुनरावर्तनीयरूपेण पुटं विलोपयन्तु( %1 ) .

source: delete( %1 )
sa: विलोपनम्( %1 ) .

source: Error: delete folder operation failed while trying to read the folder.
sa: त्रुटिः : पुटं पठितुं प्रयतमाने पुटं विलोपयितुं कार्यं विफलम् अभवत् ।

source: Error: rmdir( %1 ) operation failed.
sa: त्रुटि: rmdir( %1 ) कार्यं विफलम्।

source: Error: delete operation failed.
sa: त्रुटिः: विलोपनक्रिया विफलम्।

source: Note: After a manual merge the user should continue by pressing F7.
sa: नोटः- मैनुअल् मर्जस्य अनन्तरं उपयोक्त्रा F7 नुदन् निरन्तरं कर्तव्यम् ।

source: Error: copy( %1 -> %2 ) failed.Deleting existing destination failed.
sa: त्रुटिः: प्रतिलिपि( %1 -> %2 ) विफलम्।विद्यमानगन्तव्यं विलोपनं विफलम्।

source: copyLink( %1 -> %2 )
sa: प्रतिलिपिलिङ्क( %1 -> %2 ) .

source: Error: copyLink failed: Remote links are not yet supported.
sa: त्रुटिः: copyLink विफलम्: दूरस्थलिङ्काः अद्यापि समर्थिताः न सन्ति।

source: Error: copyLink failed.
sa: त्रुटिः copyLink विफलम्।

source: copy( %1 -> %2 )
sa: प्रतिलिपि( %1 -> %2 ) .

source: Error during rename( %1 -> %2 ): Cannot delete existing destination.
sa: rename( %1 -> %2 ) इत्यस्य समये त्रुटिः : विद्यमानं गन्तव्यं विलोपयितुं न शक्यते ।

source: rename( %1 -> %2 )
sa: नामान्तरण( %1 -> %2 ) .

source: Error: Rename failed.
sa: त्रुटिः : पुनर्नामकरणं विफलम् ।

source: Error during makeDir of %1. Cannot delete existing file.
sa: %1 इत्यस्य makeDir इत्यस्य समये त्रुटिः । विद्यमानं सञ्चिकां विलोपयितुं न शक्यते ।

source: makeDir( %1 )
sa: makeDir( %1 ) 1 .

source: Error while creating folder.
sa: पुटस्य निर्माणकाले त्रुटिः।

source: Dest
sa: हस्त

# Header label
source: Folder
sa: समुच्चय

# Header label
source: Type
sa: प्रकारः

# Header label
source: Size
sa: आकृति

# Header label
source: Attr
sa: अत्र्

# Header label
source: Last Modification
sa: अन्तिम परिवर्तन

# Header label
source: Link-Destination
sa: लिङ्क-गन्तव्य

# Header label
source: File
sa: सञ्चिका

# Header label ending
source: -Link
sa: -सम्बन्ध

# Header label
source: not available
sa: न लभ्यते

source: A (Dest):
sa: क (देष्ट्) :

source: A:
sa: एकः:

source: A (Base):
sa: क (आधारः) .

source: B (Dest):
sa: ख (देस्ट) :

source: B:
sa: ख:

source: C (Dest):
sa: ग (देष्ट) :

source: C:
sa: ग: .

source: Dest:
sa: हस्ताः :

source: Save Folder Merge State As...
sa: फ़ोल्डर विलय राज्यं रक्षन्तु यथा...

source: Start/Continue Folder Merge
sa: पुटविलयनं आरभ्य/निरन्तरताम्

source: Run Operation for Current Item
sa: वर्तमान मदस्य कृते Operation चालयन्तु

source: Compare Selected File
sa: चयनितसञ्चिकायाः तुलनां कुर्वन्तु

source: Merge Current File
sa: वर्तमान सञ्चिकां विलीनं कुर्वन्तु

source: Merge File
sa: विलयः संचिका

source: Fold All Subfolders
sa: सर्वाणि उपपुटं गुठयन्तु

source: Unfold All Subfolders
sa: All Subfolders अनफोल्ड् कुर्वन्तु

source: Rescan
sa: पुनः स्कैन करें

source: Choose A for All Items
sa: सर्वेषां वस्तूनाम् कृते A इति चिनोतु

source: Choose B for All Items
sa: सर्वेषां वस्तूनाम् कृते B इति चिनोतु

source: Choose C for All Items
sa: सर्वेषां वस्तूनाम् कृते C इति चिनोतु

source: Auto-Choose Operation for All Items
sa: सर्वेषां वस्तूनाम् कृते स्वतः संचालनं चिनोतु

source: No Operation for All Items
sa: सर्वेषां वस्तूनाम् कृते कोऽपि संचालनः नास्ति

source: Show Identical Files
sa: समानसञ्चिकाः दर्शयतु

source: Identical Files
sa: संरूप सञ्चिकाः

source: Show Different Files
sa: भिन्नानि सञ्चिकाः दर्शयतु

source: Show Files only in A
sa: केवलं A मध्ये Files दर्शयतु

source: Files only in A
sa: सञ्चिकाः केवलं त्रि०

source: Show Files only in B
sa: केवलं B मध्ये Files दर्शयतु

source: Files only in B
sa: सञ्चिकाः केवलं ख

source: Show Files only in C
sa: केवलं C मध्ये Files दर्शयतु

source: Files only in C
sa: सञ्चिकाः केवलं ग

source: Compare Explicitly Selected Files
sa: स्पष्टतया चयनितसञ्चिकानां तुलनां कुर्वन्तु

source: Merge Explicitly Selected Files
sa: स्पष्टतया चयनितसञ्चिकानां विलयः

source: Do Nothing
sa: किमपि न कुरु

source: Merge
sa: विलयः

source: Delete (if exists)
sa: विलोपयतु (यदि अस्ति)

source: Copy A to B
sa: कतः खं प्रति प्रतिलिख्यताम्

source: Copy B to A
sa: ख तः क प्रति प्रतिलिपि कुर्वन्तु

source: Delete A
sa: विलोपनं त्रि०

source: Delete B
sa: विलोपनं ख

source: Delete A && B
sa: A && B विलोपयतु

source: Merge to A
sa: विलयः अ०

source: Merge to B
sa: B. इति विलीनीकरणं कुर्वन्तु

source: Merge to A && B
sa: A && B इत्यत्र विलयः

# @info:shell
source: Unable to determine full url. No parent specified.
sa: पूर्ण url निर्धारयितुं असमर्थः। कोऽपि मातापिता निर्दिष्टः नास्ति।

# @info:shell
source: Parent and child could not be distinguished.
sa: मातापितरौ बालकौ च भेदं कर्तुं न शक्तवन्तौ ।

# @info:shell
source: Computed url is:
sa: गणितं url अस्ति :

# @info %1 is a path
source: Failed to read file: %1
sa: सञ्चिकां पठितुं असफलम्: %1

# @info %1 is a path
source: User cancelled read operation on %1
sa: उपयोक्ता %1 इत्यत्र पठनक्रिया रद्दं कृतवान्

# @info:status
source: User cancelled write operation.
sa: उपयोक्ता लेखनक्रिया रद्दं कृतवान्।

# @info:status %1 is the destination path
source: Creating temp copy of %1 failed.
sa: %1 इत्यस्य temp प्रतिलिपिं निर्मातुं विफलम् ।

# @info:status %1 is the path, %2 is the error message
source: Opening %1 failed. %2
sa: %1 उद्घाटनं विफलम् । %2

# @info:status %1 is the path, %2 is the error message
source: Error reading from %1. %2
sa: %1 तः पठने त्रुटिः । %2

# @info %1 is the path that failed
source: While trying to make a backup, deleting an older backup failed. Filename: %1
sa: बैकअपं कर्तुं प्रयतमाने पुरातनं बैकअपं विलोपनं विफलम् अभवत् । सञ्चिकानाम: %1

# @info %1 is the current path, %2 is the failed path
source: While trying to make a backup, renaming failed. Filenames: %1 -> %2
sa: बैकअपं कर्तुं प्रयतमानोऽपि नामकरणं विफलम् अभवत् । सञ्चिकानामानि: %1 -> %2

source: TextLabel
sa: TextLabel इति

source: The quick brown fox jumps over the river but the little red hen escapes with a shiver :-)
sa: द्रुतगतिः शृगालः नदीयाः उपरि कूर्दति किन्तु लघु रक्तकुक्कुटः कम्पेन पलायते :-) २.

# Button Title
source: Change Font
sa: Font परिवर्तनं कुर्वन्तु

source: Current Configuration:
sa: वर्तमान विन्यासः :

source: Config Option Error:
sa: Config विकल्पदोषः :

source: Option --auto used, but no output file specified.
sa: विकल्पः --auto प्रयुक्तः, परन्तु कोऽपि आउटपुट् सञ्चिका निर्दिष्टा नास्ति ।

source: Directory merge
sa: निर्देशिका विलयः

source: Merge info
sa: विलीनीकरण सूचना

# Error message
source: Can't compare file with folder.
sa: सञ्चिकायाः तुलनां पुटेन सह कर्तुं न शक्यते।

# Title error message box
source: Bad comparison attempt
sa: दुष्टः तुलनाप्रयासः

source: Option --auto ignored for folder comparison.
sa: विकल्पः --पुटतुलनायै स्वयमेव उपेक्षितः ।

source: Saving failed.
sa: रक्षणं विफलम् अभवत्।

source: Opening of these files failed:
sa: एतेषां सञ्चिकानां उद्घाटनं विफलम् अभवत् :

source: File open error
sa: सञ्चिका उद्घाटितदोषः

source: Enables/disables the statusbar
sa: स्थितिपट्टिकां सक्षमं/अक्षमं करोति

source: Configure KDiff3...
sa: KDiff3 विन्यस्तं कुर्वन्तु...

source: Search for a string
sa: एकं स्ट्रिंग् अन्वेष्टुम्

source: Search again for the string
sa: पुनः स्ट्रिंग् अन्वेष्टुम्

source: Go to Current Delta
sa: वर्तमान डेल्टा इति गच्छन्तु

source: Current Delta
sa: वर्त्तमानः डेल्टा

source: Go to First Delta
sa: प्रथमं डेल्टा इति गच्छन्तु

source: First Delta
sa: प्रथमः डेल्टा

source: Go to Last Delta
sa: अन्तिम डेल्टा इति गच्छन्तु

source: Last Delta
sa: अन्तिमः डेल्टा

# Tooltip explanation text
source: (Skips white space differences when "Show White Space" is disabled.)
sa: ("श्वेतस्थानं दर्शयतु" निष्क्रियं भवति चेत् श्वेतस्थानभेदं लङ्घयति ।)

# Tooltip explanation text
source: (Does not skip white space differences even when "Show White Space" is disabled.)
sa: ("श्वेतस्थानं दर्शयतु" अक्षमत्वेऽपि श्वेतस्थानभेदं न लङ्घयति ।)

source: Go to Previous Delta
sa: पूर्व डेल्टा इति गच्छन्तु

source: Prev Delta
sa: पूर्व डेल्टा

source: Go to Next Delta
sa: Next Delta इति गच्छन्तु

source: Next Delta
sa: अग्रिम डेल्टा

source: Go to Previous Conflict
sa: पूर्वविग्रहं गच्छन्तु

source: Prev Conflict
sa: पूर्व द्वंद

source: Go to Next Conflict
sa: Next Conflic इति गच्छन्तु

source: Next Conflict
sa: अग्रिम द्वंद

source: Go to Previous Unsolved Conflict
sa: पूर्वम् अनसमाधानं द्वन्द्वं गच्छन्तु

source: Prev Unsolved
sa: पूर्व अनवधानम्

source: Go to Next Unsolved Conflict
sa: Next Unsolved Conflict इति गच्छन्तु

source: Next Unsolved
sa: अग्रिम अनवधानम्

# Title for menu item
source: Go to Line
sa: Line इति गच्छन्तु

# Text used for toolbar button.
source: Go Line
sa: गच्छ पंक्ति

# Tooltip Text
source: Goto specified line.
sa: निर्दिष्टपङ्क्तिं गच्छतु।

# Title for menu item
source: Select Line(s) From A
sa: A. तः रेखा(पङ्क्तिः) चयनं कुर्वन्तु

# Text used for select A toolbar button.
source: Choose A
sa: चिनोतु एकः

# Title for menu item
source: Select Line(s) From B
sa: B तः रेखा(s) चयनं कुर्वन्तु

# Text used for select B when toolbar button.
source: Choose B
sa: चिनोतु ख

# Title for menu item
source: Select Line(s) From C
sa: C तः Line(s) चयनं कुर्वन्तु

# Text used for select C toolbar button.
source: Choose C
sa: चिनोतु ग

# Title for menu item
source: Automatically Go to Next Unsolved Conflict After Source Selection
sa: स्रोतचयनानन्तरं स्वयमेव Next Unsolved Conflict इत्यत्र गच्छन्तु

# Auto goto next unsolved toolbar text.
source: Auto Next
sa: ऑटो अग्रिम

source: Show Space && Tabulator Characters
sa: स्पेस && सारणीकार वर्ण दर्शयतु

# Show whitespace toolbar text.
source: White Characters
sa: श्वेतः वर्णाः

source: Show White Space
sa: श्वेतस्थानं दर्शयतु

# Show whitespace changes toolbar text.
source: White Deltas
sa: श्वेतः डेल्टास्

source: Show Line Numbers
sa: रेखासङ्ख्याः दर्शयतु

# Show line numbers toolbar text
source: Line Numbers
sa: पंक्ति संख्याः

source: Automatically Solve Simple Conflicts
sa: सरलविग्रहाणां स्वयमेव समाधानं कुर्वन्तु

source: Set Deltas to Conflicts
sa: Deltas इत्येतत् Conflicts इति सेट् कुर्वन्तु

source: Run Regular Expression Auto Merge
sa: Regular Expression Auto Merge चालयन्तु

source: Automatically Solve History Conflicts
sa: इतिहासस्य द्वन्द्वस्य स्वयमेव समाधानं कुर्वन्तु

source: Split Diff At Selection
sa: चयनसमये अन्तरं विभक्तम्

source: Join Selected Diffs
sa: चयनित Diffs सम्मिलित करें

source: Show Window A
sa: विण्डो दर्शयतु A

source: Show Window B
sa: विण्डो B दर्शयतु

source: Show Window C
sa: विण्डो C दर्शयतु

source: Normal Overview
sa: सामान्य अवलोकन

source: A vs. B Overview
sa: क बनाम ख अवलोकन

source: A vs. C Overview
sa: क बनाम ग अवलोकन

source: B vs. C Overview
sa: ख बनाम ग अवलोकन

source: Word Wrap Diff Windows
sa: शब्द लपेट Diff Windows

source: Add Manual Diff Alignment
sa: Manual Diff Alignment योजयन्तु

source: Clear All Manual Diff Alignments
sa: सर्वाणि मैनुअल् Diff Alignments स्वच्छं कुर्वन्तु

source: Focus Next Window
sa: फोकस अग्रिम विण्डो

source: Focus Prev Window
sa: फोकस पूर्व विण्डो

source: Toggle Split Orientation
sa: विभाजित अभिविन्यासं टॉगलं कुर्वन्तु

source: Folder && Text Split Screen View
sa: फोल्डर && पाठ विभाजित स्क्रीन दृश्य

source: Toggle Between Folder && Text View
sa: Folder && Text View इत्यस्य मध्ये Toggle कुर्वन्तु

source: Ready.
sa: आत्त।

source: The merge result has not been saved.
sa: विलयफलं न रक्षितम्।

source: Save && Quit
sa: रक्षतु && त्यजतु

source: Quit Without Saving
sa: रक्षणं विना त्यजतु

source: Saving the merge result failed.
sa: विलयपरिणामस्य रक्षणं विफलम् अभवत् ।

source: You are currently doing a folder merge. Are you sure, you want to abort?
sa: भवान् सम्प्रति पुटविलयनं करोति । किं त्वं निश्चिन्तः असि, त्वं गर्भपातं कर्तुम् इच्छसि ?

source: Saving file...
sa: सञ्चिकां रक्षति...

source: Saving file with a new filename...
sa: नूतनेन सञ्चिकानाम्ना सह सञ्चिकां रक्षति...

source: Printing not implemented.
sa: मुद्रणं न कार्यान्वितम्।

source: Printing...
sa: मुद्रण...

# Status message
source: Printing page %1 of %2
sa: %2 इत्यस्य %1 पृष्ठं मुद्रयति

source: (Selection)
sa: (चयनम्)

source: Printing completed.
sa: मुद्रणं सम्पन्नम्।

source: Printing aborted.
sa: मुद्रणं निरस्तम् अभवत्।

source: Exiting...
sa: निर्गच्छन्...

source: Toggle the statusbar...
sa: स्थितिपट्टिकां टॉगलं कुर्वन्तु...

source: &File
sa: &संचिका

source: Current Item Merge Operation
sa: वर्तमान मद विलय संचालन

source: Current Item Sync Operation
sa: वर्तमान मद समन्वय संचालन

source: M&ovement
sa: आन्दोलन

source: D&iffview
sa: D&iffview इति

source: &Window
sa: &कोष्ठ

source: Main Toolbar
sa: मुख्य साधनपट्टी

source: Ignored. (User defined.)
sa: उपेक्षितम्। (उपयोक्ता परिभाषितम्।)

# Program version info.
source: (64 bit)
sa: (६४ बिट्)

source: Tool for Comparison and Merge of Files and Folders
sa: सञ्चिकानां पुटकानां च तुलनां विलयनं च कर्तुं साधनम्

source: ©2002-2014 Joachim Eibl, ©2017 Michael Reeves KF5/Qt5 port
sa: ©2002-2014 जोआचिम Eibl, ©2017 माइकल रीव्स KF5/Qt5 बंदरगाह

source: Merge the input.
sa: निवेशं विलीनं कुर्वन्तु।

source: Explicit base file. For compatibility with certain tools.
sa: स्पष्ट आधारसञ्चिका। कतिपयैः साधनैः सह संगततायै ।

source: Output file. Implies -m. E.g.: -o newfile.txt
sa: आउटपुट् सञ्चिका । तात्पर्यम् -म. यथा- -o newfile.txt

source: Output file, again. (For compatibility with certain tools.)
sa: आउटपुट् सञ्चिका, पुनः । (कतिपयैः साधनैः सह संगततायै ।)

source: No GUI if all conflicts are auto-solvable. (Needs -o file)
sa: यदि सर्वे विग्रहाः स्वयमेव समाधानयोग्याः सन्ति तर्हि GUI नास्ति । (आवश्यकता -o सञ्चिका)

source: Ignore --auto and always show GUI.
sa: --auto इत्यस्य अवहेलनां कृत्वा सर्वदा GUI दर्शयन्तु ।

source: Ignored.
sa: उपेक्षितम्।

source: Visible name replacement for input file 1 (base).
sa: निवेशसञ्चिका 1 (आधारः) कृते दृश्यमाननामप्रतिस्थापनम् ।

source: Visible name replacement for input file 2.
sa: निवेशसञ्चिकायाः कृते दृश्यमाननामप्रतिस्थापनम् 2.

source: Visible name replacement for input file 3.
sa: निवेशसञ्चिकायाः कृते दृश्यमाननामप्रतिस्थापनम् 3.

source: Alternative visible name replacement. Supply this once for every input.
sa: वैकल्पिकं दृश्यमानं नामप्रतिस्थापनम्। प्रत्येकं निवेशस्य कृते एकवारं एतत् आपूर्तिं कुर्वन्तु।

source: Override a config setting. Use once for every setting. E.g.: --cs "AutoAdvance=1"
sa: एकं विन्याससेटिंग् अधिलिखन्तु । प्रत्येकं सेटिङ्ग् कृते एकवारं उपयोगं कुर्वन्तु। उदा.: --cs "ऑटोएडवांस=1"।

source: Show list of config settings and current values.
sa: विन्याससेटिंग्स् इत्यस्य सूचीं वर्तमानमूल्यानि च दर्शयन्तु ।

source: Use a different config file.
sa: भिन्नं विन्याससञ्चिकां उपयुज्यताम् ।

source: file1 to open (base, if not specified via --base)
sa: file1 उद्घाटयितुं (base, यदि --base मार्गेण न निर्दिष्टम्)

source: file2 to open
sa: file2 उद्घाटयितुं

source: file3 to open
sa: file3 उद्घाटयितुं

source: See kdiff3 --help for supported options.
sa: समर्थितविकल्पानां कृते kdiff3 --help पश्यन्तु ।
