Repository: KDE/kdiff3
Catalog: po/sa/kdiff3fileitemactionplugin.po
Languages: sa

# Contexualmenu title
source: KDiff3...
sa: केडिफ्3...

# Contexualmenu option
source: Compare with %1
sa: %1 इत्यनेन सह तुलनां कुर्वन्तु

# Contexualmenu option
source: Merge with %1
sa: %1 इत्यनेन सह विलयः

# Contexualmenu option
source: Save '%1' for later
sa: '%1' पश्चात् कृते रक्षन्तु

# Contexualmenu option
source: 3-way merge with base
sa: ३-मार्गेण आधारेण सह विलयः

# Contexualmenu option
source: Compare with...
sa: तुलनां कुर्वन्तु...

# Contexualmenu option to cleat comparison list
source: Clear list
sa: सूचीं स्पष्टं कुर्वन्तु

# Contexualmenu option
source: Compare
sa: तूल

# Contexualmenu option
source: 3 way comparison
sa: ३ मार्गतुलना

# Contexualmenu option
source: About KDiff3 menu plugin...
sa: KDiff3 मेनू प्लगिन् विषये...

source: KDiff3 File Item Action Plugin: Copyright ©2011 Joachim Eibl
sa: KDiff3 सञ्चिका मदं क्रिया प्लगिन्: प्रतिलिपिधर्मः ©2011 Joachim Eibl

source: Using the context menu extension: For simple comparison of two selected files choose "Compare". If the other file is somewhere else "Save" the first file for later. It will appear in the "Compare with..." submenu. Then use "Compare With" on the second file. For a 3-way merge first "Save" the base file, then the branch to merge and choose "3-way merge with base" on the other branch which will be used as destination. Same also applies to folder comparison and merge.
sa: सन्दर्भमेनूविस्तारस्य उपयोगेन : १. चयनितसञ्चिकाद्वयस्य सरलतुलनाय "Compare" इति चिनोतु । यदि अन्यः सञ्चिका अन्यत्र अस्ति तर्हि प्रथमसञ्चिकां पश्चात् कृते "Save" कुर्वन्तु । "Compare with..." उपमेनूमध्ये दृश्यते । ततः द्वितीयसञ्चिकायां "Compare With" इत्यस्य उपयोगं कुर्वन्तु । 3-मार्गीयविलयस्य कृते प्रथमं आधारसञ्चिकां "Save" कुर्वन्तु, ततः विलयार्थं शाखां च अन्यशाखायां "3-way merge with base" इति चिन्वन्तु यत् गन्तव्यरूपेण उपयुज्यते । समुच्चय तुलनायां विलीनीकरणे च अपि तथैव भवति ।

source: About KDiff3 File Item Action Plugin
sa: KDiff3 सञ्चिका मद क्रिया प्लगिन् विषये
