Repository: KDE/kdiff3
Catalog: po/sa/kdiff3.po
Languages: sa

source: Unable to compare non-normal file with normal file.
sa: असामान्यसञ्चिकायाः सामान्यसञ्चिकायाः सह तुलनां कर्तुं असमर्थः ।

source: Mix of links and normal files.
sa: लिङ्कानां सामान्यसञ्चिकानां च मिश्रणम्।

source: Link:
sa: सम्बन्ध:

source: Size.
sa: आकृति।

source: Date & Size:
sa: तिथि एवं आकार :

# Status message
source: Comparing file...
sa: सञ्चिकायाः तुलनां कुर्वन्...

source: Choose A Everywhere
sa: A Everywhere इति चिनोतु

source: Choose B Everywhere
sa: B Everywhere इति चिनोतु

source: Choose C Everywhere
sa: C Everywhere इति चिनोतु

source: Choose A for All Unsolved Conflicts
sa: सर्वेषां असमाधानविग्रहाणां कृते A इति चिनोतु

source: Choose B for All Unsolved Conflicts
sa: सर्वेषां अनसमाधानविग्रहाणां कृते B इति चिनोतु

source: Choose C for All Unsolved Conflicts
sa: सर्वेषां अनसमाधानविग्रहाणां कृते C इति चिनोतु

source: Choose A for All Unsolved Whitespace Conflicts
sa: सर्वेषां असमाधानं श्वेतस्थानविग्रहानां कृते A इति चिनोतु

source: Choose B for All Unsolved Whitespace Conflicts
sa: सर्वेषां असमाधानं श्वेतस्थानविग्रहानां कृते B चिनोतु

source: Choose C for All Unsolved Whitespace Conflicts
sa: सर्वेषां असमाधानं श्वेतस्थानविग्रहानां कृते C इति चिनोतु

source: Number of remaining unsolved conflicts: %1 (of which %2 are whitespace)
sa: अवशिष्टानां असमाधानविग्रहाणां संख्या: %1 (यत्र %2 श्वेतस्थानानि सन्ति)

source: The output has been modified. If you continue your changes will be lost.
sa: आउटपुट् परिवर्तितम् अस्ति । यदि भवन्तः निरन्तरं कुर्वन्ति तर्हि भवतः परिवर्तनं नष्टं भविष्यति।

source: All input files are binary equal.
sa: सर्वाणि निवेशसञ्चिकाः द्विचक्रीय समानानि सन्ति ।

source: All input files contain the same text.
sa: सर्वेषु निवेशसञ्चिकासु समानः पाठः भवति ।

source: Files %1 and %2 are binary equal.
sa: %1 तथा %2 सञ्चिकाः द्विचक्रीय समानाः सन्ति ।

source: Files %1 and %2 have equal text.
sa: %1 तथा %2 सञ्चिकासु समानपाठः भवति ।

source: Total number of conflicts: %1 Number of automatically solved conflicts: %2 Number of unsolved conflicts: %3 %4
sa: कुलविग्रहसङ्ख्या: %1 स्वयमेव समाधानं कृतानां विग्रहानां संख्या: %2 अनवधानविग्रहानां संख्या : %3 %4

source: Conflicts
sa: विग्रहाः

source: <No src line>
sa: <न src रेखा>

source: <Merge Conflict (Whitespace only)>
sa: <विग्रहविग्रह (केवलं श्वेतस्थानम्)>

source: <Merge Conflict>
sa: <विग्रहविग्रह>

source: Not all conflicts are solved yet. File not saved.
sa: अद्यापि सर्वे विग्रहाः समाधानं न प्राप्नुवन्ति। सञ्चिका न रक्षिता।

# Dialog title
source: Conflicts Left
sa: विग्रहाः वाम

source: There is a line end style conflict. Please choose the line end style manually. File not saved.
sa: रेखा-अन्तशैली-विग्रहः अस्ति । कृपया रेखासमाप्तशैलीं स्वहस्तेन चिनोतु । सञ्चिका न रक्षिता।

source: Creating backup failed. File not saved.
sa: बैकअपस्य निर्माणं विफलम् अभवत् । सञ्चिका न रक्षिता ।

source: File Save Error
sa: सञ्चिका रक्षणदोषः

source: Error while writing.
sa: लेखनकाले त्रुटिः।

source: Output:
sa: उत्पादनम् :

source: [Modified]
sa: [संशोधितम्]

source: Encoding for saving:
sa: रक्षणार्थं एन्कोडिंग् :

source: Conflict
sa: द्वंद

source: Codec from A: %1
sa: A: %1 तः कोडेकः

source: Codec from B: %1
sa: B: %1 तः कोडेकः

source: Codec from C: %1
sa: C: %1 तः कोडेकः

source: Select file (not saving yet)
sa: सञ्चिकां चिनोतु (अद्यापि न रक्षितम्)

source: Dialog
sa: संवादः

source: B:
sa: ख:

source: A (Base):
sa: क (आधार) :

source: Output (Optional):
sa: उत्पादनम् (वैकल्पिकम्):

source: File...
sa: संचिका...

source: Swap/Copy Names...
sa: स्वैप/प्रतिलिपि नाम...

source: C (Optional):
sa: ग (वैकल्पिक):

source: Folder...
sa: समुच्चय...

# No text styling
source: none
sa: न कश्चित्

# Font sample display, %1 = family, %2 = style, %3 = size
source: Font: %1, %2, %3 Example:
sa: फ़ॉन्ट्: %1, %2, %3 उदाहरण:

source: Latin1
sa: लैटिन1

# Tool Tip
source: Change this if non-ASCII characters are not displayed correctly.
sa: यदि अ-ASCII वर्णाः सम्यक् न प्रदर्शिताः सन्ति तर्हि एतत् परिवर्तयन्तु ।

source: Configure
sa: विन्यस्तं कुर्वन्तु

source: Font
sa: फॉन्ट्

source: Editor & Diff Output Font
sa: सम्पादकः & Diff Output Font

source: Application font
sa: अनुप्रयोग फ़ॉन्ट

source: File view font
sa: सञ्चिकादृश्यस्य फ़ॉन्ट्

# Title for color settings page
source: Color
sa: वर्ण

source: Colors Settings
sa: रङ्ग सेटिंग्स्

source: Editor and Diff Views:
sa: सम्पादकः तथा Diff Views:

source: Foreground color:
sa: अग्रभूमिवर्णः :

source: Background color:
sa: पृष्ठभूमिवर्णः :

source: Diff background color:
sa: Diff पृष्ठभूमिवर्णः :

source: Color A:
sa: वर्णः क: .

source: Color B:
sa: रङ्ग ख :

source: Color C:
sa: वर्ण ग : .

source: Conflict color:
sa: द्वन्द्ववर्णः :

source: Current range background color:
sa: वर्तमानपरिधिपृष्ठभूमिवर्णः :

source: Current range diff background color:
sa: वर्तमानपरिधिः diff पृष्ठभूमिवर्णः:

source: Color for manually aligned difference ranges:
sa: मैन्युअल् रूपेण संरेखितानां भेदपरिधिनां कृते वर्णः :

source: Folder Comparison View:
sa: समुच्चय तुलनादृश्यम् :

source: Newest file color:
sa: नवीनतमः सञ्चिकावर्णः :

source: Changing this color will only be effective when starting the next folder comparison.
sa: एतत् वर्णं परिवर्तयितुं केवलं तदा एव प्रभावी भविष्यति यदा अग्रिमपुटतुलना आरभ्यते ।

source: Oldest file color:
sa: प्राचीनतमः सञ्चिकावर्णः :

source: Middle age file color:
sa: मध्यमयुगस्य सञ्चिकावर्णः :

source: Color for missing files:
sa: लुप्तसञ्चिकानां कृते वर्णः :

source: Editor
sa: सम्पादक

source: Editor Behavior
sa: सम्पादक व्यवहार

source: Tab inserts spaces
sa: ट्याब् रिक्तस्थानानि सम्मिलितं करोति

# Tool Tip
source: On: Pressing tab generates the appropriate number of spaces. Off: A tab character will be inserted.
sa: On: ट्याब् नुदनेन समुचितसङ्ख्यायां रिक्तस्थानानि उत्पद्यन्ते । Off: एकं ट्याब् वर्णं सम्मिलितं भविष्यति।

source: Tab size:
sa: ट्याब् आकारः :

source: Auto indentation
sa: स्वतः इण्डेन्टेशन

# Tool Tip
source: On: The indentation of the previous line is used for a new line.
sa: On: पूर्वरेखायाः निक्षेपः नूतनरेखायाः कृते उपयुज्यते ।

source: Auto copy selection
sa: स्वतः प्रतिलिपिचयनम्

# Tool Tip
source: On: Any selection is immediately written to the clipboard. Off: You must explicitly copy e.g. via Ctrl-C.
sa: On: यत्किमपि चयनं तत्क्षणमेव क्लिप्बोर्ड् मध्ये लिख्यते। Off: भवता स्पष्टतया प्रतिलिपिः करणीयम् उदा. via Ctrl-C.

# Unix line ending
source: Unix
sa: यूनिक्स

# Dos/Windows line ending
source: Dos/Windows
sa: दोस/विण्डोज

# Automatically detected line ending
source: Autodetect
sa: ऑटोडिटेक्ट्

# Tool Tip
source: Sets the line endings for when an edited file is saved. DOS/Windows: CR+LF; UNIX: LF; with CR=0D, LF=0A
sa: सम्पादितसञ्चिका कदा रक्षिता भवति तदर्थं रेखासमाप्तिः सेट् करोति । DOS/Windows: सीआर + एलएफ; UNIX: LF; सीआर=0डी, एलएफ=0ए सहित

source: Diff Settings
sa: Diff सेटिंग्स्

source: Ignore numbers (treat as white space)
sa: संख्यानां अवहेलना (श्वेतस्थानरूपेण व्यवहारः)

# Tool Tip
source: Ignore number characters during line matching phase. (Similar to Ignore white space.) Might help to compare files with numeric data.
sa: रेखामेलनचरणस्य समये संख्यावर्णानां अवहेलनां कुर्वन्तु । (Ignore white space इत्यस्य सदृशम्।) संख्यात्मकदत्तांशैः सह सञ्चिकानां तुलनायां साहाय्यं कर्तुं शक्नोति ।

source: Ignore C/C++ comments (treat as white space)
sa: C/C++ टिप्पणीनां अवहेलनां कुर्वन्तु (श्वेतस्थानरूपेण व्यवहरन्तु)

# Tool Tip
source: Treat C/C++ comments like white space.
sa: C/C++ टिप्पणीं श्वेतस्थानवत् व्यवहरन्तु।

source: Ignore case (treat as white space)
sa: प्रकरणम् अवहेलयतु (श्वेतस्थानम् इति व्यवहरतु)

# Tool Tip
source: Treat case differences like white space changes. ('a'<=>'A')
sa: प्रकरणभेदं श्वेतस्थानपरिवर्तनवत् व्यवहरन्तु। ('क'<=>'क')

source: Preprocessor command:
sa: पूर्वसंसाधक आदेशः :

# Tool Tip
source: User defined pre-processing. (See the docs for details.)
sa: उपयोक्तृ परिभाषितं पूर्वसंसाधनम्। (विवरणार्थं docs पश्यन्तु।)

source: Line-matching preprocessor command:
sa: रेखा-मेलन-पूर्व-संसाधक-आदेशः :

# Tool Tip
source: This pre-processor is only used during line matching. (See the docs for details.)
sa: इदं पूर्वसंसाधकं केवलं रेखामेलनस्य समये एव उपयुज्यते । (विवरणार्थं docs पश्यन्तु।)

source: Try hard (slower)
sa: कठिनं प्रयतस्व (मन्दतरम्)

# Tool Tip
source: Enables the --minimal option for the external diff. The analysis of big files will be much slower.
sa: बाह्य diff कृते --minimal विकल्पं सक्षमं करोति । बृहत् सञ्चिकानां विश्लेषणं बहु मन्दतरं भविष्यति।

source: Align B and C for 3 input files
sa: 3 इनपुट् सञ्चिकानां कृते B तथा C संरेखयन्तु

# Tool Tip
source: Try to align B and C when comparing or merging three input files. Not recommended for merging because merge might get more complicated. (Default is off.)
sa: त्रीणि इनपुट् सञ्चिकाः तुलनां कुर्वन् वा विलयं वा कुर्वन् B तथा C इत्येतयोः संरेखणं कर्तुं प्रयतध्वम् । विलयार्थं न अनुशंसितम् यतः विलयः अधिकं जटिलं भवितुम् अर्हति । (पूर्वनिर्धारितं निष्क्रियम् अस्ति।)

# Settings page
source: Merge
sa: विलयः

source: Merge Settings
sa: सेटिङ्ग्स् विलयनम्

source: Auto advance delay (ms):
sa: स्वतः अग्रिमविलम्बः (ms): .

# Tool Tip
source: When in Auto-Advance mode the result of the current selection is shown for the specified time, before jumping to the next conflict. Range: 0-2000 ms
sa: यदा Auto-Advance मोड् मध्ये वर्तमानचयनस्य परिणामः दर्शितः भवति निर्दिष्टकालपर्यन्तं, अग्रिमविग्रहं प्रति कूर्दनात् पूर्वम्। सीमा: 0-2000 एमएस

source: Show info dialogs
sa: info संवादं दर्शयतु

# Tool Tip
source: Show a dialog with information about the number of conflicts.
sa: विग्रहसङ्ख्यायाः विषये सूचनायुक्तं संवादं दर्शयतु ।

source: White space 2-file merge default:
sa: श्वेतस्थानम् २-सञ्चिकाविलयनं पूर्वनिर्धारितम्:

source: Manual Choice
sa: मैनुअल विकल्प

# Tool Tip
source: Allow the merge algorithm to automatically select an input for white-space-only changes.
sa: विलय-एल्गोरिदम् स्वयमेव श्वेत-अन्तरिक्ष-परिवर्तनानां कृते निवेशं चयनं कर्तुं अनुमन्यताम् ।

source: White space 3-file merge default:
sa: श्वेतस्थानम् ३-सञ्चिकाविलयनं पूर्वनिर्धारितम्:

source: Automatic Merge Regular Expression
sa: स्वचालित विलय नियमित अभिव्यक्ति

source: Auto merge regular expression:
sa: स्वतः विलीनीकरण नियमितव्यञ्जनम् :

source: Run regular expression auto merge on merge start
sa: विलयस्य आरम्भे नियमितव्यञ्जनं auto merge चालयन्तु

# Tool Tip
source: Run the merge for auto merge regular expressions immediately when a merge starts.
sa: auto merge regular expressions कृते merge चालयन्तु तत्क्षणमेव यदा विलयः आरभ्यते।

source: Version Control History Merging
sa: संस्करणनियन्त्रण इतिहासः विलयनम्

source: History start regular expression:
sa: इतिहासः नियमितव्यञ्जनस्य आरम्भः :

source: History entry start regular expression:
sa: इतिहासप्रविष्टिः नियमितव्यञ्जनं आरभ्यते:

source: History merge sorting
sa: इतिहास विलय क्रमणं

# Tool Tip
source: Sort version control history by a key.
sa: संस्करणनियन्त्रण इतिहासं कुञ्जीद्वारा क्रमयन्तु ।

source: History entry start sort key order:
sa: इतिहासप्रविष्टिः आरभत क्रमबद्धकुञ्जीक्रमः:

source: Merge version control history on merge start
sa: विलयस्य आरम्भे संस्करणनियन्त्रण-इतिहासस्य विलयः

# Tool Tip
source: Run version control history auto-merge on merge start.
sa: विलयप्रारम्भे संस्करणनियन्त्रण-इतिहासः स्वयमेव विलयनं चालयन्तु ।

source: Max number of history entries:
sa: इतिहासप्रविष्टीनां अधिकतमसंख्या :

# Tool Tip
source: Cut off after specified number. Use -1 for infinite number of entries.
sa: निर्दिष्टसङ्ख्यायाः अनन्तरं कटितम्। अनन्तसङ्ख्यायाः प्रविष्टीनां कृते -1 इत्यस्य उपयोगं कुर्वन्तु ।

source: Test your regular expressions
sa: स्वस्य नियमितव्यञ्जनानां परीक्षणं कुर्वन्तु

source: Irrelevant merge command:
sa: अप्रासंगिकः विलय आदेशः :

# Tool Tip
source: If specified this script is run after auto-merge when no other relevant changes were detected. Called with the parameters: filename1 filename2 filename3
sa: यदि निर्दिष्टं भवति तर्हि एषा स्क्रिप्ट् स्वतः-विलयनस्य अनन्तरं चाल्यते यदा अन्ये प्रासंगिकाः परिवर्तनाः न ज्ञाताः। पैरामीटर् इत्यनेन सह आह्वानं कृतम्: filename1 filename2 filename3

source: Auto save and quit on merge without conflicts
sa: स्वतः रक्षणं कृत्वा विग्रहं विना विलीनीकरणे निर्गमनं कुर्वन्तु

# Tool Tip
source: If KDiff3 was started for a file-merge from the command line and all conflicts are solvable without user interaction then automatically save and quit. (Similar to command line option "--auto".)
sa: यदि आदेशपङ्क्तौ सञ्चिका-विलयस्य कृते KDiff3 आरब्धम् आसीत् तथा च सर्वम् विग्रहाः उपयोक्तृ-अन्तर्क्रियां विना समाधानीयाः भवन्ति ततः स्वयमेव रक्षन्ति, निर्गच्छन्ति च । (आदेशपङ्क्तिविकल्पस्य "--auto" इत्यस्य सदृशम्) ।

# Tab title label
source: Folder
sa: समुच्चय

source: Recursive folders
sa: पुनरावर्तनीयपुटम्

# Tool Tip
source: Whether to analyze subfolders or not.
sa: उपपुटस्य विश्लेषणं कर्तव्यं वा न वा।

source: File pattern(s):
sa: सञ्चिकाप्रतिमान(s): .

# Tool Tip
source: Pattern(s) of files to be analyzed. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
sa: विश्लेषणीयसञ्चिकानां प्रतिमानं (प्रतिरूपाः) । वाइल्डकार्ड्स् : '*' तथा '?' विभाजकस्य उपयोगेन अनेकाः प्रतिमानाः निर्दिष्टुं शक्यन्ते: ';'

source: File-anti-pattern(s):
sa: सञ्चिका-विरोधी-प्रतिमान(s): .

# Tool Tip
source: Pattern(s) of files to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
sa: विश्लेषणात् बहिष्कृत्य सञ्चिकानां प्रतिमानं (प्रतिरूपाः) । वाइल्डकार्ड्स् : '*' तथा '?' विभाजकस्य उपयोगेन अनेकाः प्रतिमानाः निर्दिष्टुं शक्यन्ते: ';'

source: Folder-anti-pattern(s):
sa: फोल्डर-विरोधी पैटर्न (s): .

# Tool Tip
source: Pattern(s) of folders to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
sa: विश्लेषणात् बहिष्कृत्य पुटस्य प्रतिमानं (प्रतिरूपाः) । वाइल्डकार्ड्स् : '*' तथा '?' विभाजकस्य उपयोगेन अनेकाः प्रतिमानाः निर्दिष्टुं शक्यन्ते: ';'

source: Use Ignore File
sa: Ignore File इत्यस्य उपयोगं कुर्वन्तु

# Tool Tip
source: Extends the anti-pattern to anything that would be ignored by source control. Via local ignore files this can be folder-specific.
sa: स्रोतनियन्त्रणेन उपेक्षितं यत्किमपि स्यात् तत् प्रति-प्रतिरूपं विस्तारयति । स्थानीय अवहेलना सञ्चिकानां माध्यमेन एतत् पुटविशिष्टं भवितुम् अर्हति ।

source: Find hidden files and folders
sa: गुप्तसञ्चिकाः, पुटं च अन्वेष्टुम्

# Tool Tip
source: Finds hidden files and folders.
sa: गुप्तसञ्चिकाः, पुटं च अन्वेषयति ।

source: Follow file links
sa: सञ्चिकालिङ्कानां अनुसरणं कुर्वन्तु

# Tool Tip
source: On: Compare the file the link points to. Off: Compare the links.
sa: On: लिङ्क् सूचयति सञ्चिकायाः तुलनां कुर्वन्तु । Off: लिङ्कानां तुलनां कुर्वन्तु।

source: Follow folder links
sa: पुटलिङ्कानां अनुसरणं कुर्वन्तु

# Tool Tip
source: On: Compare the folder the link points to. Off: Compare the links.
sa: On: लिङ्क् यस्य पुटे सूचयति तस्य तुलनां कुर्वन्तु। Off: लिङ्कानां तुलनां कुर्वन्तु।

source: Case sensitive filename comparison
sa: केस संवेदनशील सञ्चिकानाम तुलना

# Tool Tip
source: The folder comparison will compare files or folders when their names match. Set this option if the case of the names must match. (Default for Windows is off, otherwise on.)
sa: पुटतुलना सञ्चिकानां वा पुटकानां वा तुलनां करिष्यति यदा तेषां नाम मेलनं भवति । यदि नामानां प्रकरणं मेलनं भवितुमर्हति तर्हि एतत् विकल्पं सेट् कुर्वन्तु । (विण्डोज कृते पूर्वनिर्धारितं निष्क्रियम् अस्ति, अन्यथा चालू अस्ति।)

source: Unfold all subfolders on load
sa: लोड् इत्यत्र सर्वाणि उपपुटं विमोचयन्तु

# Tool Tip
source: On: Unfold all subfolders when starting a folder diff. Off: Leave subfolders folded.
sa: On: समुच्चय diff आरभन्ते सति सर्वाणि उपपुटं विमोचयन्तु । Off: उपपुटं मुण्डितं त्यजन्तु।

source: Skip folder status report
sa: पुटस्य स्थितिप्रतिवेदनं त्यजन्तु

# Tool Tip
source: On: Do not show the Folder Comparison Status. Off: Show the status dialog on start.
sa: On: Folder Comparison Status इति न दर्शयन्तु । Off: आरम्भे स्थितिसंवादं दर्शयतु।

source: File Comparison Mode
sa: सञ्चिकातुलनाविधिः

source: Binary comparison
sa: द्विचक्रीय तुलना

# Tool Tip
source: Binary comparison of each file. (Default)
sa: प्रत्येकस्य सञ्चिकायाः द्विचक्रीयतुलना। (मूलभूतम्‌)

source: Full analysis
sa: पूर्ण विश्लेषण

# Tool Tip
source: Do a full analysis and show statistics information in extra columns. (Slower than a binary comparison, much slower for binary files.)
sa: पूर्णं विश्लेषणं कृत्वा अतिरिक्तस्तम्भेषु सांख्यिकीसूचनाः दर्शयन्तु। (द्विचक्रीयतुलनापेक्षया मन्दतरं, द्विचक्रीयसञ्चिकानां कृते बहु मन्दतरम् ।)

source: Trust the size and modification date (unsafe)
sa: आकारं परिवर्तनतिथिं च विश्वसतु (असुरक्षितम्)

# Tool Tip
source: Assume that files are equal if the modification date and file length are equal. Files with equal contents but different modification dates will appear as different. Useful for big folders or slow networks.
sa: यदि परिवर्तनतिथिः सञ्चिकादीर्घता च समाना भवति तर्हि सञ्चिकाः समानाः इति कल्पयन्तु । समानसामग्रीयुक्ताः सञ्चिकाः परन्तु भिन्नाः परिवर्तनतिथिः भिन्नाः इति दृश्यन्ते । बृहत्पुटस्य अथवा मन्दजालस्य कृते उपयोगी ।

source: Trust the size and date, but use binary comparison if date does not match (unsafe)
sa: आकारं तिथिं च विश्वसितुम्, परन्तु यदि तिथिः न मेलति (असुरक्षितम्) तर्हि द्विचक्रीयतुलनायाः उपयोगं कुर्वन्तु ।

# Tool Tip
source: Assume that files are equal if the modification date and file length are equal. If the dates are not equal but the sizes are, use binary comparison. Useful for big folders or slow networks.
sa: यदि परिवर्तनतिथिः सञ्चिकादीर्घता च समाना भवति तर्हि सञ्चिकाः समानाः इति कल्पयन्तु । यदि तिथयः समानाः न सन्ति किन्तु आकाराः सन्ति तर्हि द्विचक्रीयतुलनायाः उपयोगं कुर्वन्तु । बृहत्पुटस्य अथवा मन्दजालस्य कृते उपयोगी ।

source: Trust the size (unsafe)
sa: आकारे विश्वासः (असुरक्षितः)

# Tool Tip
source: Assume that files are equal if their file lengths are equal. Useful for big folders or slow networks when the date is modified during download.
sa: यदि तेषां सञ्चिकादीर्घता समाना भवति तर्हि सञ्चिकाः समानाः इति कल्पयन्तु । यदा डाउनलोड्-काले तिथिः परिवर्तिता भवति तदा बृहत्-पुटस्य अथवा मन्द-जालस्य कृते उपयोगी ।

source: Synchronize folders
sa: पुटं समन्वययन्तु

# Tool Tip
source: Offers to store files in both folders so that both folders are the same afterwards. Works only when comparing two folders without specifying a destination.
sa: उभयपुटेषु सञ्चिकाः संग्रहीतुं प्रस्तावति येन... पश्चात् उभयपुटं समानं भवति। गन्तव्यस्थानं न निर्दिश्य द्वयोः पुटयोः तुलनां कुर्वन् एव कार्यं करोति ।

source: White space differences considered equal
sa: श्वेतावकाशभेदाः समानाः मन्यन्ते

# Tool Tip
source: If files differ only by white space consider them equal. This is only active when full analysis is chosen.
sa: यदि सञ्चिकाः केवलं श्वेतस्थानेन भिन्नाः सन्ति तर्हि तान् समानान् मन्यताम् । एतत् केवलं तदा एव सक्रियं भवति यदा पूर्णविश्लेषणं चयनं भवति ।

source: Copy newer instead of merging (unsafe)
sa: विलयस्य स्थाने नूतनतरं प्रतिलिपिं कुर्वन्तु (असुरक्षितम्)

# Tool Tip
source: Do not look inside, just take the newer file. (Use this only if you know what you are doing!) Only effective when comparing two folders.
sa: अन्तः न पश्यन्तु, केवलं नूतनतरं सञ्चिकां गृह्यताम् । (यदा भवन्तः किं कुर्वन्ति इति ज्ञात्वा एव एतस्य उपयोगं कुर्वन्तु!) केवलं द्वयोः पुटयोः तुलनायां प्रभावी ।

source: Backup files (.orig)
sa: बैकअप सञ्चिकाः (.orig) .

# Tool Tip
source: If a file would be saved over an old file, then the old file will be renamed with a '.orig' extension instead of being deleted.
sa: यदि पुरातनसञ्चिकायाः उपरि सञ्चिका रक्षिता स्यात् तर्हि पुरातनसञ्चिका विलोपनस्य स्थाने '.orig' विस्तारेण नाम परिवर्तनं भविष्यति ।

source: Regional Settings
sa: क्षेत्रीय सेटिंग्स्

source: Use the same encoding for everything:
sa: सर्वस्य कृते समानं एन्कोडिंग् उपयुज्यताम् :

# Tool Tip
source: Enable this allows to change all encodings by changing the first only. Disable this if different individual settings are needed.
sa: एतत् सक्षमं कुर्वन्तु प्रथमं केवलं परिवर्त्य सर्वाणि एन्कोडिंग् परिवर्तयितुं शक्नोति । यदि भिन्नानां व्यक्तिगतसेटिंग्स् आवश्यकाः सन्ति तर्हि एतत् निष्क्रियं कुर्वन्तु ।

source: Note: Local Encoding is "%1"
sa: टिप्पणी: स्थानीयसङ्केतनं "%1" अस्ति ।

source: File Encoding for A:
sa: A कृते सञ्चिकासङ्केतनम् :

source: If enabled then encoding will be automaticly detected. If the file's encoding can not be found automaticly then the selected encoding will be used as fallback. (Unicode detection depends on the first bytes of a file.)
sa: यदि सक्षमं भवति तर्हि एन्कोडिंग् स्वयमेव ज्ञास्यति । यदि सञ्चिकायाः एन्कोडिंग् स्वयमेव न प्राप्यते तर्हि चयनितं एन्कोडिंग् fallback रूपेण उपयुज्यते । (यूनिकोड-परिचयः सञ्चिकायाः प्रथमबाइट्-आश्रितः भवति ।)

source: Auto Detect
sa: ऑटो डिटेक्ट्

source: File Encoding for B:
sa: B कृते सञ्चिका एन्कोडिंग् :

source: File Encoding for C:
sa: C कृते सञ्चिकायाः एन्कोडिंग् :

source: File Encoding for Merge Output and Saving:
sa: विलयनिर्गमस्य रक्षणस्य च कृते सञ्चिकासङ्केतनीकरणम् :

source: Auto Select
sa: स्वतः चयनं कुर्वन्तु

# Tool Tip
source: If enabled then the encoding from the input files is used. In ambiguous cases a dialog will ask the user to choose the encoding for saving.
sa: यदि सक्षमं भवति तर्हि निवेशसञ्चिकाभ्यः एन्कोडिंग् उपयुज्यते । अस्पष्टेषु सन्दर्भेषु संवादः उपयोक्तारं रक्षणार्थं एन्कोडिंग् चिन्वतु इति वक्ष्यति ।

source: File Encoding for Preprocessor Files:
sa: पूर्वसंसाधकसञ्चिकानां कृते सञ्चिकासङ्केतनीकरणम् :

source: Right To Left Language
sa: Right To Left भाषा इति

# Tool Tip
source: Some languages are read from right to left. This setting will change the viewer and editor accordingly.
sa: काश्चन भाषाः दक्षिणतः वामतः पठ्यन्ते । एतत् सेटिङ्ग् तदनुसारं दर्शकं सम्पादकं च परिवर्तयिष्यति ।

source: Integration
sa: एकीकरणम्

source: Integration Settings
sa: एकीकरण सेटिंग्स्

source: Command line options to ignore:
sa: उपेक्षितुं आदेशपङ्क्तिविकल्पाः :

# Tool Tip
source: List of command line options that should be ignored when KDiff3 is used by other tools. Several values can be specified if separated via ';' This will suppress the "Unknown option" error.
sa: अन्यैः साधनैः KDiff3 इत्यस्य उपयोगः भवति चेत् तेषां आदेशपङ्क्तिविकल्पानां सूची । ';' एतेन "Unknown option" इति दोषः दमितः भविष्यति ।

source: Quit also via Escape key
sa: Escape कीलद्वारा अपि त्यजन्तु

# Tool Tip
source: Fast method to exit. For those who are used to using the Escape key.
sa: निर्गमनार्थं द्रुतविधिः। ये Escape कीलस्य उपयोगं कर्तुं अभ्यस्ताः सन्ति तेषां कृते।

source: This resets all options. Not only those of the current topic.
sa: एतेन सर्वे विकल्पाः पुनः सेट् भवन्ति । न केवलं वर्तमानविषयस्य ये।

source: PreprocessorCmd:
sa: पूर्वसंसाधकCmd: .

source: The following option(s) you selected might change data:
sa: भवता चयनितः निम्नलिखितविकल्पः (विकल्पाः) दत्तांशं परिवर्तयितुं शक्नुवन्ति:

source: Most likely this is not wanted during a merge. Do you want to disable these settings or continue with these settings active?
sa: अधिकतया विलयस्य समये एतत् न इष्टम् । किं भवान् एतानि सेटिङ्ग्स् निष्क्रियं कर्तुम् इच्छति अथवा एतानि सेटिङ्ग्स् सक्रियं कृत्वा निरन्तरं कर्तुम् इच्छति?

source: Option Unsafe for Merging
sa: विलयनार्थं विकल्पः असुरक्षितः

source: Use These Options During Merge
sa: विलयस्य समये एतेषां विकल्पानां उपयोगं कुर्वन्तु

source: Disable Unsafe Options
sa: असुरक्षितविकल्पान् निष्क्रियं कुर्वन्तु

# Status message
source: Loading A: %1
sa: लोडिंग् क: %1

# Status message
source: Loading B: %1
sa: लोडिंग् ख: %1

# Status message
source: Diff: A <-> B
sa: भेदः क <-> ख

# Status message
source: Linediff: A <-> B
sa: लाइनडिफ्ः क <-> ख

# Status message
source: Loading C: %1
sa: लोडिंग् C: %1

# Status message
source: Diff: B <-> C
sa: भेदः ख <-> ग

# Status message
source: Linediff: B <-> C
sa: लाइनडिफ्ः ख <-> ग

# Status message
source: Linediff: A <-> C
sa: लाइनडिफ्ः क <-> ग

# Error message
source: Not enough memory to complete request.
sa: अनुरोधं पूर्णं कर्तुं पर्याप्तं स्मृतिः नास्ति।

source: An internal error occurred: %1
sa: आन्तरिकदोषः अभवत्: %1

source: Too many lines in diff. Skipping file.
sa: diff इत्यत्र अत्यधिकाः पङ्क्तयः। सञ्चिकां त्यक्त्वा ।
