Repository: KDE/kdiff3
Catalog: kdiff3/po/*.po
Languages: de

source: Nr of unsolved conflicts:
de: Anzahl der ungelösten Konflikte:

source: Conflicts
de: Konflikte

source: <No src line>
de: <Keine Zeile in der Quelle>

source: <Merge Conflict (Whitespace only)>
de: <Zusammenführungskonflikt (nur weisse Unterschiede)>

source: <Merge Conflict>
de: <Zusammenführungskonflikt>

source: Not all conflicts are solved yet. File not saved.
de: Noch sind nicht alle Konflikt gelöst. Die Datei wurde nicht gespeichert.

source: Conflicts Left
de: Es sind noch ungelöste Konflikte übrig

source: Creating backup failed. File not saved.
de: Die Sicherungskopie anzulegen schlug fehl. Die Datei wurde nicht gespeichert.

source: File Save Error
de: Fehler beim Speichern der Datei

source: Error while writing.
de: Fehler beim Schreiben.

source: Output
de: Ausgabe

source: [Modified]
de: [Geändert]

source: Change this if non-ASCII characters are not displayed correctly.
de: Falls die speziellen Zeichen Ihrer Sprache nicht korrekt dargestellt werden, können diesen Wert ändern. (Vielleicht hilfts.)

source: Editor & Diff Output Font
de: Schrift für Editor & Vergleichsfenster

source: Italic font for deltas
de: Kursivschrift bei Unterschieden

source: Selects the italic version of the font for differences. If the font doesn't support italic characters, then this does nothing.
de: Unterschiede werden kursiv angezeigt. Wenn aber diese Schriftart keine kursiven Zeichen unterstützt, passiert nichts.

source: Color
de: Farbe

source: Colors Settings
de: Farbeinstellungen

source: Editor and Diff Views:
de: Editor und Unterschiedsansicht:

source: Foreground color:
de: Vordergrundfarbe:

source: Background color:
de: Hintergrundfarbe:

source: Diff background color:
de: Hintergrundfarbe bei Unterschieden:

source: Color A:
de: Farbe für A:

source: Color B:
de: Farbe für B:

source: Color C:
de: Farbe für C:

source: Conflict color:
de: Farbe für Konflikte:

source: Current range background color:
de: Hintergrundfarbe für aktuellen Bereich:

source: Current range diff background color:
de: Hintergrundfarbe für Unterschiede im aktuellen Bereich:

source: Color for manually aligned difference ranges:
de: Farbe für manuell ausgerichtete Unterschiede:

source: Directory Comparison View:
de: Verzeichnisvergleichsansicht:

source: Newest file color:
de: Farbe für neueste Datei:

source: Changing this color will only be effective when starting the next directory comparison.
de: Diese Farbe zu ändern, wird erst beim Start des nächsten Verzeichnisvergleichs wirksam.

source: Oldest file color:
de: Farbe für älteste Datei:

source: Middle age file color:
de: Farbe für mittelalte Datei:

source: Color for missing files:
de: Farbe für fehlende Datei:

source: Editor Behavior
de: Verhalten des Editors

source: Tab inserts spaces
de: Tabulator fügt Leerzeichen ein

source: On: Pressing tab generates the appropriate number of spaces. Off: A Tab-character will be inserted.
de: Falls aktiv wird bei Betätigen des Tabulaturs die passende Anzahl Leerzeichen eingefügt. Sonst wird ein Tabulatorzeichen eingefügt.

source: Tab size:
de: Tabulator Länge:

source: Auto indentation
de: Automatisch einrücken

source: On: The indentation of the previous line is used for a new line.
de: Wenn aktiv, dann wird die Einrückung der vorigen Zeile bei neuen Zeilen übernommen.

source: Auto copy selection
de: Auswahl automatisch kopieren

source: On: Any selection is immediately written to the clipboard. Off: You must explicitely copy e.g. via Ctrl-C.
de: Falls aktiv wird die Auswahl automatisch sofort in die Zwischenablage kopiert. Sonst muss man explizit kopieren, z.B. mit Ctrl-C.

source: Line end style:
de: Zeilenende-Kodierung:

source: Sets the line endings for when an edited file is saved. DOS/Windows: CR+LF; UNIX: LF; with CR=0D, LF=0A
de: Legt die Kodierung für Zeilenenden beim Speichern fest. DOS/Windows: CR+LF; Unix: LF; with CR=0D, LF=0A

source: Preserve carriage return
de: Wagenrücklaufzeichen anzeigen

source: Show carriage return characters '\r' if they exist. Helps to compare files that were modified under different operating systems.
de: Zeige das Wagenrücklaufzeichen '\r' falls vorhanden. Hilft beim Vergleich von Dateien, die unter verschiedenen Betriebssystemen geändert wurden.

source: Ignore numbers
de: Zahlen ignorieren

source: Ignore number characters during line matching phase. (Similar to Ignore white space.) Might help to compare files with numeric data.
de: Zahlen werden während des Vergleichs wie "weisse" Zeichen behandelt. Könnte helfen, wenn Dateien viele Zahlen enthalten.

source: Ignore C/C++ comments
de: Ignoriere C/C++ Kommentare

source: Treat C/C++ comments like white space.
de: Behandle C/C++ Kommentare wie "weisse" Zeichen.

source: Ignore case
de: Unterschiede bei Groß- und Kleinschreibung ignorieren

source: Treat case differences like white space changes. ('a'<=>'A')
de: Unterschiede bei Groß- und Kleinschreibung wie weisse Unterschiede behandeln. ('a'<=>'A')

source: Preprocessor command:
de: Vorverarbeitungsbefehl:

source: User defined pre-processing. (See the docs for details.)
de: Benutzerdefinierbare Vorverarbeitung: (Siehe Beschreibung für Details.)

source: Line-matching preprocessor command:
de: Vorverarbeitungsbefehl nur für Zeilenabgleich:

source: This pre-processor is only used during line matching. (See the docs for details.)
de: Dieser Vorverarbeitungsbefehl wirkt nur in der Phase des Zeilenabgleichs. (Für Details siehe die Dokumentation.)

source: Try hard (slower)
de: Aufwendig suchen (langsamer)

source: Enables the --minimal option for the external diff. The analysis of big files will be much slower.
de: Der Vergleichsalgorithmus versucht aufwendig nach kleinem Satz von Änderungen zu suchen. Für sehr große Dateien kann der Vergleich viel langsamer sein.

source: Auto advance delay (ms):
de: Automatisch-Weiterspringen-Verzögerung (ms):

source: When in Auto-Advance mode the result of the current selection is shown for the specified time, before jumping to the next conflict. Range: 0-2000 ms
de: Wenn automatisches Weiterspringen aktiviert ist, wird das Ergebnis der letzten Auswahl für diese Dauer angezeigt, bevor weitergesprungen wird. (0-2000 ms)

source: White space 2-file merge default:
de: "Weisse" Zeichen Autoauswahl bei 2 Dateien:

source: Manual Choice
de: Manuelle Auswahl

source: Allow the merge algorithm to automatically select an input for white-space-only changes.
de: Bei Datei-Zusammenführungen wird automatisch diese Vorauswahl für ausschliesslich "weisse" Konflikte gewählt.

source: White space 3-file merge default:
de: "Weisse" Zeichen Autoauswahl bei 3 Dateien:

source: Automatic Merge Regular Expression
de: Regulärer Ausdrück für automatische Zusammenführung

source: Auto merge regular expression:
de: Regulärer Ausdrück für automatische Zusammenführung:

source: Regular expression for lines where KDiff3 should automatically choose one source. When a line with a conflict matches the regular expression then - if available - C, otherwise B will be chosen.
de: Regulärer Ausdruck für Zeilen, wo KDiff3 automatisch eine Quelle auswählen soll. Wenn eine Konfliktzeile auf diesen regulären Ausdruck passt, wird - sofern verfügbar - C, ansonsten B ausgewählt.

source: Run regular expression auto merge on merge start
de: Zusammenführung für Regulären Ausdruck beim Start einer Zusammenführung durchführen

source: Run the merge for auto merge regular expressions immediately when a merge starts.
de: Führe die Zusammenführung für Reguläre Ausdrücke sofort beim Start einer Zusammenführung durch.

source: Version Control History Merging
de: Versionsverwaltungs History-Zusammenführung

source: History start regular expression:
de: Regulärer Ausdruck für History-Start:

source: Regular expression for the start of the version control history entry. Usually this line contains the "$Log$"-keyword. Default value: ".*\$Log.*\$.*"
de: Regulärer Ausdruck für die Startzeile der Versionsverwaltungs-History. Normalerweise enthält diese Zeile das "$Log$"-Schlüsselwort. Voreinstellung: ".*\$Log.*\$.*"

source: History entry start regular expression:
de: Regulärer Ausdruck für History-Eintrag-Startzeile:

source: A version control history entry consists of several lines. Specify the regular expression to detect the first line (without the leading comment). Use parentheses to group the keys you want to use for sorting. If left empty, then KDiff3 assumes that empty lines separate history entries. See the documentation for details.
de: Ein Versionsverwaltungs-History Eintrag besteht aus mehreren Zeilen. Geben Sie einen regulären Ausdruck an, um die erste Zeile (ohne die voranstehenden Kommentarzeichen) zu erkennen. Verwenden Sie runde Klammern um Sortierschlüssel zu gruppieren. Wenn leergelassen, nimmt KDiff3 an, dass die History-Einträge durch Leerzeilen getrennt sind. (Siehe Dokumentation für Details.)

source: History merge sorting
de: Sortierte History-Zusammenführung

source: Sort version control history by a key.
de: Schlüsselbasierte Sortierung der Versionsverwaltungs-Historyeinträge

source: History entry start sort key order:
de: Historyeintragsstart Sortierschlüsselreihenfolge:

source: Each parentheses used in the regular expression for the history start entry groups a key that can be used for sorting. Specify the list of keys (that are numbered in order of occurrence starting with 1) using ',' as separator (e.g. "4,5,6,1,2,3,7"). If left empty, then no sorting will be done. See the documentation for details.
de: Jede runde Klammer im regulären Ausdruck des History-Start-Eintrags gruppiert einen Schlüssel der für Sortierung benützt werden kann. Geben Sie eine liste der Schlüssel an (nummeriert in der Auftrittsreihenfolge, mit 1 beginnend), wobei Komma ',' als Trennzeichen benützt wird. (z.B.: "4,5,6,1,2,3,7"). Wenn der Eintrag leer ist, wird keine Sortierung durchgeführt. (Siehe Dokumentation für Details).

source: Merge version control history on merge start
de: Versionsverwaltungs-History beim Start einer Zusammenführung zusammenführen

source: Run version control history automerge on merge start.
de: Starte Versionsverwaltungs-History-Zusammenführung beim Start einer Zusammenführung

source: Test your regular expressions
de: Testen Sie Ihre regulären Ausdrücke

source: Irrelevant merge command:
de: Befehl bei irrelevanter Zusammenführung:

source: If specified this script is run after automerge when no other relevant changes were detected. Called with the parameters: filename1 filename2 filename3
de: Wenn spezifiziert wird dieser Befehl nach einer automatischen Zusammenführung ausgeführt, wenn keine relevanten Änderungen detektiert wurden. Aufruf erfolgt mit den Parametern: Dateiname1 Dateiname2 Dateiname3

source: Directory Merge
de: Verzeichnis-Zusammenführung

source: Recursive directories
de: Rekursive Verzeichnisse

source: Whether to analyze subdirectories or not.
de: Falls aktiv werden auch Unterverzeichnisse eingelesen.

source: File pattern(s):
de: Datei Muster:

source: Pattern(s) of files to be analyzed. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
de: Muster der zu analysierenden Dateien. Jokerzeichen: '*' und '?' Mehrer Muster können angegeben werden, indem das Trennzeichen ';' benützt wird.

source: File-anti-pattern(s):
de: Datei Anti-Muster:

source: Pattern(s) of files to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
de: Muster der auszuschließenden Dateien. Jokerzeichen: '*' und '?' Mehrer Muster können angegeben werden, indem das Trennzeichen ';' benützt wird.

source: Dir-anti-pattern(s):
de: Verzeichnis Anti-Muster:

source: Pattern(s) of directories to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
de: Muster der auszuschließenden Verzeichnisse. Jokerzeichen: '*' und '?' Mehrer Muster können angegeben werden, indem das Trennzeichen ';' benützt wird.

source: Use .cvsignore
de: .cvsignore benützen

source: Extends the antipattern to anything that would be ignored by CVS. Via local ".cvsignore"-files this can be directory specific.
de: Erweitert die Anti-Muster um alles, das auch CVS ignorieren würde. Mit Hilfe der lokalen ".cvsignore"-Dateien ist dies Verzeichnis-spezifisch.

source: Find hidden files and directories
de: Finde versteckte Dateien und Verzeichnisse

source: Finds files and directories with the hidden attribute.
de: Findet versteckte Dateien und Verzeichnisse.

source: Finds files and directories starting with '.'.
de: Findet versteckte Dateien und Verzeichnisse, die mit '.' beginnen.

source: Follow file links
de: Folge Datei-Verknüpfungen

source: On: Compare the file the link points to. Off: Compare the links.
de: Falls aktiv werden die Dateien auf die die Verknüpfung verweist, verglichen. Sonst nur die Verknüpfungen selbst.

source: Follow directory links
de: Folge Verzeichnis-Verküpfungen

source: On: Compare the directory the link points to. Off: Compare the links.
de: Falls aktiv werden die Verzeichnisse, auf die eine Verküpfung zeigt, verglichen. Sonst nur die Verknüpfungen.

source: Case sensitive filename comparison
de: Groß-/kleinschreibung bei Dateinamen

source: The directory comparison will compare files or directories when their names match. Set this option if the case of the names must match. (Default for Windows is off, otherwise on.)
de: Der Verzeichnisvergleich vergleicht Dateien und Verzeichnisse wenn deren Namen gleich sind. Aktivieren Sie diese Einstellung, wenn es auch auf Groß-/Kleinschreibung im Dateinamen ankommt. (Voreinstellung für Windows ist aus, sonst ein.)

source: File Comparison Mode
de: Dateivergleichsmethode

source: Binary comparison
de: Binärvergleich

source: Binary comparison of each file. (Default)
de: Binärvergleich aller Dateien (Voreinstellung)

source: Full analysis
de: Vollständige Analyse

source: Do a full analysis and show statistics information in extra columns. (Slower than a binary comparison, much slower for binary files.)
de: Vollständige Analyse durchführen und Statistik-Information in eigenen Spalten anzeigen. (Langsamer als Binärvergleich, viel langsamer bei Binärdateien.)

source: Trust the modification date (unsafe)
de: Vertraue dem Änderungsdatum (unsicher)

source: Assume that files are equal if the modification date and file length are equal. Useful for big directories or slow networks.
de: Annahme, dass Dateien identisch sind, wenn das Änderungsdatum und die Größe übereinstimmen. Hilfreich bei großen Verzeichnissen oder langsamen Verbindungen.

source: Trust the size (unsafe)
de: Vertraue der Größe (unsicher)

source: Assume that files are equal if their file lengths are equal. Useful for big directories or slow networks when the date is modified during download.
de: Annahme, dass Dateien identisch sind, wenn die Größe übereinstimmt. Hilfreich bei großen Verzeichnissen oder langsamen Verbindungen, wenn das Veränderungsdatum beim Kopieren modifiziert wird.

source: Synchronize directories
de: Verzeichnisse synchronisieren

source: Offers to store files in both directories so that both directories are the same afterwards. Works only when comparing two directories without specifying a destination.
de: Dateien werden in beiden Verzeichnissen gespeichert, damit die Verzeichnisse nachher identisch sind. Funktioniert nur, wenn zwei Verzeichnisse verglichen werden, und kein Ziel angegeben wird.

source: White space differences considered equal
de: Dateien mit "Weissen" Unterschieden als gleich markieren

source: If files differ only by white space consider them equal. This is only active when full analysis is chosen.
de: Wenn sich Dateien nur durch weisse Zeichen unterscheiden, sollen diese wie gleiche Dateien behandelt werden. Dies ist nur wählbar, wenn vollständige Analyse ausgewählt ist.

source: Copy newer instead of merging (unsafe)
de: Neuere Datei statt Zusammenführung auswählen (unsicher)

source: Don't look inside, just take the newer file. (Use this only if you know what you are doing!) Only effective when comparing two directories.
de: Falls aktiv würde bei unterschiedlichen Dateien immer die neuere Datei als Aktion vorgeschlagen werden. (Nicht empfehlenswert, wenn beide Versionen Änderungen enthalten könnten.) Falls inaktiv wird eine Zusammenführung vorgeschlagen. Nur beim Vergleich zweier Verzeichnisse wirksam.

source: Backup files (.orig)
de: Sicherungskopie erstellen (.orig)

source: When a file would be saved over an old file, then the old file will be renamed with a '.orig'-extension instead of being deleted.
de: Wenn eine Datei über eine existierende Datei gespeichert würde, wird die bestehende Datei mit der Erweiterung '.orig' umbenannt und nicht gelöscht.

source: Regional Settings
de: Regionale Einstellungen

source: Language (restart required)
de: Sprache (Neustart erforderlich)

source: Choose the language of the GUI-strings or "Auto". For a change of language to take place, quit and restart KDiff3.
de: Sprache für das Benutzerinterface wählen oder "Auto". Diese Änderung wird erst nach Beendigung und Neustart von KDiff3 wirksam.

source: Use the same encoding for everything:
de: Die gleiche Kodierung für alles benützen:

source: Enable this allows to change all encodings by changing the first only. Disable this if different individual settings are needed.
de: Durch Aktivierung dieser Option können alle Kodierungen durch Setzen der ersten eingestellt werden. Dies auszuschalten erlaubt unterschiedliche individuelle Einstellungen.

source: Note: Local Encoding is
de: Hinweis: Die lokale Kodierung ist

source: File Encoding for A:
de: Dateikodierung für A:

source: File Encoding for B:
de: Dateikodierung für B:

source: File Encoding for C:
de: Dateikodierung für C:

source: File Encoding for Merge Output and Saving:
de: Dateikodierung für Zusammenführung und Speichern:

source: File Encoding for Preprocessor Files:
de: Dateikodierung für Präprozessor Dateien:

source: Right To Left Language
de: Rechts-Nach-Links Sprache

source: Some languages are read from right to left. This setting will change the viewer and editor accordingly.
de: Einige Sprachen werden von rechts nach links gelesen. Diese Einstellung ändert die Anzeige und den Editor entsprechend.

source: Integration Settings
de: Einstellungen für Integration

source: Command line options to ignore:
de: Ignorierbare Kommandozeilenoptionen:

source: List of command line options that should be ignored when KDiff3 is used by other tools. Several values can be specified if separated via ';' This will suppress the "Unknown option"-error.
de: Liste der Kommandozeilenoptionen die ignoriert werden sollen, wenn KDiff3 von anderen Werkzeugen aufgerufen wird. Mehrere Werte können mit Trennzeichen ';' angegeben werden. Dies wird die Fehlermeldung "Unbekannte Option" beim Start unterdrücken.

source: You selected a variable width font. Because this program doesn't handle variable width fonts correctly, you might experience problems while editing. Do you want to continue or do you want to select another font.
de: Sie haben eine Schrift mit variabler Breite gewählt. Weil dieses Programm nicht mit solchen Schriften umgehen kann, werden beim Editieren wahrscheinlich Probleme auftreten. Wollen Sie mit dieser Schrift fortfahren oder doch eine andere Schrift wählen?

source: Incompatible Font
de: Inkompatible Schriftart

source: Continue at Own Risk
de: Weiter auf eigenes Risiko

source: Select Another Font
de: Andere Schrift wählen

source: This resets all options. Not only those of the current topic.
de: Dies führt zum zurücksetzen aller Einstellungen, nicht nur des aktuellen Themas.

source: PreprocessorCmd:
de: Vorverarbeitungsbefehl:

source: The following option(s) you selected might change data:
de: Die folgende(n) aktive(n) Einstellung(en) könnten Daten verändern.

source: Most likely this is not wanted during a merge. Do you want to disable these settings or continue with these settings active?
de: Wahrscheinlich ist dies während der Dateizusammenführung nicht erwünscht. Wollen Sie diese Einstellungen deaktivieren oder beibehalten und fortfahren?

source: Option Unsafe for Merging
de: Einstellung ist unsicher bei Dateizusammenführungen

source: Use These Options During Merge
de: Verwendung dieser Option während der Zusammenführung

source: Disable Unsafe Options
de: Unsichere Einstellung deaktivieren

source: Loading A
de: Lade A

source: Loading B
de: Lade B

source: Diff: A <-> B
de: Vergleiche: A <-> B

source: Linediff: A <-> B
de: Zeilenvergleich: A <-> B

source: Loading C
de: Lade C

source: Diff: B <-> C
de: Vergleiche: B <-> C

source: Diff: A <-> C
de: Vergleiche: A <-> C

source: Linediff: B <-> C
de: Zeilenvergleiche: B <-> C

source: Linediff: A <-> C
de: Zeilenvergleich: A <-> C

source: All input files contain the same text, but are not binary equal.
de: Alle Quelldateien enthalten den gleichen Text, sind aber nicht binär identisch.

source: Files %1 and %2 are binary equal.
de: Die Dateien %1 und %2 sind binär identisch.

source: Files %1 and %2 have equal text, but are not binary equal.
de: Die Dateien %1 und %2 haben den gleichen Text, sind aber nicht binär identisch.

source: Some inputfiles don't seem to be pure textfiles. Note that the KDiff3-merge was not meant for binary data. Continue at your own risk.
de: Einige Quelldateien scheinen keine reinen Textdateien zu sein. Beachten Sie, dass KDiff3 nicht für den Binärdatenvergleich konzipiert ist. Machen Sie auf eigenes Risiko weiter.

source: Abort
de: Abbrechen

source: Opening files...
de: Dateien öffnen ...

source: File open error
de: Fehler beim Öffnen der Datei

source: Cutting selection...
de: Auswahl wird ausgeschnitten ...

source: Copying selection to clipboard...
de: Auswahl wird in Zwischenablage kopiert ...

source: Inserting clipboard contents...
de: Inhalt der Zwischenablage wird eingefügt ...

source: Save && Continue
de: Speichern && Fortsetzen

source: Continue Without Saving
de: Fortsetzen ohne zu Speichern

source: Search complete.
de: Suche abgeschlossen.

source: Search Complete
de: Suche abgeschlossen

source: Nothing is selected in either diff input window.
de: In keinem der Unterschiedsfenster ist eine Auswahl markiert.

source: Error while adding manual diff range
de: Fehler beim Hinzufügen einer manuellen Ausrichtung.

source: Configure KDiff3
de: KDiff3 einrichten

source: &Directory
de: V&erzeichnis

source: Current Item Merge Operation
de: Zusammenführaktion für aktuelles Element

source: Current Item Sync Operation
de: Synchronisationsaktion für aktuelles Element

source: &Movement
de: &Navigation

source: D&iffview
de: Vergleichsansicht

source: &Merge
de: &Zusammenführen

source: &Window
de: &Fenster

source: A (Base):
de: A (Basis):

source: File...
de: Datei ...

source: Dir...
de: Verzeichnis ...

source: Swap/Copy Names ...
de: Tausche/Kopiere Namen ...

source: Swap %1<->%2
de: Tausche %1<->%2

source: Copy %1->Output
de: Kopiere %1->Ziel

source: Swap %1<->Output
de: Tausche %1<->Ziel

source: Output (optional):
de: Ziel (optional):

source: Configure...
de: Einrichten ...

source: Search text:
de: Suchtext:

source: Case sensitive
de: Groß/Kleinschreibung beachten

source: Search A
de: Suche in A

source: Search B
de: Suche in B

source: Search C
de: Suche in C

source: Search output
de: Suche im Ergebnis

source: &Search
de: &Suchen

source: Regular Expression Tester
de: Testhilfe für reguläre Ausdrücke

source: Example auto merge line:
de: Beispielzeile für automatische Zusammenführung:

source: For auto merge test copy a line as used in your files.
de: Kopieren Sie eine Testzeile aus Ihrer Datei.

source: Match result:
de: Übereinstimmungsergebnis:

source: Example history start line (with leading comment):
de: Beispielzeile für History-Startzeile (mit Kommentarzeichen):
