Repository: KDE/kdiff3
Catalog: kdiff3/po/*.po
Languages: de

source: _: NAME OF TRANSLATORS Your names
de: Joachim Eibl

source: _: EMAIL OF TRANSLATORS Your emails
de: joachim.eibl@gmx.de

source: Writing clipboard data to temp file failed.
de: Speichern der Zwischenablage in temporärer Datei ist fehlgeschlagen.

source: From Clipboard
de: Aus Zwischenablage

source: Preprocessing possibly failed. Check this command: %1 The preprocessing command will be disabled now.
de: Der Vorverarbeitungsbefehl ist möglicherweise fehlgeschlagen. Bitte überprüfen sie diesen Befehl: %1 Diese Vorverarbeitung wird nun deaktiviert.

source: The line-matching-preprocessing possibly failed. Check this command: %1 The line-matching-preprocessing command will be disabled now.
de: Der Vorverarbeitungsbefehl für Zeilenabgleich ist möglicherweise fehlgeschlagen. Bitte überprüfen sie diesen Befehl: %1 Der Vorverarbeitungsbefehl für Zeilenabgleich wird nun deaktiviert.

source: Data loss error: If it is reproducable please contact the author.
de: Datenverlust: Falls das Problem reproduzierbar ist, nehmen Sie bitte Kontakt mit dem Autor auf.

source: Severe Internal Error
de: Schwerwiegender interner Fehler

source: Top line
de: Oberste Zeile

source: End
de: Ende

source: Mix of links and normal files.
de: Vermischung von Verknüpfungen und Dateien

source: Link:
de: Verknüpfung:

source: Size.
de: Größe:

source: Date & Size:
de: Datum & Größe:

source: Creating temp copy of %1 failed.
de: Erstellung einer temporären Kopie von %1 ist fehlgeschlagen.

source: Opening %1 failed.
de: Öffnen von %1 ist fehlgeschlagen.

source: Comparing file...
de: Datei wird verglichen ...

source: Error reading from %1
de: Fehler beim Lesen von %1

source: Operation
de: Aktion

source: Unsolved
de: Ungelöst

source: Solved
de: Gelöst

source: Nonwhite
de: Nicht weiß

source: White
de: Weiß

source: You are currently doing a directory merge. Are you sure, you want to abort the merge and rescan the directory?
de: Sie sind dabei, Verzeichnisse zusammenzuführen. Sind Sie sicher, dass Sie diese Operation abbrechen und das Verzeichnis erneut einlesen wollen?

source: Rescan
de: Neu einlesen

source: Continue Merging
de: Zusammenführung fortsetzen

source: Opening of directories failed:
de: Öffnen der Verzeichnisse fehlgeschlagen:

source: Dir A "%1" does not exist or is not a directory.
de: Verzeichnis A "%1" existiert nicht oder ist kein Verzeichnis.

source: Dir B "%1" does not exist or is not a directory.
de: Verzeichnis B "%1" existiert nicht oder ist kein Verzeichnis.

source: Dir C "%1" does not exist or is not a directory.
de: Verzeichnis C "%1" existiert nicht oder ist kein Verzeichnis.

source: Directory Open Error
de: Fehler beim Öffnen des Verzeichnisses

source: The destination directory must not be the same as A or B when three directories are merged. Check again before continuing.
de: Wenn drei Verzeichnisse zusammengeführt werden, darf das Zielverzeichnis nicht mit A oder B identisch sein. Bitte überprüfen Sie dies.

source: Parameter Warning
de: Parameter-Warnung

source: Scanning directories...
de: Verzeichnisse einlesen ...

source: Reading Directory A
de: Einlesen von Verzeichnis A

source: Reading Directory B
de: Einlesen von Verzeichnis B

source: Reading Directory C
de: Einlesen von Verzeichnis C

source: Some subdirectories were not readable in
de: Einige Unterverzeichnisse nicht lesbar in

source: Check the permissions of the subdirectories.
de: Überprüfen Sie bitte die Zugriffsrechte für die Unterverzeichnisse.

source: Ready.
de: Bereit

source: Directory Comparison Status
de: Status des Verzeichnisvergleichs

source: Number of subdirectories:
de: Anzahl der Unterverzeichnisse:

source: Number of equal files:
de: Anzahl der identischen Dateien:

source: Number of different files:
de: Anzahl der unterschiedlichen Dateien:

source: Number of manual merges:
de: Anzahl der manuellen Zusammenführungen:

source: This affects all merge operations.
de: Dies beeinflußt alle Zusammenführungsaktionen.

source: Changing All Merge Operations
de: Änderung aller Zusammenführungsaktionen

source: C&ontinue
de: &Fortsetzen

source: Processing
de: Fortschritt

source: To do.
de: Unerledigt.

source: Copy A to B
de: Kopiere A nach B

source: Copy B to A
de: Kopiere B nach A

source: Delete A
de: Lösche A

source: Delete B
de: Lösche B

source: Delete A & B
de: Lösche A & B

source: Merge to A
de: Zusammenführen nach A

source: Merge to B
de: Zusammenführen nach B

source: Merge to A & B
de: Zusammenführen nach A & B

source: Delete (if exists)
de: Lösche (falls vorhanden)

source: Merge
de: Zusammenführen

source: Merge (manual)
de: Zusammenführen (manuell)

source: Error: Conflicting File Types
de: Fehler: Konflikt der Dateitypen

source: Error: Dates are equal but files are not.
de: Fehler: Gleiches Datum, aber unterschiedliche Dateien.

source: This operation is currently not possible.
de: Diese Aktion ist momentan nicht zulässig.

source: Operation Not Possible
de: Unzulässige Aktion

source: This should never happen: mergeResultSaved: m_pMFI=0 If you know how to reproduce this, please contact the program author.
de: Dies sollte nie passieren: mergeResultSaved: m_pMFI=0 Wenn Sie dies reproduzieren können, informieren Sie bitte den Autor dieses Programms.

source: Program Error
de: Programm Fehler

source: An error occurred while copying.
de: Ein Fehler ist während des Kopierens aufgetreten.

source: Merge Error
de: Zusammenführungsfehler

source: Error.
de: Fehler.

source: Done.
de: Erledigt.

source: Not saved.
de: Nicht gespeichert.

source: Unknown merge operation. (This must never happen!)
de: Unbekannte Zusammenführaktion. (Sollte nie passieren!)

source: Unknown merge operation.
de: Unbekannte Zusammenführaktion.

source: The merge is about to begin. Choose "Do it" if you have read the instructions and know what you are doing. Choosing "Simulate it" will tell you what would happen. Be aware that this program still has beta status and there is NO WARRANTY whatsoever! Make backups of your vital data!
de: Die Zusammenführung kann nun starten. Wählen Sie "Start" wenn Sie die Anleitung gelesen haben und wissen was Sie erwartet. Wählen Sie "Simulieren" um zu sehen, was passieren würde. Sie sollten aber wissen, dass dieses Program noch Beta-Status hat und es KEINE GARANTIE gibt! Erstellen Sie Sicherungkopien Ihrer wichtigen Daten!

source: Starting Merge
de: Start der Zusammenführung

source: Do It
de: Start

source: Simulate It
de: Simulieren

source: The highlighted item has a different type in the different directories. Select what to do.
de: Das markierte Element hat einen unterschiedlichen Typ in den verschiedenen Verzeichnissen. Wählen Sie eine Aktion.

source: The modification dates of the file are equal but the files are not. Select what to do.
de: Für die markierte Datei ist zwar das Datum der letzen Änderung gleich, aber die Dateien unterscheiden sich. Wählen Sie die Zusammenführaktion.

source: This operation is currently not possible because directory merge is currently running.
de: Diese Aktion ist momentan nicht möglich, weil zur Zeit Verzeichnisse zusammengeführt werden.

source: There was an error in the last step. Do you want to continue with the item that caused the error or do you want to skip this item?
de: Beim letzten Element ist ein Fehler aufgetreten. Wollen Sie mit diesem Element fortfahren, oder wollen Sie dieses Element überspringen?

source: Continue merge after an error
de: Fortsetzung der Zusammenführung nach einem Fehler

source: Continue With Last Item
de: Mit letztem Element fortsetzen

source: Skip Item
de: Element überspringen

source: Skipped.
de: Übersprungen.

source: In progress...
de: In Bearbeitung ...

source: Merge operation complete.
de: Die Zusammenführung ist fertig.

source: Merge Complete
de: Zusammenführung abgeschlossen.

source: Simulated merge complete: Check if you agree with the proposed operations.
de: Die simulierte Zusammenführung ist abgeschlossen. Überprüfen Sie, ob Sie mit den vorgeschlagenen Aktionen einverstanden sind.

source: An error occurred. Press OK to see detailed information.
de: Ein Fehler ist aufgetreten. Wählen Sie OK um Details zu sehen.

source: Error: While deleting %1: Creating backup failed.
de: Fehler: Beim Löschen von %1: Die Erstellung einer Sicherungskopie schlug fehl.

source: delete directory recursively( %1 )
de: Lösche Verzeichnis rekursiv( %1 )

source: delete( %1 )
de: Lösche( %1 )

source: Error: delete dir operation failed while trying to read the directory.
de: Fehler: Löschen des Verzeichnisses schlug fehl, da es nicht gelesen werden konnte.

source: Error: rmdir( %1 ) operation failed.
de: Fehler: Verzeichnis löschen( %1 ) Operation fehlgeschlagen.

source: Error: delete operation failed.
de: Fehler: Löschoperation fehlgeschlagen.

source: manual merge( %1, %2, %3 -> %4)
de: Manuelles Zusammenführen( %1, %2, %3 -> %4)

source: Note: After a manual merge the user should continue by pressing F7.
de: Hinweis: Nach manuellem Zusammenführen mit F7 fortsetzen.

source: Error: copy( %1 -> %2 ) failed.Deleting existing destination failed.
de: Fehler: Kopie( %1 -> %2 ) fehlgeschlagen. Das existierende Ziel konnte nicht gelöscht werden.

source: copyLink( %1 -> %2 )
de: Verknüpfung kopieren( %1 -> %2 )

source: Error: copyLink failed: Remote links are not yet supported.
de: Fehler: Verknüpfung kopieren: Nichtlokale Verknüpfungen werden nicht unterstützt.

source: Error: copyLink failed.
de: Fehler: Verknüpfung kopieren fehlgeschlagen.

source: copy( %1 -> %2 )
de: kopiere( %1 -> %2 )

source: Error during rename( %1 -> %2 ): Cannot delete existing destination.
de: Fehler beim Umbenennen( %1 -> %2 ): Das existierende Ziel konnte nicht gelöscht werden.

source: rename( %1 -> %2 )
de: Umbenennen( %1 -> %2 )

source: Error: Rename failed.
de: Fehler: Umbenennen fehlgeschlagen.

source: Error during makeDir of %1. Cannot delete existing file.
de: Fehler beim Erstellen des Verzeichnisses %1. Kann existierendes Objekt nicht löschen.

source: makeDir( %1 )
de: erstelleVerzeichnis( %1 )

source: Error while creating directory.
de: Fehler beim Erstellen eines Verzeichnis.

source: Dest
de: Ziel

source: Dir
de: Verzeichnis

source: Type
de: Typ

source: Size
de: Größe

source: Last Modification
de: Letzte Änderung

source: Link-Destination
de: Verküpfungsziel

source: not available
de: nicht vorhanden

source: A (Dest):
de: A (Ziel):

source: A (Base):
de: A (Basis):

source: B (Dest):
de: B (Ziel):

source: C (Dest):
de: C (Ziel):

source: Dest:
de: Ziel:

source: Save Directory Merge State As...
de: Verzeichniszusammenführungsstatus speichern unter ...

source: Start/Continue Directory Merge
de: Verzeichniszusammenführung starten/fortsetzen

source: Run Operation for Current Item
de: Aktion des aktuellen Elements ausführen

source: Compare Selected File
de: Vergleiche gewählte Datei

source: Merge Current File
de: Aktuelle Datei zusammenführen

source: Fold All Subdirs
de: Alle Unterverzeichnisse einklappen

source: Unfold All Subdirs
de: Alle Unterverzeichnisse ausklappen

source: Choose A for All Items
de: Für alle Elemente A wählen

source: Choose B for All Items
de: Für alle Elemente B wählen

source: Choose C for All Items
de: Für alle Elemente C wählen

source: Auto-Choose Operation for All Items
de: Aktion für alle Elemente automatisch wählen

source: No Operation for All Items
de: Keine Aktion für alle Elemente

source: Show Identical Files
de: Zeige identische Dateien

source: Show Different Files
de: Zeige unterschiedliche Dateien

source: Show Files only in A
de: Zeige Dateien nur in A

source: Show Files only in B
de: Zeige Dateien nur in B

source: Show Files only in C
de: Zeige Dateien nur in C

source: Compare Explicitly Selected Files
de: Vergleiche explizit ausgewählte Dateien

source: Merge Explicitly Selected Files
de: Führe explizit ausgewählte Dateien zusammen

source: Do Nothing
de: Nichts tun

source: Delete A && B
de: Lösche A && B

source: Merge to A && B
de: Zusammenführen nach A && B

source: While trying to make a backup, deleting an older backup failed. Filename:
de: Als versucht wurde eine Sicherungskopie zu erstellen, konnte eine schon vorhandene Sicherungskopie nicht gelöscht werden. Datei:

source: While trying to make a backup, renaming failed. Filenames:
de: Als versucht wurde eine Sicherungskopie zu erstellen, ist das Umbenennen fehlgeschlagen: Dateinamen:

source: Getting file status: %1
de: Hole Datei Status: %1

source: Reading file: %1
de: Einlesen von Datei: %1

source: Writing file: %1
de: Schreibe Datei: %1

source: Out of memory
de: Nicht genügend Speicher

source: Making directory: %1
de: Erstelle Verzeichnis: %1

source: Removing directory: %1
de: Lösche Verzeichnis: %1

source: Removing file: %1
de: Lösche Datei: %1

source: Creating symbolic link: %1 -> %2
de: Erstelle Verknüpfung: %1 -> %2

source: Renaming file: %1 -> %2
de: Datei umbenennen: %1 -> %2

source: Copying file: %1 -> %2
de: Datei kopieren: %1 -> %2

source: Error during file copy operation: Opening file for reading failed. Filename: %1
de: Fehler beim Kopieren: Datei konnte nicht zum Lesen geöffnet werden: %1

source: Error during file copy operation: Opening file for writing failed. Filename: %1
de: Fehler beim Kopieren: Datei konnte nicht zum Schreiben geöffnet werden: %1

source: Error during file copy operation: Reading failed. Filename: %1
de: Fehler beim Kopieren: Lesen fehlgeschlagen: %1

source: Error during file copy operation: Writing failed. Filename: %1
de: Fehler beim Kopieren: Schreiben fehlgeschlagen: %1

source: Reading directory:
de: Verzeichnis wird eingelesen:

source: Listing directory: %1
de: Einlesen von Verzeichnis: %1

source: Current Configuration:
de: Aktuelle Einstellungen:

source: Config Option Error:
de: Fehler in der Einstellungsoption

source: Option --auto used, but no output file specified.
de: Option --auto verwendet, aber keine Ausgabedatei angegeben.

source: Option --auto ignored for directory comparison.
de: Option --auto wird beim Vergleich von Verzeichnissen ignoriert.

source: Saving failed.
de: Speichern fehlgeschlagen.

source: Opening of these files failed:
de: Öffnen dieser Dateien schlug fehl:

source: File Open Error
de: Fehler beim Dateiöffnen

source: Opens documents for comparison...
de: Dateien für Vergleich öffnen ...

source: Saves the merge result. All conflicts must be solved!
de: Sichern des Zusammenführergebnisses. Alle Konflikte müssen gelöst sein.

source: Saves the current document as...
de: Speichert das aktuelle Dokument als ...

source: Print the differences
de: Unterschiede drucken

source: Quits the application
de: Beendet das Programm

source: Cuts the selected section and puts it to the clipboard
de: Schneidet die Auswahl aus und kopiert sie in die Zwischenablage

source: Copies the selected section to the clipboard
de: Kopiert den ausgewählten Bereich in die Zwischenablage

source: Pastes the clipboard contents to actual position
de: Fügt den Inhalt der Zwischenablage an der aktuellen Position ein

source: Select everything in current window
de: Alles auswählen in aktuellem Fenster

source: Search for a string
de: Suche nach Text ...

source: Search again for the string
de: Weitersuchen

source: Enables/disables the toolbar
de: Blendet die Werkzeugleiste ein/aus

source: Enables/disables the statusbar
de: Blendet die Statusleiste ein/aus

source: Configure KDiff3...
de: KDiff3 einrichten ...

source: Go to Current Delta
de: Springe zu aktuellem Unterschied

source: Go to First Delta
de: Springe zum ersten Unterschied

source: Go to Last Delta
de: Springe zum letzten Unterschied

source: (Skips white space differences when "Show White Space" is disabled.)
de: (Unterschiede in weissen Zeichen werden übersprungen, wenn "Zeige weisse Zeichen" ausgeschaltet ist.)

source: (Does not skip white space differences even when "Show White Space" is disabled.)
de: (Unterschiede in weissen Zeichen werden nicht übersprungen, auch wenn "Zeige weisse Zeichen" ausgeschaltet ist.)

source: Go to Previous Delta
de: Springe zu vorigem Unterschied

source: Go to Next Delta
de: Springe zu nächstem Unterschied

source: Go to Previous Conflict
de: Springe zu vorigem Konflikt

source: Go to Next Conflict
de: Springe zu nächstem Konflikt

source: Go to Previous Unsolved Conflict
de: Springe zu vorigem ungelösten Konflikt

source: Go to Next Unsolved Conflict
de: Springe zu nächstem ungelöstem Konflikt

source: Select Line(s) From A
de: Wähle Zeile(n) von A

source: Select Line(s) From B
de: Wähle Zeile(n) von B

source: Select Line(s) From C
de: Wähle Zeile(n) von C

source: Automatically Go to Next Unsolved Conflict After Source Selection
de: Automatisch zu nächstem ungelösten Konflikt weiterspringen

source: Show Space && Tabulator Characters for Differences
de: Zeige Leerzeichen und Tabulator Zeichen in Unterschieden

source: Show White Space
de: Zeige "weisse" Zeichen

source: Show Line Numbers
de: Zeige Zeilennummern

source: Choose A Everywhere
de: Wähle A überall

source: Choose B Everywhere
de: Wähle B überall

source: Choose C Everywhere
de: Wähle C überall

source: Choose A for All Unsolved Conflicts
de: Wähle A für alle ungelösten Konflikte

source: Choose B for All Unsolved Conflicts
de: Wähle B für alle ungelösten Konflikte

source: Choose C for All Unsolved Conflicts
de: Wähle C für alle ungelösten Konflikte

source: Choose A for All Unsolved Whitespace Conflicts
de: Wähle A für alle ungelösten "weissen" Konflikte

source: Choose B for All Unsolved Whitespace Conflicts
de: Wähle B für alle ungelösten "weissen" Konflikte

source: Choose C for All Unsolved Whitespace Conflicts
de: Wähle C für alle ungelösten "weissen" Konflikte

source: Automatically Solve Simple Conflicts
de: Automatisch einfache Konflikte lösen

source: Set Deltas to Conflicts
de: Alle Unterschiede zu Konflikten machen

source: Run Regular Expression Auto Merge
de: Regulärer-Ausdruck-Zusammenführung starten

source: Automatically Solve History Conflicts
de: Automatisch History-Konflikte auflösen

source: Split Diff At Selection
de: Trenne Unterschied bei der Auswahlsmarkierung

source: Join Selected Diffs
de: Verbinde markierte Unterschiede

source: Show Window A
de: Zeige Fenster A

source: Show Window B
de: Zeige Fenster B

source: Show Window C
de: Zeige Fenster C

source: Focus Next Window
de: Setze Fokus zum nächsten Fenster

source: Normal Overview
de: Normale Übersicht

source: A vs. B Overview
de: A vs. B Übersicht

source: A vs. C Overview
de: A vs. C Übersicht

source: B vs. C Overview
de: B vs. C Übersicht

source: Word Wrap Diff Windows
de: Zeilenumbruch für Vergleichsanzeige

source: Add Manual Diff Alignment
de: Manuelle Ausrichtung hinzufügen

source: Clear All Manual Diff Alignments
de: Alle manuellen Ausrichtungen entfernen

source: Focus Prev Window
de: Setze Fokus zum vorigen Fenster

source: Toggle Split Orientation
de: Ausrichtung der Fensterteilung wechseln

source: Dir && Text Split Screen View
de: Verzeichnis && Textfenster teilen sich Hauptfenster

source: Toggle Between Dir && Text View
de: Wechsel zwischen Verzeichnis && Text Fenster

source: The merge result hasn't been saved.
de: Das Zusammenführungsergebnis wurde nicht gespeichert.

source: Save && Quit
de: Speichern && Beenden

source: Quit Without Saving
de: Beenden ohne zu speichern

source: Saving the merge result failed.
de: Speichern des Zusammenführungsergebnisses schlug fehl.

source: You are currently doing a directory merge. Are you sure, you want to abort?
de: Sie führen eine Verzeichniszusammenführung durch. Sind sie sicher, dass sie diese beenden möchten?

source: Saving file...
de: Datei wird gespeichert ...

source: Saving file with a new filename...
de: Datei wird unter neuem Namen gespeichert ...

source: Printing...
de: Drucken ...

source: Printing aborted.
de: Drucken abgebrochen.

source: Selection
de: Auswahl

source: Printing completed.
de: Drucken beendet.

source: Exiting...
de: Wird beendet ...

source: Toggling toolbar...
de: Werkzeugleiste (de)aktivieren ...

source: Toggle the statusbar...
de: Statusleiste an/aus ...

source: Couldn't find files for comparison.
de: Konnte Dateien für Vergleich nicht finden.

source: KDiff3Part
de: KDiff3-Komponente

source: Could not find our part! This usually happens due to an installation problem. Please read the README-file in the source package for details.
de: Konnte die KDiff3-Komponente nicht finden! Das ist normalerweise ein Installationsproblem. Bitte lesen Sie die README-Datei, die den Quelltexten beiliegt.

source: Tool for Comparison and Merge of Files and Directories
de: Programm zum Vergleichen und Zusammenführen von Dateien und Verzeichnissen

source: Merge the input.
de: Quellen zusammenführen.

source: Explicit base file. For compatibility with certain tools.
de: Explizite Basisdatei. Für Kompatibilität mit anderen Werkzeugen.

source: Output file. Implies -m. E.g.: -o newfile.txt
de: Ergebnisdateiname bei Zusammenführung. z.B.: -o neu.txt

source: Output file, again. (For compatibility with certain tools.)
de: Ergebnisdatei. (Für Kompatibilität mit anderen Werkzeugen.)

source: No GUI if all conflicts are auto-solvable. (Needs -o file)
de: Kein Fenster anzeigen, wenn alle Konflikte automatisch lösbar sind. (Benötigt -o)

source: Don't solve conflicts automatically. (For compatibility...)
de: Keine Konflikte automatisch lösen. (Für Kompatibilität ...)

source: Visible name replacement for input file 1 (base).
de: Anderer angezeigter Dateiname für erste Datei (Basis).

source: Visible name replacement for input file 2.
de: Anderer angezeigter Dateiname für zweite Datei.

source: Visible name replacement for input file 3.
de: Anderer angezeigter Dateiname für dritte Datei.

source: Alternative visible name replacement. Supply this once for every input.
de: Anderer angezeigter Dateiname: Kann für jede Quelle spezifiziert werden.

source: Override a config setting. Use once for every setting. E.g.: --cs "AutoAdvance=1"
de: Eine Einstellung ändern. Je Einstellung verwendbar. Bsp.: --cs "AutoAdvance=1"

source: Show list of config settings and current values.
de: Zeige Liste aller Einstellungen und aktueller Werte.

source: Use a different config file.
de: Eine andere Einstellungsdatei benützen.

source: file1 to open (base, if not specified via --base)
de: Erste Datei (Basis, falls nicht --base benützt wird)

source: file2 to open
de: Zweite Datei

source: file3 to open
de: Dritte Datei

source: Ignored. (User defined.)
de: Ignoriert. (Benutzerdefiniert.)

source: + Many thanks to those who reported bugs and contributed ideas!
de: + Vielen Dank an alle, die Fehler gemeldet und Ideen beigesteuert haben!

source: Number of remaining unsolved conflicts: %1 (of which %2 are whitespace)
de: Anzahl der verbleibenden ungelösten Konflikte: %1 (wobei %2 davon weisse Konflikte sind)

source: The output has been modified. If you continue your changes will be lost.
de: Das Ergebnis wurde verändert. Wenn sie fortsetzen gehen die Änderungen verloren.

source: All input files are binary equal.
de: Alle Quelldateien sind binär identisch.

source: All input files contain the same text.
de: Alle Quelldateien enthalten den gleichen Text.

source: Files A and B are binary equal.
de: Die Dateien A und B sind binär identisch.

source: Files A and B have equal text.
de: Die Dateien A und B enthalten den gleichen Text.

source: Files A and C are binary equal.
de: Die Dateien A und C sind binär identisch.

source: Files A and C have equal text.
de: Die Dateien A und C enthalten den gleichen Text.

source: Files B and C are binary equal.
de: Die Dateien B und C sind binär identisch.

source: Files B and C have equal text.
de: Die Dateien B und C enthalten den gleichen Text.

source: Total number of conflicts:
de: Gesamte Anzahl der Konflikte:

source: Nr of automatically solved conflicts:
de: Anzahl der automatisch gelösten Konflikte:
