Repository: KDE/kdiff3
Catalog: kdiff3/po/*.po
Languages: de

source: Copy a history start line as used in your files, including the leading comment.
de: Kopieren Sie eine History-Startzeile aus Ihren Dateien, inklusive der Kommentarzeichen am Anfang der Zeile.

source: History sort key order:
de: History-Sortierschlüsselreihenfolge:

source: Example history entry start line (without leading comment):
de: Historyeintragbeispielstartzeile (ohne Kommentarzeichen):

source: Copy a history entry start line as used in your files, but omit the leading comment.
de: Kopieren Sie eine Historyeintragsstartzeile aus Ihren Dateien, wobei Sie hier die Kommentarzeichen am Anfang weglassen.

source: Sort key result:
de: Sortierschlüsselergebnis:

source: Match success.
de: Übereinstimmung erfolgreich.

source: Match failed.
de: Übereinstimmung fehlgeschlagen.

source: Opening and closing parentheses don't match in regular expression.
de: Öffnende und schließende runde Klammern in regulärem Ausdruck passen nicht zusammen.
