Repository: KDE/kdiff3
Catalog: po/*/diff_ext.po
Languages: ar

# Contexualmenu option
source: Compare with %1
ar: قارن مع %1

# Contexualmenu option
source: Merge with %1
ar: ادمج مع %1

# Contexualmenu option
source: 3-way merge with base
ar: دمج ثلاثي مع القاعدة

# Contexualmenu option
source: Save '%1' for later
ar: حفظ ”%1“ لوقت لاحق

# Contexualmenu option
source: Compare with ...
ar: قارن مع …

# Contexualmenu option
source: Clear list
ar: امحُ القائمة

# Contexualmenu option
source: Compare
ar: قارن

# Contexualmenu option
source: 3 way comparison
ar: مقارنة ثلاثية

# Contexualmenu option
source: About Diff-Ext ...
ar: عن امتداد قارن ...

source: Diff-Ext Copyright ©2003-2006, Sergey Zorin. All rights reserved.
ar: امتداد قارن حقوق الطبع والنشر ©2003-2006، سيرجي زورين. جميع الحقوق محفوظة.

source: This software is distributable under the BSD-2-Clause license.
ar: يمكن توزيع هذا البرنامج بموجب ترخيص BSD-2-Clause.

source: Some extensions for KDiff3 ©2006-2013 by Joachim Eibl.
ar: بعض الإضافات لبرنامج قارن ©2006-2013 بواسطة يواخيم إيبل.

source: Ported to Qt5/Kf5 by Michael Reeves
ar: النقل إلى Qt5/Kf5 بواسطة مايكل ريفز

source: Homepage for Diff-Ext: http://diff-ext.sourceforge.net
ar: الصفحة الرئيسية لـ امتداد قارن: http://diff-ext.sourceforge.net

source: About Diff-Ext for KDiff3 (64 Bit)
ar: عن امتداد قارن لقارن (64بت)

# Contexualmenu option
source: Compare selected files
ar: قارن الملفات المحددة

# Contexualmenu option
source: Compare '%1' with '%2'
ar: قارن '%1' مع '%2'

# Contexualmenu option
source: Save '%1' for later operation
ar: احفظ ”%1“ لعملية لاحق

source: Could not start KDiff3. Please rerun KDiff3 installation.
ar: تعذر بدء تشغيل المقارن. يرجى إعادة تشغيل تثبيت KDiff3.

source: Command
ar: الأمر

source: CommandLine
ar: سطر_الأمر

source: Diff-Ext For KDiff3
ar: امتداد قارن لبرنامج قارن
