Repository: KDE/kdiff3
Catalog: po/*/kdiff3.po
Languages: ar, zh_tw

# Tool Tip
source: Assume that files are equal if the modification date and file length are equal. If the dates are not equal but the sizes are, use binary comparison. Useful for big folders or slow networks.
ar: افترض أن الملفات متطابقة إذا كان تاريخ التعديل وطول الملف متساويين. إذا لم تكن التواريخ متساوية ولكن الأحجام متساوية، استخدم المقارنة الثنائية. مفيد للمجلدات الكبيرة أو الشبكات البطيئة.
zh_tw: 變更時間與檔案大小相同時就將檔案視為相同。 變更時間不同而大小相同的時候，會嘗試使用二進制比對。 在透過較慢的網路進行比對，或是比對大資料夾的時候很有用。

source: Trust the size (unsafe)
ar: ثِق بالحجم (غير آمن)
zh_tw: 信任大小（不安全）

# Tool Tip
source: Assume that files are equal if their file lengths are equal. Useful for big folders or slow networks when the date is modified during download.
ar: افترض أن الملفات متطابقة إذا كانت أطوالها متساوية. مفيد للمجلدات الكبيرة أو الشبكات البطيئة عندما يتغير التاريخ أثناء التنزيل.
zh_tw: 檔案大小相同就將它們當作相同。 在透過較慢的網路進行比對（下載時日期被變更），或是比對大資料夾的時候很有用。

source: Synchronize folders
ar: زامِن المجلدات
zh_tw: 同步資料夾

# Tool Tip
source: Offers to store files in both folders so that both folders are the same afterwards. Works only when comparing two folders without specifying a destination.
ar: يعرض تخزين الملفات في كلا المجلدين بحيث يكون المجلدان متطابقين بعد ذلك. يعمل فقط عند مقارنة مجلدين دون تحديد وجهة.
zh_tw: 提議在雙方資料夾儲存檔案，讓兩個資料夾在完成後內容會相符。 只在不指定目的地，比對兩個資料夾時有用。

source: White space differences considered equal
ar: فروقات المسافات البيضاء تعتبر متطابقة
zh_tw: 忽略空白字元差異

# Tool Tip
source: If files differ only by white space consider them equal. This is only active when full analysis is chosen.
ar: إذا كانت الملفات تختلف فقط بالمسافات البيضاء، اعتبرها متطابقة. هذا الخيار يكون نشطًا فقط عندما يختار التحليل الكامل.
zh_tw: 如果檔案只有空格上的差異，將它們當作是相同的。 這只在選取完整分析的時候有用。

source: Copy newer instead of merging (unsafe)
ar: انسخ الأحدث بدلًا من الدمج (غير آمن)
zh_tw: 複製新的，而非合併（不安全）

# Tool Tip
source: Do not look inside, just take the newer file. (Use this only if you know what you are doing!) Only effective when comparing two folders.
ar: لا تنظر إلى الداخل، فقط خذ الملف الأحدث. (استخدم هذا فقط إذا كنت تعرف ما تفعله!) فعّال فقط عند مقارنة مجلدين.
zh_tw: 不要看檔案內容，直接取用較新的檔案。 （請只在您確定自己要使用這個選項時才利用它！） 只在比對兩個資料夾時有用。

source: Backup files (.orig)
ar: ملفات احتياطية (.orig)
zh_tw: 備份檔案 (.orig)

# Tool Tip
source: If a file would be saved over an old file, then the old file will be renamed with a '.orig' extension instead of being deleted.
ar: إذا كان سيحفظ ملف فوق ملف قديم، فسيعاد تسمية الملف القديم بامتداد '.orig' بدلًا من حذفه.
zh_tw: 儲存檔案時如果會覆寫原有的舊檔案，會將舊檔案重新命名，加上「.orig」副檔名，而非實際刪除。

source: Regional Settings
ar: الإعدادات الإقليميّة
zh_tw: 區域設定

source: Use the same encoding for everything:
ar: استخدم الترميز نفسه لكل شيء:
zh_tw: 為所有項目使用同一個編碼：

# Tool Tip
source: Enable this allows to change all encodings by changing the first only. Disable this if different individual settings are needed.
ar: تفعيل هذا يسمح بتغيير كل الترميزات عن طريق تغيير الأول فقط. عطّل هذا إذا كانت هناك حاجة لإعدادات فردية مختلفة.
zh_tw: 啟用這個選項讓您只要變更第一個編碼就能變更全部的編碼。 如果需要個別設定不同的編碼，則請停用此選項。

source: Note: Local Encoding is "%1"
ar: ملاحظة: الترميز المحلي هو "%1"
zh_tw: 注意：本地編碼是「%1」

source: File Encoding for A:
ar: ترميز الملف لـ أ:
zh_tw: A 的檔案編碼：

source: If enabled then encoding will be automatically detected. If the file's encoding can not be found automatically then the selected encoding will be used as fallback. (Unicode detection depends on the first bytes of a file.)
ar: إذا كان مفعّلاً، فسيكتشف الترميز آليًا. إذا تعذّر العثور على ترميز الملف آليًا، فسيستخدم الترميز المحدد كخيار احتياطي. (يعتمد اكتشاف اليونيكود على البايتات الأولى من الملف.)

source: Auto Detect
ar: اكتشف آليًّا
zh_tw: 自動偵測

source: File Encoding for B:
ar: ترميز الملف لـ ب:
zh_tw: B 的檔案編碼：

source: File Encoding for C:
ar: ترميز الملف لـ ج:
zh_tw: C 的檔案編碼：

source: File Encoding for Merge Output and Saving:
ar: ترميز الملف لمخرج الدمج والحفظ:
zh_tw: 合併輸出和儲存用的檔案編碼：

source: Auto Select
ar: اختيار آلي
zh_tw: 自動選取

# Tool Tip
source: If enabled then the encoding from the input files is used. In ambiguous cases a dialog will ask the user to choose the encoding for saving.
ar: إذا كان مفعّلاً، فسيستخدم الترميز من ملفات الإدخال. في الحالات الغامضة، سيطلب حوار من المستخدم اختيار الترميز للحفظ.

source: File Encoding for Preprocessor Files:
ar: ترميز الملف لملفات المعالج المسبق:
zh_tw: 前置處理檔案的檔案編碼：

source: Right To Left Language
ar: لغة من اليمين إلى اليسار
zh_tw: 右到左語言

# Tool Tip
source: Some languages are read from right to left. This setting will change the viewer and editor accordingly.
ar: بعض اللغات تقرأ من اليمين إلى اليسار. هذا الإعداد سيغير العارض والمحرر تبعًا لذلك.
zh_tw: 某些語言的閱讀方向是右到左。 這個設定會為右到左語言變更檢視器和編輯器。

source: Integration
ar: التكامل
zh_tw: 整合

source: Integration Settings
ar: إعدادات التكامل
zh_tw: 整合設定

source: Command line options to ignore:
ar: خيارات سطر الأوامر التي ستُجاهل:
zh_tw: 要忽略的命令列選項：

# Tool Tip
source: List of command line options that should be ignored when KDiff3 is used by other tools. Several values can be specified if separated via ';' This will suppress the "Unknown option" error.
ar: قائمة خيارات سطر الأوامر التي يجب أن تُجاهل عندما يستخدم المقارن من قبل أدوات أخرى. يمكن تحديد عدة قيم إذا فصلت بـ ';' هذا سيمنع خطأ "خيار مجهول".
zh_tw: KDiff3 由其他工具使用時要忽略的命令列選項清單。 可以用 ';' 來分開複數個數值。 這會消除「未知選項」的錯誤。

source: Quit also via Escape key
ar: اخرج أيضًا عبر مفتاح الإفلات
zh_tw: 也透過 Escape 按鍵離開

# Tool Tip
source: Fast method to exit. For those who are used to using the Escape key.
ar: طريقة سريعة للخروج. لأولئك الذين اعتادوا على استخدام مفتاح الإفلات.
zh_tw: 最快的離開方式。 給習慣使用 Escape 鍵的人用。

source: This resets all options. Not only those of the current topic.
ar: هذا يعيد ضبط كل الخيارات. ليس فقط خيارات الموضوع الحالي.
zh_tw: 這會重設所有選項，不只是目前主題的選項。

source: PreprocessorCmd:
ar: أمر المعالج المسبق:
zh_tw: 前置處理命令：

source: The following option(s) you selected might change data:
ar: الخيار (أو الخيارات) الذي حددته قد يغير البيانات:
zh_tw: 您所選擇的以下選項可能會變更資料：

source: Most likely this is not wanted during a merge. Do you want to disable these settings or continue with these settings active?
ar: على الأرجح هذا غير مرغوب به أثناء الدمج. هل تريد تعطيل هذه الإعدادات أم المتابعة مع هذه الإعدادات المفعلة؟
zh_tw: 通常這在合併時不會希望使用 您要停用這些設定，還是要維持它們啟用而直接繼續？

source: Option Unsafe for Merging
ar: خيار غير آمن للدمج
zh_tw: 對於合併不安全的選項

source: Use These Options During Merge
ar: استخدم هذه الخيارات أثناء الدمج
zh_tw: 合併時繼續維持使用

source: Disable Unsafe Options
ar: عطّل الخيارات غير الآمنة
zh_tw: 停用不安全的選項

# Status message
source: Loading A: %1
ar: يحمّل أ: %1
zh_tw: 正在載入 A：%1

# Status message
source: Loading B: %1
ar: يحمّل ب: %1
zh_tw: 正在載入 B：%1

# Status message
source: Diff: A <-> B
ar: فرق: أ <-> ب
zh_tw: 差異：A <-> B

# Status message
source: Linediff: A <-> B
ar: فرق السطر: أ <-> ب

# Status message
source: Loading C: %1
ar: يحمّل ج: %1
zh_tw: 正在載入 C：%1

# Status message
source: Diff: A <-> C
ar: فرق: أ <-> ج
zh_tw: 差異：A <-> C

# Status message
source: Diff: B <-> C
ar: فرق: ب <-> ج
zh_tw: 差異：B <-> C

# Status message
source: Linediff: B <-> C
ar: فرق السطر: ب <-> ج

# Status message
source: Linediff: A <-> C
ar: فرق السطر: أ <-> ج

# Error message
source: Not enough memory to complete request.
ar: ذاكرة غير كافية لإكمال الطلب.
zh_tw: 記憶體不足以完成請求。

source: An internal error occurred: %1
ar: حدث خطأ داخلي: %1
zh_tw: 發生內部錯誤：%1

source: Too many lines in diff. Skipping file.
ar: عدد الأسطر في الفرق أكثر من اللازم. سيُتخطى الملف.
zh_tw: 差異中有太多行了。正在跳過檔案。

source: All input files contain the same text, but are not binary equal.
ar: كل ملفات الإدخال تحتوي على النص نفسه، ولكنها ليست متساوية ثنائيًا.
zh_tw: 所有輸入檔都有相同的文字內容，但檔案內容卻不完全相同。

source: Files %1 and %2 have equal text, but are not binary equal.
ar: الملفان %1 و %2 لهما النص نفسه، ولكنهما ليسا متساويين ثنائيًا.
zh_tw: 檔案 %1 與 %2 內容文字完全相同，但檔案內容不完全相同。

source: Some input files do not seem to be pure text files. Note that the KDiff3 merge was not meant for binary data. Continue at your own risk.
ar: بعض ملفات الإدخال لا تبدو كأنها ملفات نصية بحتة. لاحظ أن دمج المقارن لم يكن مخصصًا للبيانات الثنائية. واصل على مسؤوليتك الخاصة.
zh_tw: 某些輸入檔看來不完全是純文字檔。 請注意，KDiff3 合併並非設計給二進制資料使用。 請確認風險後再考慮繼續。

source: , B
ar: ، ب

source: , C
ar: ، ج

source: Some input characters could not be converted to valid unicode. You might be using the wrong codec. (e.g. UTF-8 for non UTF-8 files). Do not save the result if unsure. Continue at your own risk. Affected input files are in %1.
ar: بعض أحرف الإدخال تعذّر تحويلها إلى يونيكود صالح. قد تكون تستخدم ترميزًا خاطئًا. (مثال: UTF-8 لملفات غير UTF-8). لا تحفظ الناتج إذا كنت غير متأكد. واصل على مسؤوليتك الخاصة. ملفات الإدخال المتأثرة في %1.

source: Abort
ar: ١أجهض
zh_tw: 中止

source: Continue Merging
ar: تابع الدمج
zh_tw: 繼續合併

source: Opening files...
ar: يفتح الملفات...
zh_tw: 開啟檔案中...

source: Cutting selection...
ar: جاري قطع الاختيار...
zh_tw: 正在剪下所選取的項目...

source: Copying selection to clipboard...
ar: جاري نسخ الاختيار إلى الحافظة...
zh_tw: 正在複製所選取的項目到剪貼簿...

source: Inserting clipboard contents...
ar: جاري إدراج محتويات الحافظة...
zh_tw: 正在插入剪貼簿內容...

source: Ok
ar: حسنا
zh_tw: 確定

source: Go to Line
ar: اذهب إلى السطر
zh_tw: 跳至行數

source: Word wrap (Cancel disables word wrap)
ar: لفّ الكلمات (الإلغاء يعطّل لفّ الكلمات)
zh_tw: 文字折行（取消會停用文字折行）

source: Calculating max width for horizontal scrollbar
ar: يحسب أقصى عرض لشريط التمرير الأفقي
zh_tw: 正在計算水平捲軸列的最大寬度

source: Save && Continue
ar: احفظ وتابع
zh_tw: 儲存並繼續

source: Continue Without Saving
ar: تابع دون حفظ
zh_tw: 不儲存但繼續

source: Search complete.
ar: اكتمل البحث.
zh_tw: 搜尋完成。

source: Search Complete
ar: اكتمل البحث
zh_tw: 搜尋完成

source: Nothing is selected in either diff input window.
ar: لم يُحدد أي شيء في أي من نوافذ فروقات الإدخال.
zh_tw: 雙方差異輸入視窗中都沒有選取任何東西。

source: Error while adding manual diff range
ar: خطأ أثناء إضافة نطاق فرق يدوي
zh_tw: 新增手動比對範圍時發生錯誤

source: &Cancel
ar: أل&غِ
zh_tw: 取消(&C)

source: Swap %1<->%2
ar: تبديل %1<->%2
zh_tw: 交換 %1<->%2

source: Copy %1->Output
ar: انسخ %1->مخرج
zh_tw: 複製 %1 -> 輸出

source: Swap %1<->Output
ar: بدّل %1<->مخرج
zh_tw: 交換 %1 <-> 輸出

source: Configure...
ar: اضبط...
zh_tw: 設定...

source: Open Folder
ar: افتح مجلّد
zh_tw: 開啟資料夾

source: Select Output File
ar: اختر ملفّ الخرج
zh_tw: 選擇輸出檔

source: Search text:
ar: ابحث عن نص:
zh_tw: 搜尋文字：

source: Case sensitive
ar: حسّاس لحالة الأحرف
zh_tw: 區分大小寫

source: Search A
ar: ابحث في أ
zh_tw: 搜尋 A

source: Search B
ar: ابحث في ب
zh_tw: 搜尋 B

source: Search C
ar: ابحث في ج
zh_tw: 搜尋 C

source: Search output
ar: ابحث في المخرج
zh_tw: 搜尋輸出

source: &Search
ar: ا&بحث
zh_tw: 搜尋(&S)

source: Regular Expression Tester
ar: مختبِر التعبير النمطي
zh_tw: 正規表示式測試器

source: Example auto merge line:
ar: مثال على سطر الدمج الآلي:
zh_tw: 範例自動合併行：

# Tool Tip
source: To test auto merge, copy a line as used in your files.
ar: لاختبار الدمج الآلي، انسخ سطرًا كما استخدم في ملفاتك.

source: Match result:
ar: ناتج المطابقة:
zh_tw: 相符結果：

source: Example history start line (with leading comment):
ar: مثال على سطر بدء السجل (مع تعليق في البداية):
zh_tw: 範例歷史開始行（包含開頭的註解）：

# Tool Tip
source: Copy a history start line as used in your files, including the leading comment.
ar: انسخ سطر بدء سجل كما استخدم في ملفاتك، بما في ذلك التعليق في البداية.

source: History sort key order:
ar: ترتيب مفتاح فرز السجل:
zh_tw: 歷史鍵值排序依據：

source: Example history entry start line (without leading comment):
ar: مثال على سطر بدء إدخال السجل (دون تعليق في البداية):
zh_tw: 範例歷史項目開始行（不包含開頭的註解）：

# Tool Tip
source: Copy a history entry start line as used in your files, but omit the leading comment.
ar: انسخ سطر بدء إدخال سجل كما استخدم في ملفاتك، ولكن احذف التعليق في البداية.

source: Sort key result:
ar: ناتج مفتاح الفرز:
zh_tw: 排序鍵值結果：

source: Match success.
ar: نجاح المطابقة.
zh_tw: 有相符。

source: Match failed.
ar: فشلت المطابقة.
zh_tw: 沒有相符。

source: Opening and closing parentheses do not match in regular expression.
ar: الأقواس المفتوحة والمغلقة لا تتطابق في التعبير النمطي.
zh_tw: 正則表達式中左右引號數量不一致。

source: Writing clipboard data to temp file failed.
ar: فشل كتابة بيانات الحافظة إلى الملف المؤقت.
zh_tw: 將剪貼簿資料寫入暫存檔失敗。

source: From Clipboard
ar: من الحافظة
zh_tw: 從剪貼簿

source: %1 is not a normal file.
ar: %1 ليس ملفًا عاديًا.
zh_tw: %1 不是一般檔案。

# Error message. %1 = filepath
source: File %1 too large to process. Skipping.
ar: الملف %1 كبير جدًا للمعالجة. سيُتخطى.
zh_tw: 檔案 %1 太大而無法處理。正在跳過。

source: Temp file is: %1
ar: الملف المؤقت هو: %1
zh_tw: 暫存檔是：%1

source: Preprocessing possibly failed. Check this command: %1 The preprocessing command will be disabled now.
ar: احتمال فشل الإجراء التمهيدي. افحص هذا الأمر: %1 سيُعطل الإجراء التمهيدي الآن.
zh_tw: 前置處理可能已失敗。請檢查此指令： %1 前置處理指令將會被關閉。

source: The line-matching-preprocessing possibly failed. Check this command: %1 The line-matching-preprocessing command will be disabled now.
ar: من المحتمل أن تكون المعالجة المسبقة لمطابقة الأسطر قد فشلت. تحقّق من هذا الأمر: %1 سيُعطّل أمر المعالجة المسبقة لمطابقة الأسطر الآن.
zh_tw: 逐行比對預處理可能已失敗。請檢查此指令： %1 逐行比對預處理指令將被關閉。

# Read error message. %1 = filepath
source: Failed to read file: %1
ar: فشل في قراءة ملف: %1
zh_tw: 無法讀取檔案：%1

source: Opens documents for comparison...
ar: يفتح المستندات للمقارنة...
zh_tw: 開啟要比較的文件...

source: Reload
ar: أعد التحميل
zh_tw: 重新載入

source: Saves the merge result. All conflicts must be solved!
ar: يحفظ ناتج الدمج. كل التضاربات يجب أن تُحل!
zh_tw: 會儲存合併結果。所有衝突必須都已被解決！

source: Saves the current document as...
ar: يحفظ المستند الحالي كـ...
zh_tw: 將目前文件儲存為...

source: Print the differences
ar: اطبع الفروقات
zh_tw: 列印出差異

source: Quits the application
ar: يخرج من التطبيق
zh_tw: 離開應用程式

source: Undo last action.
ar: تراجع عن الإجراء الأخير.
zh_tw: 復原上一次動作。

source: Cuts the selected section and puts it to the clipboard
ar: يقُصُ المقطع المُنتقَى ويضعه في حافظة القُصاصات
zh_tw: 剪下所選取的部分並放到剪貼簿

source: Copies the selected section to the clipboard
ar: ينسخ المقطع المُنتقى إلى حافظة القُصاصات
zh_tw: 複製所選取的部分並放到剪貼簿

source: Pastes the clipboard contents to current position
ar: يلصق محتويات الحافظة في الموضع الحالي
zh_tw: 貼上剪貼簿內容到目前位置

source: Select everything in current window
ar: حدد كل شيء في النافذة الحالية
zh_tw: 選取目前視窗中的全部

source: Expecting space after closing quote.
ar: يُتوقع وجود مسافة بعد علامة الاقتباس الختامية.
zh_tw: 在關閉引號後面應該要有空白。

source: Unmatched quote.
ar: علامة اقتباس غير متطابقة.
zh_tw: 未配對的引號。

source: Unexpected quote character within argument.
ar: حرف اقتباس غير متوقع ضمن الوسيط.
zh_tw: 在參數內有未預期中的引號。

source: No program specified.
ar: لم يحدد برنامج.
zh_tw: 沒有指定程式。

source: Encoding:
zh_tw: 編碼：

source: Encoding: %1
zh_tw: 編碼：%1

source: Line end style: %1
zh_tw: 行結尾樣式：%1

source: Unknown
zh_tw: 未知

source: Dest
zh_tw: 目標

source: Dest:
zh_tw: 目標：

source: Unable to determine full url. No parent specified.
zh_tw: 無法判斷完整網址。未指定親。

source: Failed to read file: %1
zh_tw: 無法讀取檔案：%1

source: Creating temp copy of %1 failed.
zh_tw: 建立 %1 的暫存複本失敗。

source: Opening %1 failed. %2
zh_tw: 開啟 %1 失敗。%2

source: Error reading from %1. %2
zh_tw: 從 %1 讀取時發生錯誤。%2

source: (c) 2002-2014 Joachim Eibl, (c) 2017 Michael Reeves KF5/Qt5 port
zh_tw: (c) 2002-2014 Joachim Eibl, (c) 2017 Michael Reeves KF5/Qt5 移植
