Repository: KDE/kdiff3
Catalog: po/*/kdiff3.po
Languages: ar, zh_tw

source: You are currently doing a folder merge. Are you sure, you want to abort?
ar: أنت الآن بصدد دمج مجلد. هل أنت متأكد من رغبتك في الإجهاض؟
zh_tw: 您正在進行資料夾合併。您確定要中止合併嗎？

source: Saving file...
ar: يحفظ الملفّ...
zh_tw: 正在儲存檔案...

source: Saving file with a new filename...
ar: يحفظ الملفّ باسم ملفّ جديد...
zh_tw: 正在用新檔名儲存檔案...

source: Save As...
ar: احفظ كَ‍...
zh_tw: 另存新檔...

source: Printing not implemented.
ar: الطباعة لم تطبّق.
zh_tw: 列印尚未實作。

source: Printing...
ar: يطبع...
zh_tw: 正在列印...

# Status message
source: Printing page %1 of %2
ar: تطبع الصفحة %1 من %2
zh_tw: 列印中，第 %1 頁，共 %2 頁

source: (Selection)
ar: (التحديد)
zh_tw: (選擇)

source: Printing completed.
ar: اكتملت الطباعة.
zh_tw: 列印已完成。

source: Printing aborted.
ar: أُجهضت الطباعة.
zh_tw: 列印已中止。

source: Exiting...
ar: يُخرج...
zh_tw: 正在離開...

source: Toggle the statusbar...
ar: تبديل شريط الحالة...
zh_tw: 切換狀態列...

source: &File
ar: &ملف
zh_tw: 檔案(&F)

source: F&older
ar: مجلد
zh_tw: 資料夾(&O)

source: Current Item Merge Operation
ar: عملية دمج العنصر الحالي
zh_tw: 目前項目合併操作

source: Current Item Sync Operation
ar: عملية مزامنة العنصر الحالي
zh_tw: 目前項目同步操作

source: M&ovement
ar: ال&حركة
zh_tw: 移動(&O)

source: D&iffview
ar: عارض الفروقات
zh_tw: 差異檢視(&I)

source: M&erge
ar: ادمج
zh_tw: 合併(&E)

source: &Window
ar: &نافذة
zh_tw: 視窗(&W)

source: Main Toolbar
ar: شريط الأدوات الرئيسي
zh_tw: 主工具列

source: Ignored. (User defined.)
ar: تُجاهل. (معرّفة من المستخدم.)
zh_tw: 已忽略。（使用者定義）

source: KDiff3
ar: المقارن

# Program version info.
source: (64 bit)
ar: (64 بتّة)
zh_tw: (64 位元)

source: Tool for Comparison and Merge of Files and Folders
ar: أداة لمقارنة ودمج الملفات والمجلدات
zh_tw: 用來比對或合併檔案與資料夾的工具

source: ©2002-2014 Joachim Eibl, ©2017 Michael Reeves KF5/Qt5 port
ar: ©2002-2014 يواخيم إيبل، ©2017 مايكل ريفز النقل إلى KF5/Qt5

source: Merge the input.
ar: ادمج المدخل.
zh_tw: 合併輸入。

source: Explicit base file. For compatibility with certain tools.
ar: ملف أساس صريح. للتوافق مع أدوات معينة.
zh_tw: 明確指定的基底檔案。用來改善與其他某些工具的相容性。

source: Output file. Implies -m. E.g.: -o newfile.txt
ar: ملف الإخراج. يعني -m. مثال: -o newfile.txt
zh_tw: 輸出檔案。同時暗示指定 -m。例如：-o newfile.txt

source: Output file, again. (For compatibility with certain tools.)
ar: ملف إخراج، مجددًا. (للتوافق مع أدوات معينة.)
zh_tw: 輸出檔案，再重複一次。（此選項用來改善與其他某些工具的相容性。）

source: No GUI if all conflicts are auto-solvable. (Needs -o file)
ar: لا يوجد واجهة رسومية إذا كانت كل التضاربات قابلة للحل آليًا. (يتطلب ملف -o)
zh_tw: 所有衝突皆可自動解決時不開啟圖形介面。（需要指定 -o 檔案）

source: Ignore --auto and always show GUI.
ar: تجاهل --auto وأظهر الواجهة الرسومية دائمًا.
zh_tw: 忽略 --auto 而總是顯示圖形介面。

source: Ignored.
ar: مُتجاهَل.
zh_tw: 已忽略。

source: Visible name replacement for input file 1 (base).
ar: استبدال الاسم المرئي لملف الإدخال 1 (الأساس).
zh_tw: 輸入檔 1（基底）的顯示名稱代替。

source: Visible name replacement for input file 2.
ar: استبدال الاسم المرئي لملف الإدخال 2.
zh_tw: 輸入檔 2 的顯示名稱代替。

source: Visible name replacement for input file 3.
ar: استبدال الاسم المرئي لملف الإدخال 3.
zh_tw: 輸入檔 3 的顯示名稱代替。

source: Alternative visible name replacement. Supply this once for every input.
ar: استبدال اسم مرئي بديل. وفّر هذا لمرة واحدة لكل إدخال.
zh_tw: 替代的顯示名稱代替。請為每一個輸入都指定一次。

source: Override a config setting. Use once for every setting. E.g.: --cs "AutoAdvance=1"
ar: تجاوز إعدادًا. استخدمه مرة واحدة لكل إعداد. مثال: --cs "AutoAdvance=1"
zh_tw: 覆寫某設定選項。為每一個要覆寫的選項都指定一次。例如：--cs "AutoAdvance=1"

source: Show list of config settings and current values.
ar: أظهر قائمة الإعدادات وقيمها الحالية.
zh_tw: 顯示設定選項與目前值的一覽。

source: Use a different config file.
ar: استخدم ملف إعدادات مختلف.
zh_tw: 使用另一個設定檔案。

source: file1 to open (base, if not specified via --base)
ar: file1 للفتح (الأساس، إذا لم يحدد بـ --base)
zh_tw: 要開啟的檔案 1(若未指定 --base 則以此為基底)

source: file2 to open
ar: ملف2 المراد فتحه
zh_tw: 要開啟的檔案 2

source: file3 to open
ar: ملف3 المراد فتحه
zh_tw: 要開啟的檔案 3

source: See kdiff3 --help for supported options.
ar: انظر المقارن --help للخيارات المدعومة.
zh_tw: 用 kdiff3 --help 來閱讀支援的選項。

source: Unable to compare non-normal file with normal file.
ar: تعذّر مقارنة ملف غير عادي بملف عادي.

source: Mix of links and normal files.
ar: مزج بين الارتباطات والملفات العادية.
zh_tw: 連結與一般檔案混合。

source: Link:
ar: الرابط:
zh_tw: 連結：

source: Size.
ar: الحجم.
zh_tw: 大小。

source: Date & Size:
ar: التاريخ و الحجم:
zh_tw: 日期與大小：

# Status message
source: Comparing file...
ar: يقارن الملف...
zh_tw: 正在比對檔案...

source: Choose A Everywhere
ar: اختر أ في كل مكان
zh_tw: 在所有地方選擇 A

source: Choose B Everywhere
ar: اختر ب في كل مكان
zh_tw: 在所有地方選擇 B

source: Choose C Everywhere
ar: اختر ج في كل مكان
zh_tw: 在所有地方選擇 C

source: Choose A for All Unsolved Conflicts
ar: اختر أ لكل التضاربات غير المحلولة
zh_tw: 為所有未解決的衝突選擇 A

source: Choose B for All Unsolved Conflicts
ar: اختر ب لكل التضاربات غير المحلولة
zh_tw: 為所有未解決的衝突選擇 B

source: Choose C for All Unsolved Conflicts
ar: اختر ج لكل التضاربات غير المحلولة
zh_tw: 為所有未解決的衝突選擇 C

source: Choose A for All Unsolved Whitespace Conflicts
ar: اختر أ لكل تضاربات المسافات البيضاء غير المحلولة
zh_tw: 為所有未解決的空白衝突選擇 A

source: Choose B for All Unsolved Whitespace Conflicts
ar: اختر ب لكل تضاربات المسافات البيضاء غير المحلولة
zh_tw: 為所有未解決的空白衝突選擇 B

source: Choose C for All Unsolved Whitespace Conflicts
ar: اختر ج لكل تضاربات المسافات البيضاء غير المحلولة
zh_tw: 為所有未解決的空白衝突選擇 C

source: Number of remaining unsolved conflicts: %1 (of which %2 are whitespace)
ar: عدد التضاربات غير المحلولة المتبقية: %1 (منها %2 مسافات بيضاء)
zh_tw: 剩餘未解決衝突數量：%1（其中 %2 個是空白衝突）

source: The output has been modified. If you continue your changes will be lost.
ar: المخرج قد عُدّل. إذا واصلت، ستُفقد تغييراتك.
zh_tw: 輸出已被變更。 若您繼續，您的變更將會遺失。

source: All input files are binary equal.
ar: كل ملفات الإدخال متساوية ثنائيًا.
zh_tw: 所有輸入檔都有相同的內容。

source: All input files contain the same text.
ar: كل ملفات الإدخال تحتوي على النص نفسه.
zh_tw: 所有輸入檔都有相同的文字內容。

source: Files %1 and %2 are binary equal.
ar: الملفان %1 و %2 متساويان ثنائيًا.
zh_tw: 檔案 %1 與 %2 內容完全相同。

source: Files %1 and %2 have equal text.
ar: الملفان %1 و %2 لهما النص نفسه.
zh_tw: 檔案 %1 與 %2 內容文字完全相同。

source: Total number of conflicts: %1 Number of automatically solved conflicts: %2 Number of unsolved conflicts: %3 %4
ar: العدد الإجمالي للتضاربات: %1 عدد التضاربات التي حُلّت آليًا: %2 عدد التضاربات غير المحلولة: %3 %4
zh_tw: 衝突總數：%1 自動解決衝突數：%2 未解決衝突數：%3 %4

source: Conflicts
ar: التعارضات
zh_tw: 衝突

source: <No src line>
ar: <لا يوجد سطر مصدر>
zh_tw: <沒有來源行>

source: <Merge Conflict (Whitespace only)>
ar: <تضارب دمج (مسافات بيضاء فقط)>
zh_tw: <合併衝突（僅空白）>

source: <Merge Conflict>
ar: <تضارب دمج>
zh_tw: <合併衝突>

source: Not all conflicts are solved yet. File not saved.
ar: لم تُحل كل التضاربات بعد. لم يحفظ الملف.
zh_tw: 還有未解決的衝突。 檔案未儲存。

# Dialog title
source: Conflicts Left
ar: التضاربات المتبقية
zh_tw: 剩餘衝突

source: There is a line end style conflict. Please choose the line end style manually. File not saved.
ar: يوجد تضارب في نمط نهاية السطر. يرجى اختيار نمط نهاية السطر يدويًا. لم يحفظ الملف.
zh_tw: 有行結尾樣式的衝突。請手動選擇行結尾樣式。 檔案未儲存。

source: Creating backup failed. File not saved.
ar: فشل إنشاء النسخة الاحتياطية. لم يحفظ الملف.
zh_tw: 建立備份時失敗。檔案未儲存。

source: File Save Error
ar: خطأ في حفظ الملف
zh_tw: 檔案儲存錯誤

source: Output file may contain replacement characters for unrecognized code points.
ar: قد يحتوي ملف الإخراج على أحرف استبدال لنقاط ترميز غير معروفة.

source: Error while writing.
ar: خطأ أثناء الكتابة.
zh_tw: 寫入時發生錯誤。

source: Output:
ar: الخرج:
zh_tw: 輸出：

source: [Modified]
ar: [معدّل]
zh_tw: [已修改]

source: Encoding for saving:
ar: الترميز للحفظ:
zh_tw: 儲存用的編碼：

source: Line end style:
ar: نمط نهاية السطر:
zh_tw: 行結尾樣式：

source: Unix
ar: يونكس

source: DOS
ar: دوس

source: Conflict
ar: تعارض
zh_tw: 衝突

source: Codec from A: %1
ar: الترميز من أ: %1

source: Codec from B: %1
ar: الترميز من ب: %1

source: Codec from C: %1
ar: الترميز من ج: %1

source: Select file (not saving yet)
ar: حدد الملف (لا يُحفظ بعد)

source: Dialog
ar: حواريّ
zh_tw: 對話框

source: B:
ar: ب:

source: A (Base):
ar: أ (الأساس):
zh_tw: A (基底)：

source: Output (Optional):
ar: المخرج (اختياري):
zh_tw: 輸出（非必要）：

source: File...
ar: ملف…
zh_tw: 檔案...

source: Swap/Copy Names...
ar: بدّل/انسخ الأسماء...
zh_tw: 交換/複製名稱...

source: C (Optional):
ar: ج (اختياري):
zh_tw: C (選擇性)：

source: Folder...
ar: المجلد...
zh_tw: 資料夾...

# No text styling
source: none
ar: لا شيء
zh_tw: 無

# Font sample display, %1 = family, %2 = style, %3 = size
source: Font: %1, %2, %3 Example:
ar: الخط: %1, %2, %3 مثال:
zh_tw: 字型：%1, %2, %3 範例：

source: Latin1
ar: اللاتينيّة1

# Tool Tip
source: Change this if non-ASCII characters are not displayed correctly.
ar: غيّر هذا إذا كانت الأحرف غير الآسكية لا تُعرض بشكل صحيح.
zh_tw: 如果非 ASCII 字元無法正確顯示，請變更這個選項。

source: Configure
ar: اضبط
zh_tw: 設定

source: Font
ar: الخط
zh_tw: 字型

source: Editor & Diff Output Font
ar: خط المحرر ومخرج الفروقات
zh_tw: 編輯器與差異輸出字型

source: Application font
ar: خط التطبيق
zh_tw: 應用程式字型

source: File view font
ar: خط عارض الملف
zh_tw: 檔案檢視字型

# Title for color settings page
source: Color
ar: اللون
zh_tw: 顏色

source: Colors Settings
ar: إعدادات الألوان
zh_tw: 顏色設定

source: Editor and Diff Views:
ar: المحرر وعروض الفروقات:
zh_tw: 編輯器與差異檢視：

source: Foreground color:
ar: لون الأمامية:
zh_tw: 前景顏色：

source: Background color:
ar: لون الخلفية:
zh_tw: 背景顏色：

source: Diff background color:
ar: لون خلفية الفروقات:
zh_tw: 差異背景顏色：

source: Color A:
ar: اللون أ:
zh_tw: 顏色 A：

source: Color B:
ar: اللون ب:
zh_tw: 顏色 B：

source: Color C:
ar: اللون ج:
zh_tw: 顏色 C：

source: Conflict color:
ar: لون التضارب:
zh_tw: 衝突顏色：

source: Current range background color:
ar: لون خلفية النطاق الحالي:
zh_tw: 目前範圍的背景顏色：

source: Current range diff background color:
ar: لون خلفية فروقات النطاق الحالي:
zh_tw: 目前範圍的差異背景顏色：

source: Color for manually aligned difference ranges:
ar: لون نطاقات الفروقات المحاذية يدويًا:
zh_tw: 手動對齊的差異範圍的顏色：

source: Folder Comparison View:
ar: عارض مقارنة المجلدات:
zh_tw: 資料夾比對檢視：

source: Newest file color:
ar: لون أحدث ملف:
zh_tw: 最新的檔案的顏色：

source: Changing this color will only be effective when starting the next folder comparison.
ar: سيصبح تغيير هذا اللون ساري المفعول فقط عند بدء مقارنة المجلد التالية.
zh_tw: 對於這個顏色的變更在下次開始資料夾比對的時候才會生效。

source: Oldest file color:
ar: لون أقدم ملف:
zh_tw: 最舊的檔案的顏色：

source: Middle age file color:
ar: لون ملف متوسط العمر:
zh_tw: 年齡居中的檔案的顏色：

source: Color for missing files:
ar: لون الملفات المفقودة:
zh_tw: 缺失檔案的顏色：

source: Editor
ar: المحرّر
zh_tw: 編輯器

source: Editor Behavior
ar: سلوك المحرر
zh_tw: 編輯器行為

source: Tab inserts spaces
ar: الجدولة تُدرج مسافات
zh_tw: Tab 鍵輸入空格

# Tool Tip
source: On: Pressing tab generates the appropriate number of spaces. Off: A tab character will be inserted.
ar: مفعّل: الضغط على جدولة يولد العدد المناسب من المسافات. معطل: سيُدرج حرف جدولة.
zh_tw: 開啟：按下 Tab 會產生合適數量的空格。 關閉：按下 Tab 會輸入 tab 字元（定位字元）。

source: Tab size:
ar: حجم الجدولة:
zh_tw: 定位字元寬度：

source: Auto indentation
ar: الإزاحة الآليّة
zh_tw: 自動縮排

# Tool Tip
source: On: The indentation of the previous line is used for a new line.
ar: مفعّل: تُستخدم مسافة السطر السابق لسطر جديد.
zh_tw: 開啟：前一行的縮排會用在新的行上面。

source: Auto copy selection
ar: انسخ التحديد آليًا
zh_tw: 自動複製選取

# Tool Tip
source: On: Any selection is immediately written to the clipboard. Off: You must explicitly copy e.g. via Ctrl-C.
ar: مفعّل: أي تحديد يُكتب فورًا إلى الحافظة. معطل: يجب عليك النسخ صراحةً عبر Ctrl-C.
zh_tw: 開啟：選取後會馬上將選取內容寫入剪貼簿。 關閉：您必須明確透過例如 Ctrl-C 來進行複製。

# Unix line ending
source: Unix
ar: يونكس

# Dos/Windows line ending
source: Dos/Windows
ar: دوس/وندوز

# Automatically detected line ending
source: Autodetect
ar: اكتشفه آليًّا
zh_tw: 自動偵測

# Tool Tip
source: Sets the line endings for when an edited file is saved. DOS/Windows: CR+LF; UNIX: LF; with CR=0D, LF=0A
ar: يضبط نهايات الأسطر عند حفظ الملف المعدل. DOS/Windows: CR+LF; UNIX: LF; مع CR=0D، LF=0A
zh_tw: 設定儲存編輯後檔案時要使用的行結尾。 DOS/Windows：CR+LF；UNIX：LF；其中 CR 字元為 0D，LF 為 0A

source: Diff
ar: الفرق
zh_tw: 比較

source: Diff Settings
ar: إعدادات الفرق
zh_tw: Diff 設定

source: Ignore numbers (treat as white space)
ar: تجاهل الأرقام (عاملها كمسافات بيضاء)
zh_tw: 忽略數字（把它們當作空白）

# Tool Tip
source: Ignore number characters during line matching phase. (Similar to Ignore white space.) Might help to compare files with numeric data.
ar: تجاهل أحرف الأرقام أثناء مرحلة مطابقة الأسطر. (شبيه بتجاهل المسافات البيضاء.) قد يساعد في مقارنة الملفات ذات البيانات الرقمية.
zh_tw: 在比對行的階段時忽略數字字元（類似忽略空白字元）。 可能可以幫助比對包含數字資料的檔案。

source: Ignore C/C++ comments (treat as white space)
ar: تجاهل تعليقات C/C++ (عاملها كمسافات بيضاء)
zh_tw: 忽略 C/C++ 註解（當作是空白）

# Tool Tip
source: Treat C/C++ comments like white space.
ar: عامل تعليقات C/C++ كمسافات بيضاء.
zh_tw: 把 C/C++ 註解當作是空白。

source: Ignore case (treat as white space)
ar: تجاهل الحالة (عاملها كمسافات بيضاء)
zh_tw: 忽略大小寫（當作是空白）

# Tool Tip
source: Treat case differences like white space changes. ('a'<=>'A')
ar: عامل فروقات الحالة كفروقات في المسافات البيضاء. ('أ'<=>'أ')
zh_tw: 把大小寫差異（'a' <=> 'A'）當作是空白差異。

source: Preprocessor command:
ar: أمر المعالج المسبق:
zh_tw: 前置處理器命令：

# Tool Tip
source: User defined pre-processing. (See the docs for details.)
ar: معالجة مسبقة يحددها المستخدم. (انظر الوثائق للتفاصيل.)
zh_tw: 使用者定義的前置處理。（詳情請見說明文件。）

source: Line-matching preprocessor command:
ar: أمر المعالج المسبق لمطابقة السطر:
zh_tw: 逐行比對前置處理指令：

# Tool Tip
source: This pre-processor is only used during line matching. (See the docs for details.)
ar: هذا المعالج المسبق يستخدم فقط أثناء مطابقة الأسطر. (انظر الوثائق للتفاصيل.)
zh_tw: 這個前置處理器只會在比對行時使用。 （詳情請見說明文件。）

source: Try hard (slower)
ar: حاول بجهد (أبطأ)
zh_tw: 找出更細微的差異（比較慢）

# Tool Tip
source: Enables the --minimal option for the external diff. The analysis of big files will be much slower.
ar: يُفعّل الخيار --minimal للفروقات الخارجية. تحليل الملفات الكبيرة سيكون أبطأ بكثير.
zh_tw: 會啟用外部 diff 的 --minimal 選項。 大檔案的分析會變得慢很多。

source: Align B and C for 3 input files
ar: حاذِ ب وج لـ 3 ملفات إدخال
zh_tw: 有 3 個輸入檔時將 B 與 C 對齊

# Tool Tip
source: Try to align B and C when comparing or merging three input files. Not recommended for merging because merge might get more complicated. (Default is off.)
ar: حاول محاذاة ب و ج عند مقارنة أو دمج ثلاثة ملفات إدخال. لا يوصى به للدمج لأن الدمج قد يصبح أكثر تعقيدًا. (المبدئي هو معطل.)
zh_tw: 比對或合併 3 個輸入檔時將 B 與 C 對齊。 不建議用於合併，因為合併可能會變得更複雜。 （預設關閉。）

# Settings page
source: Merge
ar: ادمج
zh_tw: 合併

source: Merge Settings
ar: إعدادات الدمج
zh_tw: 合併設定

source: Auto advance delay (ms):
ar: تأخير التقدم الآلي (بالملي ثانية):
zh_tw: 自動前進延遲（毫秒）：

# Tool Tip
source: When in Auto-Advance mode the result of the current selection is shown for the specified time, before jumping to the next conflict. Range: 0-2000 ms
ar: عندما يكون وضع التقدم الآلي مفعّلاً، يُعرض ناتج التحديد الحالي للوقت المحدد، قبل الانتقال إلى التضارب التالي. النطاق: 0-2000 مللي ثانية
zh_tw: 使用自動前進模式時，目前選取區的結果會顯示一段時間（時長在此指定），過了之後會跳到 下一個衝突。範圍：0-2000 毫秒

source: Show info dialogs
ar: أظهر حوارات المعلومات
zh_tw: 顯示資訊對話框

# Tool Tip
source: Show a dialog with information about the number of conflicts.
ar: أظهر حوارًا بمعلومات حول عدد التضاربات.
zh_tw: 顯示包含衝突數量資訊的對話框。

source: White space 2-file merge default:
ar: المبدئي لدمج ملفين بمسافات بيضاء:
zh_tw: 空白字元 2 檔案合併預設值：

source: Manual Choice
ar: اختيار يدوي
zh_tw: 手動選擇

# Tool Tip
source: Allow the merge algorithm to automatically select an input for white-space-only changes.
ar: اسمح لخوارزمية الدمج باختيار مدخل آليًا لتغييرات المسافات البيضاء فقط.
zh_tw: 讓合併演算法自動為只有空白的變更選取輸入。

source: White space 3-file merge default:
ar: المبدئي لدمج 3 ملفات بمسافات بيضاء:
zh_tw: 空白字元 3 檔案合併預設值：

source: Automatic Merge Regular Expression
ar: تعبير نمطي للدمج الآلي
zh_tw: 自動合併的正則表達式

source: Auto merge regular expression:
ar: تعبير نمطي للدمج الآلي:
zh_tw: 自動合併正規表示式：

source: Run regular expression auto merge on merge start
ar: نفّذ دمجًا آليًا بالتعبير النمطي عند بدء الدمج
zh_tw: 在開始合併時執行正則表達式自動合併

# Tool Tip
source: Run the merge for auto merge regular expressions immediately when a merge starts.
ar: نفّذ الدمج للتعبيرات النمطية للدمج الآلي فورًا عند بدء الدمج.
zh_tw: 開始合併時馬上為自動合併正則表達式執行合併。

source: Version Control History Merging
ar: دمج سجل التحكم بالإصدار
zh_tw: 版本控制歷史合併

source: History start regular expression:
ar: تعبير نمطي لبدء السجل:
zh_tw: 歷史開始的正則表達式：

source: History entry start regular expression:
ar: تعبير نمطي لبدء إدخال السجل:
zh_tw: 歷史項目開始的正則表達式：

source: History merge sorting
ar: فرز دمج السجل
zh_tw: 歷史合併排序方式

# Tool Tip
source: Sort version control history by a key.
ar: افرُز سجل التحكم بالإصدار حسب مفتاح.
zh_tw: 以鍵值為版本控制歷史排序。

source: History entry start sort key order:
ar: ترتيب مفتاح الفرز لبدء إدخال السجل:
zh_tw: 歷史項目開始的鍵值排序依據：

source: Merge version control history on merge start
ar: ادمج سجل التحكم بالإصدار عند بدء الدمج
zh_tw: 開始合併時合併版本控制歷史

# Tool Tip
source: Run version control history auto-merge on merge start.
ar: نفّذ دمجًا آليًا لسجل التحكم بالإصدار عند بدء الدمج.
zh_tw: 在開始合併時執行版本控制歷史自動合併。

source: Max number of history entries:
ar: أقصى مدخلات في تاريخ :
zh_tw: 歷史紀錄最高項目數：

# Tool Tip
source: Cut off after specified number. Use -1 for infinite number of entries.
ar: اقتطع بعد العدد المحدد. استخدم -1 لعدد لا نهائي من الإدخالات.
zh_tw: 在指定數量後切斷。使用 -1 來指定無限個項目。

source: Test your regular expressions
ar: اختبر تعبيراتك النمطية
zh_tw: 測試您的正則表達式

source: Irrelevant merge command:
ar: أمر دمج غير مهم:
zh_tw: 無關合併命令：

# Tool Tip
source: If specified this script is run after auto-merge when no other relevant changes were detected. Called with the parameters: filename1 filename2 filename3
ar: إذا حُدّد، سيُنفّذ هذا السكربت بعد الدمج الآلي عندما لا تُكشف أي تغييرات أخرى ذات صلة. يُستدعى مع المعلمات: filename1 filename2 filename3
zh_tw: 指定時，自動合併若沒有偵測到其他相關的變更，就會在完成後執行這個文稿。 執行時的參數為：檔名1 檔名2 檔名3

source: Auto save and quit on merge without conflicts
ar: احفظ واخرج آليًا عند الدمج دون تضاربات
zh_tw: 合併後沒有衝突時自動儲存並離開

# Tool Tip
source: If KDiff3 was started for a file-merge from the command line and all conflicts are solvable without user interaction then automatically save and quit. (Similar to command line option "--auto".)
ar: إذا بدأ المقارن لدمج ملف من سطر الأوامر وكل التضاربات قابلة للحل دون تدخل المستخدم، فحينئذٍ احفظ واخرج آليًا. (شبيه بخيار سطر الأوامر "--auto".)
zh_tw: 如果 KDiff3 從命令列啟動進行檔案合併，且所有衝突都不需要使用者互動 即可自動解決的話，則自動解決、儲存並離開。 （類似命令列選項 "--auto"。）

# Tab title label
source: Folder
ar: المجلد
zh_tw: 資料夾

source: Recursive folders
ar: المجلدات التكرارية
zh_tw: 遞迴資料夾

# Tool Tip
source: Whether to analyze subfolders or not.
ar: ما إذا كنت تريد تحليل المجلدات الفرعية أم لا.
zh_tw: 是否要分析子資料夾。

source: File pattern(s):
ar: نمط (أو أنماط) الملف:
zh_tw: 檔案樣式：

# Tool Tip
source: Pattern(s) of files to be analyzed. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
ar: نمط (أو أنماط) الملفات التي ستحلل. أحرف البدل: '*' و '؟' يمكن تحديد عدة أنماط باستخدام الفاصلة المنقوطة: ';'
zh_tw: 要分析的檔案名稱樣式。 萬用字元：'*' 與 '?' 可以使用分隔符 ';' 來指定多個樣式

source: File-anti-pattern(s):
ar: نمط (أو أنماط) مضادة للملفات:
zh_tw: 檔案排除樣式：

# Tool Tip
source: Pattern(s) of files to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
ar: نمط (أو أنماط) الملفات التي ستستثنى من التحليل. أحرف البدل: '*' و '؟' يمكن تحديد عدة أنماط باستخدام الفاصلة المنقوطة: ';'
zh_tw: 要從分析中排除的檔案名稱樣式。 萬用字元：'*' 與 '?' 可以使用分隔符 ';' 來指定多個樣式

source: Folder-anti-pattern(s):
ar: نمط (أو أنماط) مضادة للمجلدات:
zh_tw: 資料夾排除樣式：

# Tool Tip
source: Pattern(s) of folders to be excluded from analysis. Wildcards: '*' and '?' Several Patterns can be specified by using the separator: ';'
ar: نمط (أو أنماط) المجلدات التي ستستثنى من التحليل. أحرف البدل: '*' و '؟' يمكن تحديد عدة أنماط باستخدام الفاصلة المنقوطة: ';'
zh_tw: 要從分析中排除的資料夾名稱樣式。 萬用字元：'*' 與 '?' 可以使用分隔符 ';' 來指定多個樣式

source: Use Ignore File
ar: استخدم ملف التجاهل
zh_tw: 使用忽略檔案

# Tool Tip
source: Extends the anti-pattern to anything that would be ignored by source control. Via local ignore files this can be folder-specific.
ar: يوسّع النمط المضاد ليشمل أي شيء يتجاهله التحكم بالمصدر. عبر ملفات التجاهل المحلية يمكن أن يكون هذا خاصًا بالمجلد.
zh_tw: 也排除版本控制工具在 .gitignore 等檔案中所忽略的檔案。 在有本地忽略檔案時，排除的檔案可能依資料夾而不同。

source: Find hidden files and folders
ar: ابحث عن الملفات والمجلدات المخفية
zh_tw: 尋找隱藏檔案和資料夾

# Tool Tip
source: Finds hidden files and folders.
ar: يجد الملفات والمجلدات المخفية.
zh_tw: 尋找隱藏檔案和資料夾。

source: Follow file links
ar: تابع ارتباطات الملفات
zh_tw: 跟隨檔案連結

# Tool Tip
source: On: Compare the file the link points to. Off: Compare the links.
ar: مفعّل: قارن الملف الذي يشير إليه الارتباط. معطل: قارن الارتباطات.
zh_tw: 開啟：比對連結所指向的檔案。 關閉：比對連結本身。

source: Follow folder links
ar: تابع ارتباطات المجلدات
zh_tw: 跟隨資料夾連結

# Tool Tip
source: On: Compare the folder the link points to. Off: Compare the links.
ar: مفعّل: قارن المجلد الذي يشير إليه الارتباط. معطل: قارن الارتباطات.
zh_tw: 開啟：比對連結所指向的資料夾。 關閉：比對連結本身。

source: Case sensitive filename comparison
ar: مقارنة اسم الملف حساسة لحالة الأحرف
zh_tw: 比對檔案名稱時區分大小寫

# Tool Tip
source: The folder comparison will compare files or folders when their names match. Set this option if the case of the names must match. (Default for Windows is off, otherwise on.)
ar: ستقارن المجلدات الملفات أو المجلدات عندما تتطابق أسماؤها. عيّن هذا الخيار إذا كانت حالة الأحرف للأسماء يجب أن تتطابق. (المبدئي لويندوز هو معطل، وإلا فهو مفعّل.)
zh_tw: 資料夾比對會在名稱相符時比對檔案或資料夾。 設定這個選項來讓大小寫也必須一致。（預設是在 Windows 上關閉，其他平台則開啟。）

source: Unfold all subfolders on load
ar: افرد كل المجلدات الفرعية عند التحميل
zh_tw: 載入時展開所有子資料夾

# Tool Tip
source: On: Unfold all subfolders when starting a folder diff. Off: Leave subfolders folded.
ar: مفعّل: افرد كل المجلدات الفرعية عند بدء مقارنة المجلدات. معطل: اترك المجلدات الفرعية مطوية.
zh_tw: 開啟：開始進行資料夾比對時展開所有子資料夾。 關閉：讓子資料夾繼續收起。

source: Skip folder status report
ar: تخطّ تقرير حالة المجلد
zh_tw: 跳過資料夾狀態回報

# Tool Tip
source: On: Do not show the Folder Comparison Status. Off: Show the status dialog on start.
ar: مفعّل: لا تظهر حالة مقارنة المجلدات. معطل: أظهر حوار الحالة عند البدء.
zh_tw: 開啟：不要顯示資料夾比對狀態。 關閉：開啟時顯示狀態對話框。

source: File Comparison Mode
ar: وضع مقارنة الملفات
zh_tw: 檔案比對模式

source: Binary comparison
ar: مقارنة ثنائية
zh_tw: 二進制比對

# Tool Tip
source: Binary comparison of each file. (Default)
ar: مقارنة ثنائية لكل ملف. (افتراضي)
zh_tw: 各個檔案的二進制比對。（預設）

source: Full analysis
ar: تحليل كامل
zh_tw: 完整分析

# Tool Tip
source: Do a full analysis and show statistics information in extra columns. (Slower than a binary comparison, much slower for binary files.)
ar: نفّذ تحليلًا كاملًا وأظهر معلومات الإحصائيات في أعمدة إضافية. (أبطأ من مقارنة ثنائية، وأبطأ بكثير للملفات الثنائية.)
zh_tw: 進行完整分析，並在額外欄位顯示統計資訊。 （比二進制比對還要慢，尤其是在二進制檔案上面會更慢）

source: Trust the size and modification date (unsafe)
ar: ثِق بالحجم وتاريخ التعديل (غير آمن)
zh_tw: 信任大小和變更日期（不安全）

# Tool Tip
source: Assume that files are equal if the modification date and file length are equal. Files with equal contents but different modification dates will appear as different. Useful for big folders or slow networks.
ar: افترض أن الملفات متطابقة إذا كان تاريخ التعديل وطول الملف متساويين. الملفات ذات المحتويات المتطابقة ولكن تواريخ التعديل المختلفة ستظهر كأنها مختلفة. مفيد للمجلدات الكبيرة أو الشبكات البطيئة.
zh_tw: 變更時間與檔案大小相同時就將檔案視為相同。 內容相同但變更時間不同的檔案會被當成不同的檔案。 在透過較慢的網路進行比對，或是比對大資料夾的時候很有用。

source: Trust the size and date, but use binary comparison if date does not match (unsafe)
ar: ثِق بالحجم والتاريخ، ولكن استخدم المقارنة الثنائية إذا لم يتطابق التاريخ (غير آمن)
zh_tw: 信任檔案大小和更新時間，而時間不符時使用二進制比對（不安全）
