Repository: KDE/kdiff3
Catalog: po/*/kdiff3.po
Languages: ar, zh_tw

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
zh_tw: Frank Weng (a.k.a. Franklin), Kisaragi Hiu

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
zh_tw: franklin@goodhorse.idv.tw, mail@kisaragi-hiu.com

source: Getting file status: %1
ar: جاري طلب حالة الملف: %1
zh_tw: 正在取得檔案狀態：%1

# Message for progress dialog %1 = path to file
source: Reading file: %1
ar: يقرأ الملف: %1
zh_tw: 正在讀取檔案：%1

# Message for progress dialog %1 = path to file
source: Writing file: %1
ar: يكتب الملف: %1
zh_tw: 正在寫入檔案：%1

source: Out of memory
ar: نفذت الذّاكرة
zh_tw: 記憶體不足

# Message for progress dialog %1 = path to file
source: Making folder: %1
ar: ينشئ مجلد: %1
zh_tw: 正在建立資料夾：%1

# Message for progress dialog %1 = path to file
source: Removing folder: %1
ar: يحذف المجلّد: %1
zh_tw: 正在移除資料夾：%1

# Message for progress dialog %1 = path to file
source: Removing file: %1
ar: يحذف الملف: %1
zh_tw: 正在移除檔案：%1

source: Creating symbolic link: %1 -> %2
ar: ينشئ ارتباط رمزي: %1 -> %2
zh_tw: 建立符號連結中：%1 -> %2

source: Renaming file: %1 -> %2
ar: إعادة تسمية الملف: %1 -> %2
zh_tw: 重新命名檔案中：%1 -> %2

source: Copying file: %1 -> %2
ar: نسخ الملف: %1 -> %2
zh_tw: 正在複製檔案中：%1 -> %2

# Status message
source: Reading folder: %1
ar: يقرأ المجلد: %1
zh_tw: 正在讀取資料夾：%1

source: Listing directory: %1
ar: أُدرج الدليل: %1
zh_tw: 正在列出目錄：%1

source: Data loss error: If it is reproducible please contact the author.
ar: خطأ بفقدان البيانات: إذا كان قابلاً للاستنساخ، يرجى الاتصال بالمؤلف.
zh_tw: 資料遺失錯誤： 如果這個問題可重複發生，請與作者聯繫。

source: Severe Internal Error
ar: خطأ داخلي فادح
zh_tw: 嚴重內部錯誤

source: File %1: Line %2
ar: الملف %1: السطر %2
zh_tw: 檔案 %1：行 %2

source: File %1: Line not available
ar: الملف %1: السطر غير موجود
zh_tw: 檔案 %1：無法取得行

# @label:textbox Encoding for text
source: Encoding:
ar: الترميز:

# @label:textbox
source: Line end style:
ar: نمط نهاية السطر:

source: A (Base)
ar: أ (الأساس)
zh_tw: A(基底)

# @label:textbox Encoding for text, %1 = encoding name
source: Encoding: %1
ar: الترميز: %1

# @item:intext line ending type
source: DOS
ar: دوس

# @item:intext line ending type
source: Unix
ar: يونكس

# @label:textbox %1 = line ending style
source: Line end style: %1
ar: نمط نهاية السطر: %1

# @item:intext line ending style not recognized
source: Unknown
ar: مجهول

source: Top line
ar: السطر الأعلى
zh_tw: 頂端行

source: End
ar: النهاية
zh_tw: 結束

source: Open File
ar: افتح الملف
zh_tw: 開啟檔案

source: Unicode, 8 bit
ar: يونيكود، 8 بت
zh_tw: Unicode, 8 位元

source: Unicode, 8 bit (BOM)
ar: يونيكود، 8 بت (BOM)
zh_tw: Unicode, 8 位元 (BOM)

source: System
ar: النظام

source: Other
ar: أخرى
zh_tw: 其他

# Operation column message
source: Copy A to B
ar: أنسخ أ إلى ب
zh_tw: 將 A 複製到 B

# Operation column message
source: Copy B to A
ar: أنسخ ب إلى أ
zh_tw: 將 B 複製到 A

# Operation column message
source: Delete A
ar: احذف أ
zh_tw: 刪除 A

# Operation column message
source: Delete B
ar: احذف ب
zh_tw: 刪除 B

# Operation column message
source: Delete A & B
ar: احذف أ و ب
zh_tw: 刪除 A 與 B

# Operation column message
source: Merge to A
ar: ادمج إلى أ
zh_tw: 合併到 A

# Operation column message
source: Merge to B
ar: ادمج إلى ب
zh_tw: 合併到 B

# Operation column message
source: Merge to A & B
ar: ادمج إلى أ و ب
zh_tw: 合併到 A 與 B

# Operation column message
source: Delete (if exists)
ar: احذف (إذا كان موجود)
zh_tw: 刪除（若存在）

# Operation column message (Directory merge)
source: Merge
ar: ادمج
zh_tw: 合併

# Operation column message (File merge)
source: Merge (manual)
ar: دمج (يدوي)
zh_tw: 合併（手動）

# Operation column message
source: Error: Conflicting File Types
ar: خطأ: أنواع ملفات متعارضة
zh_tw: 錯誤：衝突的檔案型態

# Operation column message
source: Error: Changed and Deleted
ar: خطأ: غُير وحُذف
zh_tw: 錯誤：已變更又已刪除

# Operation column message
source: Error: Dates are equal but files are not.
ar: خطأ: التواريخ متساوية ولكن الملفات ليست كذلك.
zh_tw: 錯誤：日期相同，但檔案不同。

# Status column message
source: Done
ar: تمّ
zh_tw: 完成

# Status column message
source: Error
ar: خطأ
zh_tw: 錯誤

# Status column message
source: Skipped.
ar: تُخطّي.
zh_tw: 已跳過。

# Status column message
source: Not saved.
ar: ليس محفوظًا
zh_tw: 未儲存。

# Status column message
source: In progress...
ar: جاري...
zh_tw: 進行中...

# Status column message
source: To do.
ar: المهمّة.
zh_tw: 待辦。

# Column title
source: Name
ar: الاسم
zh_tw: 名稱

# Column title
source: Operation
ar: العملية
zh_tw: 操作

# Column title
source: Status
ar: الحالة
zh_tw: 狀態

# Column title
source: Unsolved
ar: غير محلولة
zh_tw: 未解決

# Column title
source: Solved
ar: حُلّت
zh_tw: 已解決

# Column title
source: Nonwhite
ar: غير أبيض
zh_tw: 非空白

# Column title
source: White
ar: أبيض
zh_tw: 空白

source: You are currently doing a folder merge. Are you sure, you want to abort the merge and rescan the folder?
ar: أنت الآن بصدد دمج مجلد. هل أنت متأكد من رغبتك في إجهاض الدمج وإعادة مسح المجلد؟
zh_tw: 您正在進行資料夾合併。您確定要中止合併並重新掃描資料夾嗎？

# Error dialog title
source: Warning
ar: =تحذير
zh_tw: 警告

# Title for rescan button
source: Rescan
ar: أعد المسح
zh_tw: 重新掃描

# Title for continue button
source: Continue Merging
ar: تابع الدمج
zh_tw: 繼續合併

source: Opening of folders failed:
ar: فشل في فتح المجلدات:
zh_tw: 開啟資料夾失敗：

source: Folder A "%1" does not exist or is not a folder.
ar: المجلد أ ”%1“ غير موجود أو ليس مجلدًا.
zh_tw: 資料夾 A "%1" 不存在，又或是它不是資料夾。

source: Folder B "%1" does not exist or is not a folder.
ar: المجلد ب ”%1“ غير موجود أو ليس مجلدًا.
zh_tw: 資料夾 B "%1" 不存在，又或是它不是資料夾。

source: Folder C "%1" does not exist or is not a folder.
ar: المجلد ج ”%1“ غير موجود أو ليس مجلدًا.
zh_tw: 資料夾 C "%1" 不存在，又或是它不是資料夾。

# Error dialog title
source: Folder Opening Error
ar: خطأ في فتح المجلد
zh_tw: 檔案開啟時發生錯誤

source: The destination folder must not be the same as A or B when three folders are merged. Check again before continuing.
ar: لا يجوز أن يكون مجلد الوجهة هو نفسه مجلد أ أو ب عند دمج ثلاثة مجلدات. تحقّق مجددًا قبل المتابعة.

# Error dialog title
source: Parameter Warning
ar: تحذير بشأن المعاملات
zh_tw: 參數警告

source: Scanning folders...
ar: يفحص المجلدات…
zh_tw: 正在掃描資料夾...

# Status message
source: Reading Folder A
ar: يقرأ المجلد أ
zh_tw: 正在讀取資料夾 A

# Status message
source: Reading Folder B
ar: يقرأ المجلد ب
zh_tw: 正在讀取資料夾 B

# Status message
source: Reading Folder C
ar: يقرأ المجلد ج
zh_tw: 正在讀取資料夾 C

# Warning text
source: Some subfolders were not readable in
ar: بعض المجلدات الفرعية لم تكن قابلة للقراءة في
zh_tw: 此資料夾裡的某些子資料夾無法讀取：

# Warning text
source: Check the permissions of the subfolders.
ar: تحقق من أذونات المجلدات الفرعية.
zh_tw: 請檢查子資料夾的權限。

# Status bar idle message.
source: Ready.
ar: جاهز.
zh_tw: 已就緒。

source: Folder Comparison Status Number of subfolders: %1 Number of equal files: %2 Number of different files: %3
ar: حالة مقارنة المجلدات عدد المجلدات الفرعية: %1 عدد الملفات المتطابقة: %2 عدد الملفات المختلفة: %3
zh_tw: 資料夾比對狀態 子資料夾數量：%1 相同檔案數量：%2 不同檔案數量：%3

source: Number of manual merges: %1
ar: عدد عمليات الدمج اليدوية: %1
zh_tw: 手動合併數量：%1

source: This affects all merge operations.
ar: هذا يؤثر على كل عمليات الدمج.
zh_tw: 這會影響所有的合併操作。

source: Changing All Merge Operations
ar: غيّر كل عمليات الدمج
zh_tw: 變更所有合併操作

source: Processing %1 / %2 %3
ar: يعالج %1 / %2 %3
zh_tw: 處理中 %1/%2 %3

source: Some files could not be processed.
ar: بعض الملفات تعذّر معالجتها.
zh_tw: 某些檔案無法處理。

source: Aborting due to too many errors.
ar: تُجهض بسبب كثرة الأخطاء.
zh_tw: 由於錯誤太多，正在中止。

source: This operation is currently not possible.
ar: هذه العملية ليست ممكنة حالياً.
zh_tw: 此操作目前無法運作。

source: Operation Not Possible
ar: العملية غير ممكنة
zh_tw: 無法進行操作

source: An error occurred while copying.
ar: حدث خطأ أثناء النسخ.
zh_tw: 複製時發生錯誤。

source: Merge Error
ar: خطأ في الدمج
zh_tw: 合併錯誤

source: Unknown merge operation. (This must never happen!)
ar: عملية دمج مجهولة. (هذا لا يجوز أن يحدث أبدًا!)
zh_tw: 未知的合併操作。（此問題不應該發生！）

source: Unknown merge operation.
ar: عملية دمج مجهولة.
zh_tw: 未知的合併操作。

source: The merge is about to begin. Choose "Do it" if you have read the instructions and know what you are doing. Choosing "Simulate it" will tell you what would happen. Be aware that this program still has beta status and there is NO WARRANTY whatsoever! Make backups of your vital data!
ar: الدمج على وشك أن يبدأ. اختر "نفّذه" إذا كنت قد قرأت التعليمات وتعرف ماذا تفعل. اختيار "حاكه" سيخبرك بما سيحدث. كن على علم أن هذا البرنامج ما يزال بحالة بيتا وليست هناك أي ضمانات على الإطلاق! نفّذ نسخ احتياطية لبياناتك المهمة!
zh_tw: 準備開始合併。 若是您已經讀完說明並知道自己在做什麼，就選擇「做吧！」 您也可以先選擇「先模擬一次」來看看結果。 要注意，這個程式仍然在測試階段，不保證結果是否有問題。請先備份您的重要資料！

# Caption
source: Starting Merge
ar: بدء الدمج
zh_tw: 開始合併中

# Button title to confirm merge
source: Do It
ar: قم بذلك
zh_tw: 做吧！

# Button title to simulate merge
source: Simulate It
ar: حاكه
zh_tw: 先模擬一次

source: The highlighted item has a different type in the different folders. Select what to do.
ar: العنصر المميز له نوع مختلف في المجلدات المختلفة. حدد ما يجب فعله.
zh_tw: 突顯的項目在不同資料夾裡有不同的類型。請選擇要怎麽做。

source: The modification dates of the file are equal but the files are not. Select what to do.
ar: تواريخ تعديل الملف متساوية ولكن الملفات ليست كذلك. حدد ما يجب فعله.
zh_tw: 檔案的更新日期相同，但檔案本身不相同。請選擇要怎麽做。

source: The highlighted item was changed in one folder and deleted in the other. Select what to do.
ar: العنصر المميز غُيّر في مجلد وحُذف في الآخر. حدد ما يجب فعله.
zh_tw: 突顯的項目在一個資料夾有變更而在另一個資料夾已刪除。請選擇要怎麽做。

source: This operation is currently not possible because folder merge is currently running.
ar: هذه العملية غير ممكنة حاليًا لأن دمج المجلدات قيد التشغيل حاليًا.
zh_tw: 此操作目前無法運作，因為目前正在進行資料夾合併。

source: There was an error in the last step. Do you want to continue with the item that caused the error or do you want to skip this item?
ar: حدث خطأ في الخطوة الأخيرة. هل تريد المتابعة مع العنصر الذي سبب الخطأ أم تريد تخطي هذا العنصر؟
zh_tw: 上一步有出現錯誤。 您要在出現錯誤的項目上繼續進行，還是要跳過它？

# Caption for message dialog
source: Continue merge after an error
ar: تابع الدمج بعد حدوث خطأ
zh_tw: 發生錯誤之後繼續合併

# Continue button title
source: Continue With Last Item
ar: تابع مع العنصر الأخير
zh_tw: 從上一個項目繼續

# Skip button title
source: Skip Item
ar: تخطَّ العنصر
zh_tw: 跳過項目

source: Merge operation complete.
ar: اكتملت عملية الدمج.
zh_tw: 合併操作完成。

source: Merge Complete
ar: اكتمل الدمج
zh_tw: 合併完成

source: Simulated merge complete: Check if you agree with the proposed operations.
ar: اكتملت محاكاة الدمج: تحقّق مما إذا كنت موافقًا على العمليات المقترحة.
zh_tw: 模擬合併完成：請檢查是否同意此合併結果。

source: An error occurred. Press OK to see detailed information.
ar: حدث خطأ. اضغط على ”حسناً“ لمشاهدة المعلومات التفصيلية.
zh_tw: 發生錯誤。按「確定」看詳細資訊。

source: Error: While deleting %1: Creating backup failed.
ar: خطأ: أثناء حذف %1: فشل إنشاء النسخة الاحتياطية.
zh_tw: 錯誤：刪除 %1 時建立備份失敗。

source: delete folder recursively( %1 )
ar: احذف المجلد تكراريًا (%1)
zh_tw: 遞迴刪除資料夾（%1）

source: delete( %1 )
ar: احذف( %1 )
zh_tw: 刪除（%1）

source: Error: delete folder operation failed while trying to read the folder.
ar: خطأ: فشلت عملية حذف المجلد أثناء محاولة قراءة المجلد.
zh_tw: 錯誤：刪除資料夾失敗，無法讀取。

source: Error: rmdir( %1 ) operation failed.
ar: خطأ: فشلت عملية rmdir( %1 ).
zh_tw: 錯誤：移除目錄（%1）失敗。

source: Error: delete operation failed.
ar: خطأ: فشلت عملية الحذف.
zh_tw: 錯誤：刪除失敗。

source: manual merge( %1, %2, %3 -> %4)
ar: دمج يدوي( %1, %2, %3 -> %4)
zh_tw: 手動合併（%1, %2, %3 → %4）

source: Note: After a manual merge the user should continue by pressing F7.
ar: ملاحظة: بعد دمج يدوي، يجب على المستخدم المتابعة بالضغط على F7.
zh_tw: 注意：手動合併後使用者應按下 F7 來繼續。

source: Error: copy( %1 -> %2 ) failed.Deleting existing destination failed.
ar: خطأ: فشلت النسخة ( %1 -> %2 ). فشل حذف الوجهة الحالية.
zh_tw: 錯誤：複製（%1 → %2）失敗。刪除現有目的地失敗。

source: copyLink( %1 -> %2 )
ar: انسخ الارتباط( %1 -> %2 )
zh_tw: 複製連結( %1 -> %2 )

source: Error: copyLink failed: Remote links are not yet supported.
ar: خطأ: فشل copyLink: الارتباطات البعيدة ليست مدعومة بعد.
zh_tw: 錯誤：複製連結失敗。尚未支援遠端連結。

source: Error: copyLink failed.
ar: خطأ: فشل copyLink.
zh_tw: 錯誤：複製連結失敗。

source: copy( %1 -> %2 )
ar: نسخ( %1 -> %2 )
zh_tw: 複製（%1 -> %2）

source: Error during rename( %1 -> %2 ): Cannot delete existing destination.
ar: خطأ أثناء إعادة التسمية( %1 -> %2 ): لا يمكن حذف الوجهة الحالية.
zh_tw: 重新命名（%1 → %2）時發生錯誤：無法刪除既有的目的地。

source: rename( %1 -> %2 )
ar: إعادة تسمية( %1 -> %2 )
zh_tw: 重新命名（%1->%2）

source: Error: Rename failed.
ar: خطأ: فشلت إعادة التسمية.
zh_tw: 錯誤：重新命名失敗。

source: Error during makeDir of %1. Cannot delete existing file.
ar: خطأ أثناء إنشاء الدليل %1. لا يمكن حذف الملف الحالي.
zh_tw: 為 %1 建立目錄時發生錯誤。無法刪除現有檔案。

source: makeDir( %1 )
ar: إنشاء دليل( %1 )
zh_tw: 建立目錄(%1)

source: Error while creating folder.
ar: خطأ أثناء إنشاء المجلّد.
zh_tw: 建立資料夾時發生錯誤。

# @label:textbox
source: Dest:
ar: الوجهة:

# Header label
source: Folder
ar: المجلد
zh_tw: 資料夾

# Header label
source: Type
ar: النوع
zh_tw: 類型

# Header label
source: Size
ar: الحجم
zh_tw: 大小

# Header label
source: Attr
ar: صفة
zh_tw: 屬性

# Header label
source: Last Modification
ar: التعديل الأخير
zh_tw: 上次變更

# Header label
source: Link-Destination
ar: مقصد الرابط
zh_tw: 連結目標

# Header label
source: File
ar: ملف
zh_tw: 檔案

# Header label ending
source: -Link
ar: -رابط
zh_tw: -連結

# Header label
source: not available
ar: غير متوفّر
zh_tw: 無法使用

source: A (Dest):
ar: أ (الوجهة):
zh_tw: A(目標)：

source: A:
ar: أ:

source: A (Base):
ar: أ (الأساس):
zh_tw: A(基底)：

source: B (Dest):
ar: ب (الوجهة):
zh_tw: B(目標)：

source: B:
ar: ب:

source: C (Dest):
ar: ج (الوجهة):
zh_tw: C(目標)：

source: C:
ar: ج:

source: Save Folder Merge State As...
ar: احفظ حالة دمج المجلد كـ...
zh_tw: 將資料夾合併狀態另存為...

source: Start/Continue Folder Merge
ar: ابدأ/تابع دمج المجلد
zh_tw: 開始/繼續資料夾合併

source: Run Operation for Current Item
ar: نفّذ العملية للبند الحالي
zh_tw: 為目前項目執行操作

source: Compare Selected File
ar: قارن الملفات المختارة
zh_tw: 比對所選檔案

source: Merge Current File
ar: ادمج الملف الحالي
zh_tw: 合併目前檔案

source: Merge File
ar: ادمج الملف
zh_tw: 合併 檔案

source: Fold All Subfolders
ar: اطوِ كل المجلدات الفرعية
zh_tw: 折疊所有子資料夾

source: Unfold All Subfolders
ar: افرد كل المجلدات الفرعية
zh_tw: 展開所有子資料夾

source: Rescan
ar: أعد المسح
zh_tw: 重新掃描

source: Choose A for All Items
ar: اختر أ لكل العناصر
zh_tw: 為所有項目選擇 A

source: Choose B for All Items
ar: اختر ب لكل العناصر
zh_tw: 為所有項目選擇 B

source: Choose C for All Items
ar: اختر ج لكل العناصر
zh_tw: 為所有項目選擇 C

source: Auto-Choose Operation for All Items
ar: عملية اختيار آليّة لكل البنود
zh_tw: 為所有項目進行自動選擇

source: No Operation for All Items
ar: لا عملية لكل البنود
zh_tw: 對於所有項目沒有任何操作

source: Show Identical Files
ar: اعرض الملفات المتشابهة
zh_tw: 顯示相同的檔案

source: Identical Files
ar: ملفات متطابقة
zh_tw: 相同的 檔案

source: Show Different Files
ar: اعرض الملفات المختلفة
zh_tw: 顯示不同的檔案

source: Show Files only in A
ar: اعرض الملفات فقط في أ
zh_tw: 顯示只有在 A 的檔案

source: Files only in A
ar: ملفات في أ فقط
zh_tw: 只有在 A 的檔案

source: Show Files only in B
ar: اعرض الملفات فقط في ب
zh_tw: 顯示只有在 B 的檔案

source: Files only in B
ar: ملفات في ب فقط
zh_tw: 只有在 B 的檔案

source: Show Files only in C
ar: اعرض الملفات فقط في ج
zh_tw: 顯示只有在 C 的檔案

source: Files only in C
ar: ملفات في ج فقط
zh_tw: 只有在 C 的檔案

source: Compare Explicitly Selected Files
ar: قارن الملفات المحددة صراحة
zh_tw: 比對明確選取的檔案

source: Merge Explicitly Selected Files
ar: ادمج الملفات المحددة صراحة
zh_tw: 合併明確選取的檔案

source: Do Nothing
ar: لا تفعل أي شيئ
zh_tw: 不做任何事

source: Merge
ar: ادمج
zh_tw: 合併

source: Delete (if exists)
ar: احذف ( إذا كان موجود )
zh_tw: 刪除（若存在）

source: Copy A to B
ar: انسخ أ إلى ب
zh_tw: 將 A 複製到 B

source: Copy B to A
ar: انسخ ب إلى أ
zh_tw: 將 B 複製到 A

source: Delete A
ar: احذف أ
zh_tw: 刪除 A

source: Delete B
ar: احذف ب
zh_tw: 刪除 B

source: Delete A && B
ar: احذف أ و ب
zh_tw: 刪除 A 與 B

source: Merge to A
ar: ادمج إلى أ
zh_tw: 合併到 A

source: Merge to B
ar: ادمج إلى ب
zh_tw: 合併到 B

source: Merge to A && B
ar: ادمج إلى أ و ب
zh_tw: 合併到 A 與 B

# @info:shell
source: Unable to determine full url. No parent specified.
ar: لا يمكن تحديد المسار الكامل. لم يحدد مجلد أصلي.

# @info:shell
source: Parent and child could not be distinguished.
ar: تعذّر تمييز المجلد الأصلي عن الفرعي.

# @info:shell
source: Computed url is:
ar: المسار المحسوب هو:

# @info %1 is a path
source: Failed to read file: %1
ar: فشل في قراءة ملف: %1

# @info %1 is a path
source: User cancelled read operation on %1
ar: أجهض المستخدم عملية القراءة على %1

# @info:status
source: User cancelled write operation.
ar: أجهض المستخدم عملية الكتابة.

# @info:status %1 is the destination path
source: Creating temp copy of %1 failed.
ar: فشل إنشاء نسخة مؤقتة من %1.

# @info:status %1 is the path, %2 is the error message
source: Opening %1 failed. %2
ar: فشل فتح %1. %2

# @info:status %1 is the path, %2 is the error message
source: Error reading from %1. %2
ar: خطأ في القراءة من %1. %2

# @info %1 is the path that failed
source: While trying to make a backup, deleting an older backup failed. Filename: %1
ar: أثناء محاولة إنشاء نسخة احتياطية، فشل حذف نسخة احتياطية أقدم. اسم الملف: %1

# @info %1 is the current path, %2 is the failed path
source: While trying to make a backup, renaming failed. Filenames: %1 -> %2
ar: أثناء محاولة إنشاء نسخة احتياطية، فشلت إعادة التسمية. أسماء الملفات: %1 -> %2

source: TextLabel
ar: وسم نصي
zh_tw: 文字標籤

source: The quick brown fox jumps over the river but the little red hen escapes with a shiver :-)
ar: ثعلب سريع بني قفز فوق النهر ولكن دجاجة حمراء صغيرة هربت بارتعاش :-)
zh_tw: The quick brown fox jumps over the river but the little red hen escapes with a shiver :-) 廣角空房亮滑沒過麵以化骨

# Button Title
source: Change Font
ar: غيّر الخط
zh_tw: 變更字型

source: Current Configuration:
ar: الإعدادات الحالية:
zh_tw: 目前設定：

source: Config Option Error:
ar: خطأ في خيار الإعداد:
zh_tw: 設定選項錯誤：

source: Option --auto used, but no output file specified.
ar: استُخدم الخيار --auto، ولكن لم يحدد ملف وجهة.
zh_tw: 已使用選項 --auto，但未指定輸出檔。

source: Directory merge
ar: دمج الدليل
zh_tw: 目錄合併

source: Merge info
ar: معلومات الدمج
zh_tw: 合併資訊

# Error message
source: Can't compare file with folder.
ar: لا يمكن مقارنة ملف مع مجلد.
zh_tw: 無法在檔案與資料夾之間做比對。

# Title error message box
source: Bad comparison attempt
ar: محاولة مقارنة فاشلة
zh_tw: 錯誤的比對嘗試

source: Option --auto ignored for folder comparison.
ar: تُجاهل الخيار --auto لمقارنة المجلدات.
zh_tw: 選項 --auto 已為資料夾比對忽略。

source: Saving failed.
ar: فشل الحفظ.
zh_tw: 儲存失敗。

source: Opening of these files failed:
ar: فشل فتح هذه الملفات:
zh_tw: 開啟這些檔案失敗：

source: File open error
ar: خطأ في فتح الملف
zh_tw: 檔案開啟失敗

source: Enables/disables the statusbar
ar: يُفَعِّل/يُعَطِّل شريط الحالة
zh_tw: 啟動/關閉狀態列

source: Configure KDiff3...
ar: أعدّ المقارن...
zh_tw: 設定 KDiff3...

source: Search for a string
ar: ابحث عن سلسلة
zh_tw: 搜尋字串

source: Search again for the string
ar: ابحث عن السلسلة مجددًا
zh_tw: 搜尋字串的下一個符合

source: Go to Current Delta
ar: اذهب إلى فرق الآن
zh_tw: 跳到目前的差異部分

source: Current Delta
ar: الفرق الآن
zh_tw: 目前的 差異部分

source: Go to First Delta
ar: اذهب إلى أول فرق
zh_tw: 跳到第一個差異部分

source: First Delta
ar: أول فرق
zh_tw: 第一個 差異部分

source: Go to Last Delta
ar: اذهب إلى آخر فرق
zh_tw: 跳到最後一個差異部分

source: Last Delta
ar: آخر فرق
zh_tw: 最後一個 差異部分

# Tooltip explanation text
source: (Skips white space differences when "Show White Space" is disabled.)
ar: (يتخطى فروقات المسافات البيضاء عندما تكون "أظهر المسافات البيضاء" معطلة.)
zh_tw: （「顯示空白字元」選項停用時會跳過空白字元的差異。）

# Tooltip explanation text
source: (Does not skip white space differences even when "Show White Space" is disabled.)
ar: (لا يتخطى فروقات المسافات البيضاء حتى عندما تكون "أظهر المسافات البيضاء" معطلة.)
zh_tw: （「顯示空白字元」選項停用時也還是不會跳過空白字元的差異。）

source: Go to Previous Delta
ar: اذهب إلى الفرق السابق
zh_tw: 跳到上一個差異部分

source: Prev Delta
ar: الفرق السابق
zh_tw: 上一個 差異部分

source: Go to Next Delta
ar: اذهب إلى الفرق التالي
zh_tw: 跳到下一個差異部分

source: Next Delta
ar: الفرق التالي
zh_tw: 下一個 差異部分

source: Go to Previous Conflict
ar: اذهب إلى التضارب السابق
zh_tw: 跳到上一個衝突

source: Prev Conflict
ar: التضارب السابق
zh_tw: 上一個 衝突

source: Go to Next Conflict
ar: اذهب إلى التضارب التالي
zh_tw: 跳到下一個衝突

source: Next Conflict
ar: التضارب التالي
zh_tw: 下一個 衝突

source: Go to Previous Unsolved Conflict
ar: اذهب إلى التضارب السابق غير المحلول
zh_tw: 跳到上一個未解決的衝突

source: Prev Unsolved
ar: التضارب غير المحلول السابق
zh_tw: 上一個 未解決的

source: Go to Next Unsolved Conflict
ar: اذهب إلى التضارب التالي غير المحلول
zh_tw: 跳到下一個未解決的衝突

source: Next Unsolved
ar: التضارب غير المحلول التالي
zh_tw: 下一個 未解決的

# Title for menu item
source: Go to Line
ar: اذهب إلى السطر
zh_tw: 跳至行數

# Text used for toolbar button.
source: Go Line
ar: اذهب إلى سطر
zh_tw: 跳到 行

# Tooltip Text
source: Goto specified line.
ar: اذهب إلى السطر المحدد.
zh_tw: 跳到指定行。

# Title for menu item
source: Select Line(s) From A
ar: اختر السطر (أو السطور) من أ
zh_tw: 從 A 選取行

# Text used for select A toolbar button.
source: Choose A
ar: اختر أ
zh_tw: 選擇 A

# Title for menu item
source: Select Line(s) From B
ar: اختر السطر (أو السطور) من ب
zh_tw: 從 B 選取行

# Text used for select B when toolbar button.
source: Choose B
ar: اختر ب
zh_tw: 選擇 B

# Title for menu item
source: Select Line(s) From C
ar: اختر السطر (أو السطور) من ج
zh_tw: 從 C 選取行

# Text used for select C toolbar button.
source: Choose C
ar: اختر ج
zh_tw: 選擇 C

# Title for menu item
source: Automatically Go to Next Unsolved Conflict After Source Selection
ar: اذهب آليًا إلى التضارب التالي غير المحلول بعد تحديد المصدر
zh_tw: 選擇來源之後自動移動到下一個未解決的衝突

# Auto goto next unsolved toolbar text.
source: Auto Next
ar: آلي التالي
zh_tw: 自動 前進

source: Show Space && Tabulator Characters
ar: أظهر أحرف المسافة و الجدولة
zh_tw: 顯示空白與定位字元

# Show whitespace toolbar text.
source: White Characters
ar: الأحرف البيضاء
zh_tw: 空白 字元

source: Show White Space
ar: أظهر المسافات البيضاء
zh_tw: 顯示空白字元

# Show whitespace changes toolbar text.
source: White Deltas
ar: فروقات بيضاء
zh_tw: 空白 差異部分

source: Show Line Numbers
ar: أظهر أرقام الأسطر
zh_tw: 顯示行號

# Show line numbers toolbar text
source: Line Numbers
ar: رقم السطر
zh_tw: 行號

source: Automatically Solve Simple Conflicts
ar: احلُل التضاربات البسيطة آليًا
zh_tw: 自動解決單純的衝突

source: Set Deltas to Conflicts
ar: اجعل الفروقات تضاربات
zh_tw: 將差異部分設為衝突

source: Run Regular Expression Auto Merge
ar: نفّذ دمجًا آليًا بالتعبير النمطي
zh_tw: 執行正則表達式自動合併

source: Automatically Solve History Conflicts
ar: احلُل تضاربات السجل آليًا
zh_tw: 自動解決歷史衝突

source: Split Diff At Selection
ar: افصل الفرق عند التحديد
zh_tw: 分割選取的差異區間

source: Join Selected Diffs
ar: ضم الفروقات المحددة
zh_tw: 合併選取的差異區間

source: Show Window A
ar: أظهر نافذة أ
zh_tw: 顯示視窗 A

source: Show Window B
ar: أظهر نافذة ب
zh_tw: 顯示視窗 B

source: Show Window C
ar: أظهر نافذة ج
zh_tw: 顯示視窗 C

source: Normal Overview
ar: نظرة عامة عادية
zh_tw: 一般概覽

source: A vs. B Overview
ar: نظرة عامة على أ ضد ب
zh_tw: A 與 B 比對的概覽

source: A vs. C Overview
ar: نظرة عامة على أ ضد ج
zh_tw: A 與 C 比對的概覽

source: B vs. C Overview
ar: نظرة عامة على ب ضد ج
zh_tw: B 與 C 比對的概覽

source: Word Wrap Diff Windows
ar: لفّ نوافذ الفروقات
zh_tw: 差異視窗文字折行

source: Add Manual Diff Alignment
ar: أضف محاذاة فرق يدوي
zh_tw: 新增手動差異對齊

source: Clear All Manual Diff Alignments
ar: امحُ كل محاذاة الفروقات اليدوية
zh_tw: 清除所有手動差異對齊

source: Focus Next Window
ar: ركّز على النافذة التالية
zh_tw: 聚焦下一個視窗

source: Focus Prev Window
ar: ركّز على النافذة السابقة
zh_tw: 聚焦上一個視窗

source: Toggle Split Orientation
ar: بدّل اتجاه التقسيم
zh_tw: 切換分割方向

source: Folder && Text Split Screen View
ar: مجلد وعرض تقسيم شاشة النص
zh_tw: 資料夾與文字分割檢視

source: Toggle Between Folder && Text View
ar: بدّل بين عرض المجلد وعرض النص
zh_tw: 在資料夾與文字檢視之間切換

source: Ready.
ar: جاهز.
zh_tw: 已就緒。

source: The merge result has not been saved.
ar: لم يحفظ ناتج الدمج.
zh_tw: 合併結果尚未儲存。

source: Save && Quit
ar: احفظ واخرج
zh_tw: 儲存並離開

source: Quit Without Saving
ar: اخرج دون حفظ
zh_tw: 離開但不儲存

source: Saving the merge result failed.
ar: فشل حفظ ناتج الدمج.
zh_tw: 儲存合併結果時失敗。
